      ****************************************************
      * PREVIOUS FISCAL YEAR (FR19) WAGE INDEX TABLE     *
      * FOR USE WITH THE IPPS FINAL RULE                 *
      * REVISED 09/10/2019 (FR 2020)                     *
      ****************************************************
       01  PREV-ADJ-TABLE.
           02  PREV-ADJ-DATA.
               05  FILLER   PIC X(13)  VALUE    '01B029 006880'.
               05  FILLER   PIC X(13)  VALUE    '010001 007848'.
               05  FILLER   PIC X(13)  VALUE    '010005 007845'.
               05  FILLER   PIC X(13)  VALUE    '010006 007197'.
               05  FILLER   PIC X(13)  VALUE    '010007 006704'.
               05  FILLER   PIC X(13)  VALUE    '010008 006823'.
               05  FILLER   PIC X(13)  VALUE    '010011 008036'.
               05  FILLER   PIC X(13)  VALUE    '010012 007150'.
               05  FILLER   PIC X(13)  VALUE    '010016 008036'.
               05  FILLER   PIC X(13)  VALUE    '010018 008036'.
               05  FILLER   PIC X(13)  VALUE    '010019 006704'.
               05  FILLER   PIC X(13)  VALUE    '010021 006704'.
               05  FILLER   PIC X(13)  VALUE    '010022 009208'.
               05  FILLER   PIC X(13)  VALUE    '010023 007459'.
               05  FILLER   PIC X(13)  VALUE    '010024 007845'.
               05  FILLER   PIC X(13)  VALUE    '010025 007435'.
               05  FILLER   PIC X(13)  VALUE    '010029 007775'.
               05  FILLER   PIC X(13)  VALUE    '010033 008036'.
               05  FILLER   PIC X(13)  VALUE    '010034 007459'.
               05  FILLER   PIC X(13)  VALUE    '010035 007845'.
               05  FILLER   PIC X(13)  VALUE    '010036 006704'.
               05  FILLER   PIC X(13)  VALUE    '010038 007542'.
               05  FILLER   PIC X(13)  VALUE    '010039 008056'.
               05  FILLER   PIC X(13)  VALUE    '010040 007845'.
               05  FILLER   PIC X(13)  VALUE    '010044 007845'.
               05  FILLER   PIC X(13)  VALUE    '010045 007845'.
               05  FILLER   PIC X(13)  VALUE    '010046 006778'.
               05  FILLER   PIC X(13)  VALUE    '010047 006880'.
               05  FILLER   PIC X(13)  VALUE    '010049 006704'.
               05  FILLER   PIC X(13)  VALUE    '010051 006704'.
               05  FILLER   PIC X(13)  VALUE    '010052 007009'.
               05  FILLER   PIC X(13)  VALUE    '010055 007684'.
               05  FILLER   PIC X(13)  VALUE    '010056 008036'.
               05  FILLER   PIC X(13)  VALUE    '010058 008036'.
               05  FILLER   PIC X(13)  VALUE    '010059 006846'.
               05  FILLER   PIC X(13)  VALUE    '010061 008331'.
               05  FILLER   PIC X(13)  VALUE    '010062 006849'.
               05  FILLER   PIC X(13)  VALUE    '010065 007845'.
               05  FILLER   PIC X(13)  VALUE    '010069 006704'.
               05  FILLER   PIC X(13)  VALUE    '010073 006704'.
               05  FILLER   PIC X(13)  VALUE    '010078 007845'.
               05  FILLER   PIC X(13)  VALUE    '010079 008056'.
               05  FILLER   PIC X(13)  VALUE    '010083 008030'.
               05  FILLER   PIC X(13)  VALUE    '010085 007902'.
               05  FILLER   PIC X(13)  VALUE    '010086 007845'.
               05  FILLER   PIC X(13)  VALUE    '010087 007494'.
               05  FILLER   PIC X(13)  VALUE    '010089 008036'.
               05  FILLER   PIC X(13)  VALUE    '010090 007494'.
               05  FILLER   PIC X(13)  VALUE    '010091 006869'.
               05  FILLER   PIC X(13)  VALUE    '010092 007845'.
               05  FILLER   PIC X(13)  VALUE    '010095 008285'.
               05  FILLER   PIC X(13)  VALUE    '010097 007459'.
               05  FILLER   PIC X(13)  VALUE    '010099 006704'.
               05  FILLER   PIC X(13)  VALUE    '010100 007287'.
               05  FILLER   PIC X(13)  VALUE    '010101 007845'.
               05  FILLER   PIC X(13)  VALUE    '010102 006704'.
               05  FILLER   PIC X(13)  VALUE    '010103 008036'.
               05  FILLER   PIC X(13)  VALUE    '010104 008036'.
               05  FILLER   PIC X(13)  VALUE    '010108 007459'.
               05  FILLER   PIC X(13)  VALUE    '010109 008285'.
               05  FILLER   PIC X(13)  VALUE    '010110 006704'.
               05  FILLER   PIC X(13)  VALUE    '010112 006704'.
               05  FILLER   PIC X(13)  VALUE    '010113 007494'.
               05  FILLER   PIC X(13)  VALUE    '010114 008036'.
               05  FILLER   PIC X(13)  VALUE    '010118 007845'.
               05  FILLER   PIC X(13)  VALUE    '010120 006704'.
               05  FILLER   PIC X(13)  VALUE    '010125 007845'.
               05  FILLER   PIC X(13)  VALUE    '010126 006786'.
               05  FILLER   PIC X(13)  VALUE    '010128 006869'.
               05  FILLER   PIC X(13)  VALUE    '010129 007287'.
               05  FILLER   PIC X(13)  VALUE    '010130 008036'.
               05  FILLER   PIC X(13)  VALUE    '010131 008056'.
               05  FILLER   PIC X(13)  VALUE    '010138 006841'.
               05  FILLER   PIC X(13)  VALUE    '010139 008036'.
               05  FILLER   PIC X(13)  VALUE    '010144 007494'.
               05  FILLER   PIC X(13)  VALUE    '010146 007542'.
               05  FILLER   PIC X(13)  VALUE    '010148 008030'.
               05  FILLER   PIC X(13)  VALUE    '010149 007459'.
               05  FILLER   PIC X(13)  VALUE    '010150 007459'.
               05  FILLER   PIC X(13)  VALUE    '010157 006846'.
               05  FILLER   PIC X(13)  VALUE    '010158 007197'.
               05  FILLER   PIC X(13)  VALUE    '010164 007025'.
               05  FILLER   PIC X(13)  VALUE    '010168 007932'.
               05  FILLER   PIC X(13)  VALUE    '010169 006704'.
               05  FILLER   PIC X(13)  VALUE    '010172 008056'.
               05  FILLER   PIC X(13)  VALUE    '010173 008036'.
               05  FILLER   PIC X(13)  VALUE    '020001 012130'.
               05  FILLER   PIC X(13)  VALUE    '020006 012130'.
               05  FILLER   PIC X(13)  VALUE    '020008 012130'.
               05  FILLER   PIC X(13)  VALUE    '020012 012130'.
               05  FILLER   PIC X(13)  VALUE    '020017 012130'.
               05  FILLER   PIC X(13)  VALUE    '020018 019343'.
               05  FILLER   PIC X(13)  VALUE    '020024 012130'.
               05  FILLER   PIC X(13)  VALUE    '020026 019343'.
               05  FILLER   PIC X(13)  VALUE    '030001 010528'.
               05  FILLER   PIC X(13)  VALUE    '030002 010528'.
               05  FILLER   PIC X(13)  VALUE    '030006 010528'.
               05  FILLER   PIC X(13)  VALUE    '030007 010528'.
               05  FILLER   PIC X(13)  VALUE    '030010 010528'.
               05  FILLER   PIC X(13)  VALUE    '030011 010528'.
               05  FILLER   PIC X(13)  VALUE    '030012 010528'.
               05  FILLER   PIC X(13)  VALUE    '030013 010528'.
               05  FILLER   PIC X(13)  VALUE    '030014 010528'.
               05  FILLER   PIC X(13)  VALUE    '030016 010528'.
               05  FILLER   PIC X(13)  VALUE    '030022 010528'.
               05  FILLER   PIC X(13)  VALUE    '030023 011117'.
               05  FILLER   PIC X(13)  VALUE    '030024 010528'.
               05  FILLER   PIC X(13)  VALUE    '030030 010528'.
               05  FILLER   PIC X(13)  VALUE    '030036 010528'.
               05  FILLER   PIC X(13)  VALUE    '030037 010528'.
               05  FILLER   PIC X(13)  VALUE    '030038 010528'.
               05  FILLER   PIC X(13)  VALUE    '030043 010528'.
               05  FILLER   PIC X(13)  VALUE    '030055 010528'.
               05  FILLER   PIC X(13)  VALUE    '030061 010528'.
               05  FILLER   PIC X(13)  VALUE    '030062 010528'.
               05  FILLER   PIC X(13)  VALUE    '030064 010528'.
               05  FILLER   PIC X(13)  VALUE    '030065 010528'.
               05  FILLER   PIC X(13)  VALUE    '030068 010528'.
               05  FILLER   PIC X(13)  VALUE    '030069 011765'.
               05  FILLER   PIC X(13)  VALUE    '030071 014448'.
               05  FILLER   PIC X(13)  VALUE    '030073 014448'.
               05  FILLER   PIC X(13)  VALUE    '030074 014448'.
               05  FILLER   PIC X(13)  VALUE    '030077 014448'.
               05  FILLER   PIC X(13)  VALUE    '030078 014448'.
               05  FILLER   PIC X(13)  VALUE    '030083 010528'.
               05  FILLER   PIC X(13)  VALUE    '030084 014448'.
               05  FILLER   PIC X(13)  VALUE    '030085 010528'.
               05  FILLER   PIC X(13)  VALUE    '030087 010528'.
               05  FILLER   PIC X(13)  VALUE    '030088 010528'.
               05  FILLER   PIC X(13)  VALUE    '030089 010528'.
               05  FILLER   PIC X(13)  VALUE    '030092 010528'.
               05  FILLER   PIC X(13)  VALUE    '030093 010528'.
               05  FILLER   PIC X(13)  VALUE    '030094 010528'.
               05  FILLER   PIC X(13)  VALUE    '030101 010528'.
               05  FILLER   PIC X(13)  VALUE    '030103 010528'.
               05  FILLER   PIC X(13)  VALUE    '030105 010528'.
               05  FILLER   PIC X(13)  VALUE    '030107 010528'.
               05  FILLER   PIC X(13)  VALUE    '030108 010528'.
               05  FILLER   PIC X(13)  VALUE    '030110 010528'.
               05  FILLER   PIC X(13)  VALUE    '030111 010528'.
               05  FILLER   PIC X(13)  VALUE    '030112 010528'.
               05  FILLER   PIC X(13)  VALUE    '030113 014448'.
               05  FILLER   PIC X(13)  VALUE    '030114 010528'.
               05  FILLER   PIC X(13)  VALUE    '030115 010528'.
               05  FILLER   PIC X(13)  VALUE    '030117 010528'.
               05  FILLER   PIC X(13)  VALUE    '030118 010528'.
               05  FILLER   PIC X(13)  VALUE    '030119 010528'.
               05  FILLER   PIC X(13)  VALUE    '030120 010528'.
               05  FILLER   PIC X(13)  VALUE    '030121 010528'.
               05  FILLER   PIC X(13)  VALUE    '030122 010528'.
               05  FILLER   PIC X(13)  VALUE    '030123 010528'.
               05  FILLER   PIC X(13)  VALUE    '030130 010528'.
               05  FILLER   PIC X(13)  VALUE    '030131 010528'.
               05  FILLER   PIC X(13)  VALUE    '030132 010528'.
               05  FILLER   PIC X(13)  VALUE    '030134 010528'.
               05  FILLER   PIC X(13)  VALUE    '030135 010528'.
               05  FILLER   PIC X(13)  VALUE    '030136 010528'.
               05  FILLER   PIC X(13)  VALUE    '030137 010528'.
               05  FILLER   PIC X(13)  VALUE    '040001 008108'.
               05  FILLER   PIC X(13)  VALUE    '040002 007098'.
               05  FILLER   PIC X(13)  VALUE    '040004 008108'.
               05  FILLER   PIC X(13)  VALUE    '040007 008114'.
               05  FILLER   PIC X(13)  VALUE    '040010 008108'.
               05  FILLER   PIC X(13)  VALUE    '040011 007098'.
               05  FILLER   PIC X(13)  VALUE    '040014 008114'.
               05  FILLER   PIC X(13)  VALUE    '040015 007098'.
               05  FILLER   PIC X(13)  VALUE    '040016 008114'.
               05  FILLER   PIC X(13)  VALUE    '040017 008000'.
               05  FILLER   PIC X(13)  VALUE    '040018 007648'.
               05  FILLER   PIC X(13)  VALUE    '040019 007098'.
               05  FILLER   PIC X(13)  VALUE    '040020 008421'.
               05  FILLER   PIC X(13)  VALUE    '040022 008108'.
               05  FILLER   PIC X(13)  VALUE    '040026 008908'.
               05  FILLER   PIC X(13)  VALUE    '040027 007943'.
               05  FILLER   PIC X(13)  VALUE    '040029 008114'.
               05  FILLER   PIC X(13)  VALUE    '040036 008114'.
               05  FILLER   PIC X(13)  VALUE    '040039 007209'.
               05  FILLER   PIC X(13)  VALUE    '040041 008114'.
               05  FILLER   PIC X(13)  VALUE    '040047 007579'.
               05  FILLER   PIC X(13)  VALUE    '040050 007098'.
               05  FILLER   PIC X(13)  VALUE    '040051 007098'.
               05  FILLER   PIC X(13)  VALUE    '040055 007648'.
               05  FILLER   PIC X(13)  VALUE    '040062 008000'.
               05  FILLER   PIC X(13)  VALUE    '040067 007446'.
               05  FILLER   PIC X(13)  VALUE    '040069 007579'.
               05  FILLER   PIC X(13)  VALUE    '040071 008114'.
               05  FILLER   PIC X(13)  VALUE    '040072 007098'.
               05  FILLER   PIC X(13)  VALUE    '040074 008114'.
               05  FILLER   PIC X(13)  VALUE    '040076 008716'.
               05  FILLER   PIC X(13)  VALUE    '040078 008908'.
               05  FILLER   PIC X(13)  VALUE    '040080 007098'.
               05  FILLER   PIC X(13)  VALUE    '040084 008114'.
               05  FILLER   PIC X(13)  VALUE    '040085 008421'.
               05  FILLER   PIC X(13)  VALUE    '040088 007842'.
               05  FILLER   PIC X(13)  VALUE    '040114 008114'.
               05  FILLER   PIC X(13)  VALUE    '040118 007797'.
               05  FILLER   PIC X(13)  VALUE    '040119 007579'.
               05  FILLER   PIC X(13)  VALUE    '040132 008908'.
               05  FILLER   PIC X(13)  VALUE    '040134 008114'.
               05  FILLER   PIC X(13)  VALUE    '040137 008114'.
               05  FILLER   PIC X(13)  VALUE    '040147 008114'.
               05  FILLER   PIC X(13)  VALUE    '040152 008108'.
               05  FILLER   PIC X(13)  VALUE    '040153 007098'.
               05  FILLER   PIC X(13)  VALUE    '040154 008114'.
               05  FILLER   PIC X(13)  VALUE    '040155 007797'.
               05  FILLER   PIC X(13)  VALUE    '05B121 012500'.
               05  FILLER   PIC X(13)  VALUE    '050002 016923'.
               05  FILLER   PIC X(13)  VALUE    '050006 013647'.
               05  FILLER   PIC X(13)  VALUE    '050007 017301'.
               05  FILLER   PIC X(13)  VALUE    '050008 017282'.
               05  FILLER   PIC X(13)  VALUE    '050009 017282'.
               05  FILLER   PIC X(13)  VALUE    '050013 015649'.
               05  FILLER   PIC X(13)  VALUE    '050014 015862'.
               05  FILLER   PIC X(13)  VALUE    '050017 015862'.
               05  FILLER   PIC X(13)  VALUE    '050018 012827'.
               05  FILLER   PIC X(13)  VALUE    '050022 012500'.
               05  FILLER   PIC X(13)  VALUE    '050024 012500'.
               05  FILLER   PIC X(13)  VALUE    '050025 012500'.
               05  FILLER   PIC X(13)  VALUE    '050026 012500'.
               05  FILLER   PIC X(13)  VALUE    '050028 012500'.
               05  FILLER   PIC X(13)  VALUE    '050030 012500'.
               05  FILLER   PIC X(13)  VALUE    '050036 012500'.
               05  FILLER   PIC X(13)  VALUE    '050038 017827'.
               05  FILLER   PIC X(13)  VALUE    '050039 012500'.
               05  FILLER   PIC X(13)  VALUE    '050040 012827'.
               05  FILLER   PIC X(13)  VALUE    '050042 013647'.
               05  FILLER   PIC X(13)  VALUE    '050043 016923'.
               05  FILLER   PIC X(13)  VALUE    '050045 012500'.
               05  FILLER   PIC X(13)  VALUE    '050047 017282'.
               05  FILLER   PIC X(13)  VALUE    '050054 012500'.
               05  FILLER   PIC X(13)  VALUE    '050055 017282'.
               05  FILLER   PIC X(13)  VALUE    '050056 012827'.
               05  FILLER   PIC X(13)  VALUE    '050057 012500'.
               05  FILLER   PIC X(13)  VALUE    '050058 014349'.
               05  FILLER   PIC X(13)  VALUE    '050060 012500'.
               05  FILLER   PIC X(13)  VALUE    '050063 012827'.
               05  FILLER   PIC X(13)  VALUE    '050067 012891'.
               05  FILLER   PIC X(13)  VALUE    '050069 012603'.
               05  FILLER   PIC X(13)  VALUE    '050070 017301'.
               05  FILLER   PIC X(13)  VALUE    '050071 017827'.
               05  FILLER   PIC X(13)  VALUE    '050072 016900'.
               05  FILLER   PIC X(13)  VALUE    '050073 017030'.
               05  FILLER   PIC X(13)  VALUE    '050075 016923'.
               05  FILLER   PIC X(13)  VALUE    '050076 017282'.
               05  FILLER   PIC X(13)  VALUE    '050077 012500'.
               05  FILLER   PIC X(13)  VALUE    '050078 012827'.
               05  FILLER   PIC X(13)  VALUE    '050082 014349'.
               05  FILLER   PIC X(13)  VALUE    '050084 016738'.
               05  FILLER   PIC X(13)  VALUE    '050089 012603'.
               05  FILLER   PIC X(13)  VALUE    '050090 016738'.
               05  FILLER   PIC X(13)  VALUE    '050091 012827'.
               05  FILLER   PIC X(13)  VALUE    '050093 012500'.
               05  FILLER   PIC X(13)  VALUE    '050096 012827'.
               05  FILLER   PIC X(13)  VALUE    '050099 012603'.
               05  FILLER   PIC X(13)  VALUE    '050100 012500'.
               05  FILLER   PIC X(13)  VALUE    '050101 017030'.
               05  FILLER   PIC X(13)  VALUE    '050102 012500'.
               05  FILLER   PIC X(13)  VALUE    '050103 012827'.
               05  FILLER   PIC X(13)  VALUE    '050104 012827'.
               05  FILLER   PIC X(13)  VALUE    '050107 013666'.
               05  FILLER   PIC X(13)  VALUE    '050108 015862'.
               05  FILLER   PIC X(13)  VALUE    '050110 013666'.
               05  FILLER   PIC X(13)  VALUE    '050111 012827'.
               05  FILLER   PIC X(13)  VALUE    '050112 014349'.
               05  FILLER   PIC X(13)  VALUE    '050113 017301'.
               05  FILLER   PIC X(13)  VALUE    '050115 012500'.
               05  FILLER   PIC X(13)  VALUE    '050116 014349'.
               05  FILLER   PIC X(13)  VALUE    '050118 014493'.
               05  FILLER   PIC X(13)  VALUE    '050121 012500'.
               05  FILLER   PIC X(13)  VALUE    '050122 014493'.
               05  FILLER   PIC X(13)  VALUE    '050124 012827'.
               05  FILLER   PIC X(13)  VALUE    '050125 017827'.
               05  FILLER   PIC X(13)  VALUE    '050126 012827'.
               05  FILLER   PIC X(13)  VALUE    '050127 015862'.
               05  FILLER   PIC X(13)  VALUE    '050128 012500'.
               05  FILLER   PIC X(13)  VALUE    '050129 012603'.
               05  FILLER   PIC X(13)  VALUE    '050131 017538'.
               05  FILLER   PIC X(13)  VALUE    '050132 012827'.
               05  FILLER   PIC X(13)  VALUE    '050133 012500'.
               05  FILLER   PIC X(13)  VALUE    '050135 012827'.
               05  FILLER   PIC X(13)  VALUE    '050136 016738'.
               05  FILLER   PIC X(13)  VALUE    '050137 014349'.
               05  FILLER   PIC X(13)  VALUE    '050138 012827'.
               05  FILLER   PIC X(13)  VALUE    '050139 012827'.
               05  FILLER   PIC X(13)  VALUE    '050140 012603'.
               05  FILLER   PIC X(13)  VALUE    '050145 017986'.
               05  FILLER   PIC X(13)  VALUE    '050149 014349'.
               05  FILLER   PIC X(13)  VALUE    '050150 015862'.
               05  FILLER   PIC X(13)  VALUE    '050152 017282'.
               05  FILLER   PIC X(13)  VALUE    '050153 017827'.
               05  FILLER   PIC X(13)  VALUE    '050158 012827'.
               05  FILLER   PIC X(13)  VALUE    '050159 014349'.
               05  FILLER   PIC X(13)  VALUE    '050167 014493'.
               05  FILLER   PIC X(13)  VALUE    '050168 012603'.
               05  FILLER   PIC X(13)  VALUE    '050169 012827'.
               05  FILLER   PIC X(13)  VALUE    '050174 017282'.
               05  FILLER   PIC X(13)  VALUE    '050179 012891'.
               05  FILLER   PIC X(13)  VALUE    '050180 016900'.
               05  FILLER   PIC X(13)  VALUE    '050189 017986'.
               05  FILLER   PIC X(13)  VALUE    '050191 012827'.
               05  FILLER   PIC X(13)  VALUE    '050192 012500'.
               05  FILLER   PIC X(13)  VALUE    '050194 019025'.
               05  FILLER   PIC X(13)  VALUE    '050195 019025'.
               05  FILLER   PIC X(13)  VALUE    '050196 012500'.
               05  FILLER   PIC X(13)  VALUE    '050197 017827'.
               05  FILLER   PIC X(13)  VALUE    '050204 012827'.
               05  FILLER   PIC X(13)  VALUE    '050205 012827'.
               05  FILLER   PIC X(13)  VALUE    '050211 016923'.
               05  FILLER   PIC X(13)  VALUE    '050222 012500'.
               05  FILLER   PIC X(13)  VALUE    '050224 012603'.
               05  FILLER   PIC X(13)  VALUE    '050225 012500'.
               05  FILLER   PIC X(13)  VALUE    '050226 012603'.
               05  FILLER   PIC X(13)  VALUE    '050228 017282'.
               05  FILLER   PIC X(13)  VALUE    '050230 012603'.
               05  FILLER   PIC X(13)  VALUE    '050231 012827'.
               05  FILLER   PIC X(13)  VALUE    '050232 012805'.
               05  FILLER   PIC X(13)  VALUE    '050234 012500'.
               05  FILLER   PIC X(13)  VALUE    '050235 014349'.
               05  FILLER   PIC X(13)  VALUE    '050236 014349'.
               05  FILLER   PIC X(13)  VALUE    '050238 012827'.
               05  FILLER   PIC X(13)  VALUE    '050239 012827'.
               05  FILLER   PIC X(13)  VALUE    '050242 019025'.
               05  FILLER   PIC X(13)  VALUE    '050243 012500'.
               05  FILLER   PIC X(13)  VALUE    '050245 012603'.
               05  FILLER   PIC X(13)  VALUE    '050248 017986'.
               05  FILLER   PIC X(13)  VALUE    '050254 015862'.
               05  FILLER   PIC X(13)  VALUE    '050257 012500'.
               05  FILLER   PIC X(13)  VALUE    '050261 012500'.
               05  FILLER   PIC X(13)  VALUE    '050262 014349'.
               05  FILLER   PIC X(13)  VALUE    '050272 012603'.
               05  FILLER   PIC X(13)  VALUE    '050276 016900'.
               05  FILLER   PIC X(13)  VALUE    '050278 014349'.
               05  FILLER   PIC X(13)  VALUE    '050279 012603'.
               05  FILLER   PIC X(13)  VALUE    '050280 013950'.
               05  FILLER   PIC X(13)  VALUE    '050281 012827'.
               05  FILLER   PIC X(13)  VALUE    '050283 016923'.
               05  FILLER   PIC X(13)  VALUE    '050289 017301'.
               05  FILLER   PIC X(13)  VALUE    '050290 014349'.
               05  FILLER   PIC X(13)  VALUE    '050291 016738'.
               05  FILLER   PIC X(13)  VALUE    '050292 012500'.
               05  FILLER   PIC X(13)  VALUE    '050295 012500'.
               05  FILLER   PIC X(13)  VALUE    '050296 017827'.
               05  FILLER   PIC X(13)  VALUE    '050298 012603'.
               05  FILLER   PIC X(13)  VALUE    '050300 012603'.
               05  FILLER   PIC X(13)  VALUE    '050301 012500'.
               05  FILLER   PIC X(13)  VALUE    '050305 016923'.
               05  FILLER   PIC X(13)  VALUE    '050308 019025'.
               05  FILLER   PIC X(13)  VALUE    '050309 015862'.
               05  FILLER   PIC X(13)  VALUE    '050313 014493'.
               05  FILLER   PIC X(13)  VALUE    '050315 012500'.
               05  FILLER   PIC X(13)  VALUE    '050320 016923'.
               05  FILLER   PIC X(13)  VALUE    '050324 012500'.
               05  FILLER   PIC X(13)  VALUE    '050327 012603'.
               05  FILLER   PIC X(13)  VALUE    '050329 012500'.
               05  FILLER   PIC X(13)  VALUE    '050334 019025'.
               05  FILLER   PIC X(13)  VALUE    '050335 012500'.
               05  FILLER   PIC X(13)  VALUE    '050336 014493'.
               05  FILLER   PIC X(13)  VALUE    '050342 012500'.
               05  FILLER   PIC X(13)  VALUE    '050348 012603'.
               05  FILLER   PIC X(13)  VALUE    '050350 012827'.
               05  FILLER   PIC X(13)  VALUE    '050351 012827'.
               05  FILLER   PIC X(13)  VALUE    '050352 015862'.
               05  FILLER   PIC X(13)  VALUE    '050353 012827'.
               05  FILLER   PIC X(13)  VALUE    '050357 013666'.
               05  FILLER   PIC X(13)  VALUE    '050359 012500'.
               05  FILLER   PIC X(13)  VALUE    '050360 017538'.
               05  FILLER   PIC X(13)  VALUE    '050367 017030'.
               05  FILLER   PIC X(13)  VALUE    '050373 012827'.
               05  FILLER   PIC X(13)  VALUE    '050376 012827'.
               05  FILLER   PIC X(13)  VALUE    '050378 012827'.
               05  FILLER   PIC X(13)  VALUE    '050380 017827'.
               05  FILLER   PIC X(13)  VALUE    '050382 012827'.
               05  FILLER   PIC X(13)  VALUE    '050390 012500'.
               05  FILLER   PIC X(13)  VALUE    '050393 012827'.
               05  FILLER   PIC X(13)  VALUE    '050394 014349'.
               05  FILLER   PIC X(13)  VALUE    '050396 013666'.
               05  FILLER   PIC X(13)  VALUE    '050397 012500'.
               05  FILLER   PIC X(13)  VALUE    '050407 017282'.
               05  FILLER   PIC X(13)  VALUE    '050411 012827'.
               05  FILLER   PIC X(13)  VALUE    '050414 015862'.
               05  FILLER   PIC X(13)  VALUE    '050417 012500'.
               05  FILLER   PIC X(13)  VALUE    '050423 012500'.
               05  FILLER   PIC X(13)  VALUE    '050424 012500'.
               05  FILLER   PIC X(13)  VALUE    '050425 015862'.
               05  FILLER   PIC X(13)  VALUE    '050426 012603'.
               05  FILLER   PIC X(13)  VALUE    '050434 012500'.
               05  FILLER   PIC X(13)  VALUE    '050435 012500'.
               05  FILLER   PIC X(13)  VALUE    '050438 014349'.
               05  FILLER   PIC X(13)  VALUE    '050441 017827'.
               05  FILLER   PIC X(13)  VALUE    '050444 013285'.
               05  FILLER   PIC X(13)  VALUE    '050454 017282'.
               05  FILLER   PIC X(13)  VALUE    '050455 012500'.
               05  FILLER   PIC X(13)  VALUE    '050457 017282'.
               05  FILLER   PIC X(13)  VALUE    '050464 012891'.
               05  FILLER   PIC X(13)  VALUE    '050468 012827'.
               05  FILLER   PIC X(13)  VALUE    '050471 012827'.
               05  FILLER   PIC X(13)  VALUE    '050481 014349'.
               05  FILLER   PIC X(13)  VALUE    '050485 012827'.
               05  FILLER   PIC X(13)  VALUE    '050488 016923'.
               05  FILLER   PIC X(13)  VALUE    '050492 012500'.
               05  FILLER   PIC X(13)  VALUE    '050496 016900'.
               05  FILLER   PIC X(13)  VALUE    '050498 015862'.
               05  FILLER   PIC X(13)  VALUE    '050502 012827'.
               05  FILLER   PIC X(13)  VALUE    '050503 012500'.
               05  FILLER   PIC X(13)  VALUE    '050506 013555'.
               05  FILLER   PIC X(13)  VALUE    '050510 017538'.
               05  FILLER   PIC X(13)  VALUE    '050512 016923'.
               05  FILLER   PIC X(13)  VALUE    '050515 012500'.
               05  FILLER   PIC X(13)  VALUE    '050516 015862'.
               05  FILLER   PIC X(13)  VALUE    '050517 012603'.
               05  FILLER   PIC X(13)  VALUE    '050523 016900'.
               05  FILLER   PIC X(13)  VALUE    '050526 012603'.
               05  FILLER   PIC X(13)  VALUE    '050528 012500'.
               05  FILLER   PIC X(13)  VALUE    '050534 012500'.
               05  FILLER   PIC X(13)  VALUE    '050537 015862'.
               05  FILLER   PIC X(13)  VALUE    '050541 017301'.
               05  FILLER   PIC X(13)  VALUE    '050543 012603'.
               05  FILLER   PIC X(13)  VALUE    '050546 012500'.
               05  FILLER   PIC X(13)  VALUE    '050547 016738'.
               05  FILLER   PIC X(13)  VALUE    '050548 012603'.
               05  FILLER   PIC X(13)  VALUE    '050549 014349'.
               05  FILLER   PIC X(13)  VALUE    '050551 012603'.
               05  FILLER   PIC X(13)  VALUE    '050552 012827'.
               05  FILLER   PIC X(13)  VALUE    '050557 012891'.
               05  FILLER   PIC X(13)  VALUE    '050561 012827'.
               05  FILLER   PIC X(13)  VALUE    '050567 012603'.
               05  FILLER   PIC X(13)  VALUE    '050568 012500'.
               05  FILLER   PIC X(13)  VALUE    '050570 012603'.
               05  FILLER   PIC X(13)  VALUE    '050573 012500'.
               05  FILLER   PIC X(13)  VALUE    '050575 012827'.
               05  FILLER   PIC X(13)  VALUE    '050580 012603'.
               05  FILLER   PIC X(13)  VALUE    '050581 012827'.
               05  FILLER   PIC X(13)  VALUE    '050586 012603'.
               05  FILLER   PIC X(13)  VALUE    '050588 012827'.
               05  FILLER   PIC X(13)  VALUE    '050589 012603'.
               05  FILLER   PIC X(13)  VALUE    '050590 015862'.
               05  FILLER   PIC X(13)  VALUE    '050597 012827'.
               05  FILLER   PIC X(13)  VALUE    '050599 015862'.
               05  FILLER   PIC X(13)  VALUE    '050603 012603'.
               05  FILLER   PIC X(13)  VALUE    '050604 017827'.
               05  FILLER   PIC X(13)  VALUE    '050608 012500'.
               05  FILLER   PIC X(13)  VALUE    '050609 012603'.
               05  FILLER   PIC X(13)  VALUE    '050616 014349'.
               05  FILLER   PIC X(13)  VALUE    '050624 012827'.
               05  FILLER   PIC X(13)  VALUE    '050625 014349'.
               05  FILLER   PIC X(13)  VALUE    '050630 012500'.
               05  FILLER   PIC X(13)  VALUE    '050633 012805'.
               05  FILLER   PIC X(13)  VALUE    '050636 012500'.
               05  FILLER   PIC X(13)  VALUE    '050641 012827'.
               05  FILLER   PIC X(13)  VALUE    '050663 012827'.
               05  FILLER   PIC X(13)  VALUE    '050668 017282'.
               05  FILLER   PIC X(13)  VALUE    '050674 015862'.
               05  FILLER   PIC X(13)  VALUE    '050677 014349'.
               05  FILLER   PIC X(13)  VALUE    '050678 012603'.
               05  FILLER   PIC X(13)  VALUE    '050684 012500'.
               05  FILLER   PIC X(13)  VALUE    '050686 012500'.
               05  FILLER   PIC X(13)  VALUE    '050688 017827'.
               05  FILLER   PIC X(13)  VALUE    '050689 016900'.
               05  FILLER   PIC X(13)  VALUE    '050690 016738'.
               05  FILLER   PIC X(13)  VALUE    '050696 014349'.
               05  FILLER   PIC X(13)  VALUE    '050697 013950'.
               05  FILLER   PIC X(13)  VALUE    '050701 012500'.
               05  FILLER   PIC X(13)  VALUE    '050704 012827'.
               05  FILLER   PIC X(13)  VALUE    '050708 012500'.
               05  FILLER   PIC X(13)  VALUE    '050709 012603'.
               05  FILLER   PIC X(13)  VALUE    '050710 012500'.
               05  FILLER   PIC X(13)  VALUE    '050714 019025'.
               05  FILLER   PIC X(13)  VALUE    '050717 012827'.
               05  FILLER   PIC X(13)  VALUE    '050723 012827'.
               05  FILLER   PIC X(13)  VALUE    '050724 012500'.
               05  FILLER   PIC X(13)  VALUE    '050726 012891'.
               05  FILLER   PIC X(13)  VALUE    '050727 012827'.
               05  FILLER   PIC X(13)  VALUE    '050732 012500'.
               05  FILLER   PIC X(13)  VALUE    '050735 012827'.
               05  FILLER   PIC X(13)  VALUE    '050736 012827'.
               05  FILLER   PIC X(13)  VALUE    '050737 012827'.
               05  FILLER   PIC X(13)  VALUE    '050738 012827'.
               05  FILLER   PIC X(13)  VALUE    '050739 012827'.
               05  FILLER   PIC X(13)  VALUE    '050740 012827'.
               05  FILLER   PIC X(13)  VALUE    '050742 012827'.
               05  FILLER   PIC X(13)  VALUE    '050744 012603'.
               05  FILLER   PIC X(13)  VALUE    '050745 012603'.
               05  FILLER   PIC X(13)  VALUE    '050746 012603'.
               05  FILLER   PIC X(13)  VALUE    '050747 012603'.
               05  FILLER   PIC X(13)  VALUE    '050748 014493'.
               05  FILLER   PIC X(13)  VALUE    '050751 012827'.
               05  FILLER   PIC X(13)  VALUE    '050754 017301'.
               05  FILLER   PIC X(13)  VALUE    '050755 012827'.
               05  FILLER   PIC X(13)  VALUE    '050757 012500'.
               05  FILLER   PIC X(13)  VALUE    '050758 012603'.
               05  FILLER   PIC X(13)  VALUE    '050760 016900'.
               05  FILLER   PIC X(13)  VALUE    '050761 012827'.
               05  FILLER   PIC X(13)  VALUE    '050763 012827'.
               05  FILLER   PIC X(13)  VALUE    '050764 013950'.
               05  FILLER   PIC X(13)  VALUE    '050765 012500'.
               05  FILLER   PIC X(13)  VALUE    '050766 012500'.
               05  FILLER   PIC X(13)  VALUE    '050767 017030'.
               05  FILLER   PIC X(13)  VALUE    '050769 012603'.
               05  FILLER   PIC X(13)  VALUE    '050770 012500'.
               05  FILLER   PIC X(13)  VALUE    '050771 012827'.
               05  FILLER   PIC X(13)  VALUE    '050772 015862'.
               05  FILLER   PIC X(13)  VALUE    '050773 016923'.
               05  FILLER   PIC X(13)  VALUE    '050775 012500'.
               05  FILLER   PIC X(13)  VALUE    '050776 012827'.
               05  FILLER   PIC X(13)  VALUE    '050777 016923'.
               05  FILLER   PIC X(13)  VALUE    '050778 012603'.
               05  FILLER   PIC X(13)  VALUE    '050779 012827'.
               05  FILLER   PIC X(13)  VALUE    '050780 012603'.
               05  FILLER   PIC X(13)  VALUE    '050781 016280'.
               05  FILLER   PIC X(13)  VALUE    '050782 012827'.
               05  FILLER   PIC X(13)  VALUE    '050783 012500'.
               05  FILLER   PIC X(13)  VALUE    '060001 010050'.
               05  FILLER   PIC X(13)  VALUE    '060003 010206'.
               05  FILLER   PIC X(13)  VALUE    '060004 010050'.
               05  FILLER   PIC X(13)  VALUE    '060006 009937'.
               05  FILLER   PIC X(13)  VALUE    '060008 009937'.
               05  FILLER   PIC X(13)  VALUE    '060009 010050'.
               05  FILLER   PIC X(13)  VALUE    '060010 009937'.
               05  FILLER   PIC X(13)  VALUE    '060011 010050'.
               05  FILLER   PIC X(13)  VALUE    '060012 009937'.
               05  FILLER   PIC X(13)  VALUE    '060013 009937'.
               05  FILLER   PIC X(13)  VALUE    '060014 010050'.
               05  FILLER   PIC X(13)  VALUE    '060015 010050'.
               05  FILLER   PIC X(13)  VALUE    '060020 009937'.
               05  FILLER   PIC X(13)  VALUE    '060022 009937'.
               05  FILLER   PIC X(13)  VALUE    '060023 009937'.
               05  FILLER   PIC X(13)  VALUE    '060024 010050'.
               05  FILLER   PIC X(13)  VALUE    '060027 010206'.
               05  FILLER   PIC X(13)  VALUE    '060028 010050'.
               05  FILLER   PIC X(13)  VALUE    '060030 009937'.
               05  FILLER   PIC X(13)  VALUE    '060031 010050'.
               05  FILLER   PIC X(13)  VALUE    '060032 010050'.
               05  FILLER   PIC X(13)  VALUE    '060034 010050'.
               05  FILLER   PIC X(13)  VALUE    '060044 009937'.
               05  FILLER   PIC X(13)  VALUE    '060049 009937'.
               05  FILLER   PIC X(13)  VALUE    '060054 009937'.
               05  FILLER   PIC X(13)  VALUE    '060064 010050'.
               05  FILLER   PIC X(13)  VALUE    '060065 010050'.
               05  FILLER   PIC X(13)  VALUE    '060071 009937'.
               05  FILLER   PIC X(13)  VALUE    '060075 009937'.
               05  FILLER   PIC X(13)  VALUE    '060076 009937'.
               05  FILLER   PIC X(13)  VALUE    '060096 010050'.
               05  FILLER   PIC X(13)  VALUE    '060100 010050'.
               05  FILLER   PIC X(13)  VALUE    '060103 010050'.
               05  FILLER   PIC X(13)  VALUE    '060104 010050'.
               05  FILLER   PIC X(13)  VALUE    '060107 010050'.
               05  FILLER   PIC X(13)  VALUE    '060112 010050'.
               05  FILLER   PIC X(13)  VALUE    '060113 010050'.
               05  FILLER   PIC X(13)  VALUE    '060114 010050'.
               05  FILLER   PIC X(13)  VALUE    '060116 010206'.
               05  FILLER   PIC X(13)  VALUE    '060117 009937'.
               05  FILLER   PIC X(13)  VALUE    '060118 010050'.
               05  FILLER   PIC X(13)  VALUE    '060119 009937'.
               05  FILLER   PIC X(13)  VALUE    '060124 010050'.
               05  FILLER   PIC X(13)  VALUE    '060125 010050'.
               05  FILLER   PIC X(13)  VALUE    '060126 009937'.
               05  FILLER   PIC X(13)  VALUE    '060127 010050'.
               05  FILLER   PIC X(13)  VALUE    '060128 010174'.
               05  FILLER   PIC X(13)  VALUE    '060129 010050'.
               05  FILLER   PIC X(13)  VALUE    '060130 009937'.
               05  FILLER   PIC X(13)  VALUE    '07B022 012599'.
               05  FILLER   PIC X(13)  VALUE    '07B033 012660'.
               05  FILLER   PIC X(13)  VALUE    '070002 012575'.
               05  FILLER   PIC X(13)  VALUE    '070003 012575'.
               05  FILLER   PIC X(13)  VALUE    '070004 012592'.
               05  FILLER   PIC X(13)  VALUE    '070005 013348'.
               05  FILLER   PIC X(13)  VALUE    '070006 012684'.
               05  FILLER   PIC X(13)  VALUE    '070007 013348'.
               05  FILLER   PIC X(13)  VALUE    '070008 012575'.
               05  FILLER   PIC X(13)  VALUE    '070010 012684'.
               05  FILLER   PIC X(13)  VALUE    '070011 012592'.
               05  FILLER   PIC X(13)  VALUE    '070012 012575'.
               05  FILLER   PIC X(13)  VALUE    '070015 012660'.
               05  FILLER   PIC X(13)  VALUE    '070016 013348'.
               05  FILLER   PIC X(13)  VALUE    '070017 013348'.
               05  FILLER   PIC X(13)  VALUE    '070018 012684'.
               05  FILLER   PIC X(13)  VALUE    '070019 013348'.
               05  FILLER   PIC X(13)  VALUE    '070020 012575'.
               05  FILLER   PIC X(13)  VALUE    '070021 012575'.
               05  FILLER   PIC X(13)  VALUE    '070022 013348'.
               05  FILLER   PIC X(13)  VALUE    '070024 013348'.
               05  FILLER   PIC X(13)  VALUE    '070025 012575'.
               05  FILLER   PIC X(13)  VALUE    '070027 012575'.
               05  FILLER   PIC X(13)  VALUE    '070028 012684'.
               05  FILLER   PIC X(13)  VALUE    '070029 012575'.
               05  FILLER   PIC X(13)  VALUE    '070031 013348'.
               05  FILLER   PIC X(13)  VALUE    '070033 012684'.
               05  FILLER   PIC X(13)  VALUE    '070034 012684'.
               05  FILLER   PIC X(13)  VALUE    '070035 012575'.
               05  FILLER   PIC X(13)  VALUE    '070036 012575'.
               05  FILLER   PIC X(13)  VALUE    '070038 013348'.
               05  FILLER   PIC X(13)  VALUE    '070039 013348'.
               05  FILLER   PIC X(13)  VALUE    '070040 012575'.
               05  FILLER   PIC X(13)  VALUE    '080001 011303'.
               05  FILLER   PIC X(13)  VALUE    '080003 011303'.
               05  FILLER   PIC X(13)  VALUE    '080004 011111'.
               05  FILLER   PIC X(13)  VALUE    '080006 009911'.
               05  FILLER   PIC X(13)  VALUE    '080007 010590'.
               05  FILLER   PIC X(13)  VALUE    '080009 009911'.
               05  FILLER   PIC X(13)  VALUE    '090001 009998'.
               05  FILLER   PIC X(13)  VALUE    '090003 009998'.
               05  FILLER   PIC X(13)  VALUE    '090004 009998'.
               05  FILLER   PIC X(13)  VALUE    '090005 009998'.
               05  FILLER   PIC X(13)  VALUE    '090006 009998'.
               05  FILLER   PIC X(13)  VALUE    '090008 009998'.
               05  FILLER   PIC X(13)  VALUE    '090011 009998'.
               05  FILLER   PIC X(13)  VALUE    '10B029 009565'.
               05  FILLER   PIC X(13)  VALUE    '10B167 009198'.
               05  FILLER   PIC X(13)  VALUE    '100001 009044'.
               05  FILLER   PIC X(13)  VALUE    '100002 009431'.
               05  FILLER   PIC X(13)  VALUE    '100006 008942'.
               05  FILLER   PIC X(13)  VALUE    '100007 008942'.
               05  FILLER   PIC X(13)  VALUE    '100008 009198'.
               05  FILLER   PIC X(13)  VALUE    '100009 009198'.
               05  FILLER   PIC X(13)  VALUE    '100012 009341'.
               05  FILLER   PIC X(13)  VALUE    '100014 008734'.
               05  FILLER   PIC X(13)  VALUE    '100017 008734'.
               05  FILLER   PIC X(13)  VALUE    '100018 009064'.
               05  FILLER   PIC X(13)  VALUE    '100019 009151'.
               05  FILLER   PIC X(13)  VALUE    '100022 009431'.
               05  FILLER   PIC X(13)  VALUE    '100023 008469'.
               05  FILLER   PIC X(13)  VALUE    '100025 008169'.
               05  FILLER   PIC X(13)  VALUE    '100026 008128'.
               05  FILLER   PIC X(13)  VALUE    '100028 009151'.
               05  FILLER   PIC X(13)  VALUE    '100029 009198'.
               05  FILLER   PIC X(13)  VALUE    '100030 008942'.
               05  FILLER   PIC X(13)  VALUE    '100032 008896'.
               05  FILLER   PIC X(13)  VALUE    '100034 009198'.
               05  FILLER   PIC X(13)  VALUE    '100035 009550'.
               05  FILLER   PIC X(13)  VALUE    '100038 009565'.
               05  FILLER   PIC X(13)  VALUE    '100039 009565'.
               05  FILLER   PIC X(13)  VALUE    '100040 009044'.
               05  FILLER   PIC X(13)  VALUE    '100043 008896'.
               05  FILLER   PIC X(13)  VALUE    '100044 008968'.
               05  FILLER   PIC X(13)  VALUE    '100045 008734'.
               05  FILLER   PIC X(13)  VALUE    '100046 008896'.
               05  FILLER   PIC X(13)  VALUE    '100047 008968'.
               05  FILLER   PIC X(13)  VALUE    '100048 008128'.
               05  FILLER   PIC X(13)  VALUE    '100049 008128'.
               05  FILLER   PIC X(13)  VALUE    '100050 009198'.
               05  FILLER   PIC X(13)  VALUE    '100051 008942'.
               05  FILLER   PIC X(13)  VALUE    '100052 008787'.
               05  FILLER   PIC X(13)  VALUE    '100053 009198'.
               05  FILLER   PIC X(13)  VALUE    '100054 008539'.
               05  FILLER   PIC X(13)  VALUE    '100055 008896'.
               05  FILLER   PIC X(13)  VALUE    '100057 008942'.
               05  FILLER   PIC X(13)  VALUE    '100062 008943'.
               05  FILLER   PIC X(13)  VALUE    '100063 008896'.
               05  FILLER   PIC X(13)  VALUE    '100067 008896'.
               05  FILLER   PIC X(13)  VALUE    '100068 008734'.
               05  FILLER   PIC X(13)  VALUE    '100069 008896'.
               05  FILLER   PIC X(13)  VALUE    '100070 009550'.
               05  FILLER   PIC X(13)  VALUE    '100071 008896'.
               05  FILLER   PIC X(13)  VALUE    '100072 008734'.
               05  FILLER   PIC X(13)  VALUE    '100073 009565'.
               05  FILLER   PIC X(13)  VALUE    '100075 008896'.
               05  FILLER   PIC X(13)  VALUE    '100076 009198'.
               05  FILLER   PIC X(13)  VALUE    '100077 008968'.
               05  FILLER   PIC X(13)  VALUE    '100080 009431'.
               05  FILLER   PIC X(13)  VALUE    '100081 008539'.
               05  FILLER   PIC X(13)  VALUE    '100084 008942'.
               05  FILLER   PIC X(13)  VALUE    '100086 009565'.
               05  FILLER   PIC X(13)  VALUE    '100087 009550'.
               05  FILLER   PIC X(13)  VALUE    '100088 009044'.
               05  FILLER   PIC X(13)  VALUE    '100090 008128'.
               05  FILLER   PIC X(13)  VALUE    '100092 009151'.
               05  FILLER   PIC X(13)  VALUE    '100093 008169'.
               05  FILLER   PIC X(13)  VALUE    '100099 008233'.
               05  FILLER   PIC X(13)  VALUE    '100102 008371'.
               05  FILLER   PIC X(13)  VALUE    '100105 008968'.
               05  FILLER   PIC X(13)  VALUE    '100106 008128'.
               05  FILLER   PIC X(13)  VALUE    '100107 009341'.
               05  FILLER   PIC X(13)  VALUE    '100109 008128'.
               05  FILLER   PIC X(13)  VALUE    '100110 008942'.
               05  FILLER   PIC X(13)  VALUE    '100113 009180'.
               05  FILLER   PIC X(13)  VALUE    '100117 009044'.
               05  FILLER   PIC X(13)  VALUE    '100118 008128'.
               05  FILLER   PIC X(13)  VALUE    '100121 008233'.
               05  FILLER   PIC X(13)  VALUE    '100122 008539'.
               05  FILLER   PIC X(13)  VALUE    '100124 008169'.
               05  FILLER   PIC X(13)  VALUE    '100125 009198'.
               05  FILLER   PIC X(13)  VALUE    '100126 008896'.
               05  FILLER   PIC X(13)  VALUE    '100127 008896'.
               05  FILLER   PIC X(13)  VALUE    '100128 008896'.
               05  FILLER   PIC X(13)  VALUE    '100130 009431'.
               05  FILLER   PIC X(13)  VALUE    '100131 009198'.
               05  FILLER   PIC X(13)  VALUE    '100132 008896'.
               05  FILLER   PIC X(13)  VALUE    '100134 008128'.
               05  FILLER   PIC X(13)  VALUE    '100135 008437'.
               05  FILLER   PIC X(13)  VALUE    '100137 008787'.
               05  FILLER   PIC X(13)  VALUE    '100140 009044'.
               05  FILLER   PIC X(13)  VALUE    '100142 008128'.
               05  FILLER   PIC X(13)  VALUE    '100150 009198'.
               05  FILLER   PIC X(13)  VALUE    '100151 009044'.
               05  FILLER   PIC X(13)  VALUE    '100154 009198'.
               05  FILLER   PIC X(13)  VALUE    '100156 008371'.
               05  FILLER   PIC X(13)  VALUE    '100157 008968'.
               05  FILLER   PIC X(13)  VALUE    '100161 008942'.
               05  FILLER   PIC X(13)  VALUE    '100166 009550'.
               05  FILLER   PIC X(13)  VALUE    '100167 009565'.
               05  FILLER   PIC X(13)  VALUE    '100168 009431'.
               05  FILLER   PIC X(13)  VALUE    '100173 008896'.
               05  FILLER   PIC X(13)  VALUE    '100175 008128'.
               05  FILLER   PIC X(13)  VALUE    '100176 009431'.
               05  FILLER   PIC X(13)  VALUE    '100177 009151'.
               05  FILLER   PIC X(13)  VALUE    '100179 009044'.
               05  FILLER   PIC X(13)  VALUE    '100180 008896'.
               05  FILLER   PIC X(13)  VALUE    '100181 009198'.
               05  FILLER   PIC X(13)  VALUE    '100183 009198'.
               05  FILLER   PIC X(13)  VALUE    '100187 009198'.
               05  FILLER   PIC X(13)  VALUE    '100189 009565'.
               05  FILLER   PIC X(13)  VALUE    '100191 008896'.
               05  FILLER   PIC X(13)  VALUE    '100200 009565'.
               05  FILLER   PIC X(13)  VALUE    '100204 009180'.
               05  FILLER   PIC X(13)  VALUE    '100206 008896'.
               05  FILLER   PIC X(13)  VALUE    '100209 009198'.
               05  FILLER   PIC X(13)  VALUE    '100211 008896'.
               05  FILLER   PIC X(13)  VALUE    '100212 008943'.
               05  FILLER   PIC X(13)  VALUE    '100213 009550'.
               05  FILLER   PIC X(13)  VALUE    '100217 008968'.
               05  FILLER   PIC X(13)  VALUE    '100220 009341'.
               05  FILLER   PIC X(13)  VALUE    '100223 008539'.
               05  FILLER   PIC X(13)  VALUE    '100224 009565'.
               05  FILLER   PIC X(13)  VALUE    '100226 009044'.
               05  FILLER   PIC X(13)  VALUE    '100228 009565'.
               05  FILLER   PIC X(13)  VALUE    '100230 009565'.
               05  FILLER   PIC X(13)  VALUE    '100231 008169'.
               05  FILLER   PIC X(13)  VALUE    '100232 008943'.
               05  FILLER   PIC X(13)  VALUE    '100234 009431'.
               05  FILLER   PIC X(13)  VALUE    '100236 008968'.
               05  FILLER   PIC X(13)  VALUE    '100238 008896'.
               05  FILLER   PIC X(13)  VALUE    '100239 008896'.
               05  FILLER   PIC X(13)  VALUE    '100240 009198'.
               05  FILLER   PIC X(13)  VALUE    '100242 008128'.
               05  FILLER   PIC X(13)  VALUE    '100243 008896'.
               05  FILLER   PIC X(13)  VALUE    '100244 009341'.
               05  FILLER   PIC X(13)  VALUE    '100246 008968'.
               05  FILLER   PIC X(13)  VALUE    '100248 008896'.
               05  FILLER   PIC X(13)  VALUE    '100249 008787'.
               05  FILLER   PIC X(13)  VALUE    '100252 008968'.
               05  FILLER   PIC X(13)  VALUE    '100253 009431'.
               05  FILLER   PIC X(13)  VALUE    '100254 008437'.
               05  FILLER   PIC X(13)  VALUE    '100255 008896'.
               05  FILLER   PIC X(13)  VALUE    '100256 008896'.
               05  FILLER   PIC X(13)  VALUE    '100258 009431'.
               05  FILLER   PIC X(13)  VALUE    '100259 008896'.
               05  FILLER   PIC X(13)  VALUE    '100260 008968'.
               05  FILLER   PIC X(13)  VALUE    '100264 008896'.
               05  FILLER   PIC X(13)  VALUE    '100265 008896'.
               05  FILLER   PIC X(13)  VALUE    '100266 008169'.
               05  FILLER   PIC X(13)  VALUE    '100267 009550'.
               05  FILLER   PIC X(13)  VALUE    '100268 009431'.
               05  FILLER   PIC X(13)  VALUE    '100269 009431'.
               05  FILLER   PIC X(13)  VALUE    '100275 009431'.
               05  FILLER   PIC X(13)  VALUE    '100276 009565'.
               05  FILLER   PIC X(13)  VALUE    '100277 009198'.
               05  FILLER   PIC X(13)  VALUE    '100281 009565'.
               05  FILLER   PIC X(13)  VALUE    '100284 009198'.
               05  FILLER   PIC X(13)  VALUE    '100285 009565'.
               05  FILLER   PIC X(13)  VALUE    '100286 009064'.
               05  FILLER   PIC X(13)  VALUE    '100287 009431'.
               05  FILLER   PIC X(13)  VALUE    '100288 009431'.
               05  FILLER   PIC X(13)  VALUE    '100289 009565'.
               05  FILLER   PIC X(13)  VALUE    '100290 008734'.
               05  FILLER   PIC X(13)  VALUE    '100291 009151'.
               05  FILLER   PIC X(13)  VALUE    '100292 008539'.
               05  FILLER   PIC X(13)  VALUE    '100296 009198'.
               05  FILLER   PIC X(13)  VALUE    '100299 009550'.
               05  FILLER   PIC X(13)  VALUE    '100302 008942'.
               05  FILLER   PIC X(13)  VALUE    '100307 009044'.
               05  FILLER   PIC X(13)  VALUE    '100313 008128'.
               05  FILLER   PIC X(13)  VALUE    '100314 009198'.
               05  FILLER   PIC X(13)  VALUE    '100315 009151'.
               05  FILLER   PIC X(13)  VALUE    '100316 009151'.
               05  FILLER   PIC X(13)  VALUE    '100319 008896'.
               05  FILLER   PIC X(13)  VALUE    '100320 008942'.
               05  FILLER   PIC X(13)  VALUE    '100321 009044'.
               05  FILLER   PIC X(13)  VALUE    '100322 008943'.
               05  FILLER   PIC X(13)  VALUE    '100324 009341'.
               05  FILLER   PIC X(13)  VALUE    '100325 008128'.
               05  FILLER   PIC X(13)  VALUE    '100326 009198'.
               05  FILLER   PIC X(13)  VALUE    '100327 008446'.
               05  FILLER   PIC X(13)  VALUE    '100329 008942'.
               05  FILLER   PIC X(13)  VALUE    '110001 009208'.
               05  FILLER   PIC X(13)  VALUE    '110002 009208'.
               05  FILLER   PIC X(13)  VALUE    '110003 007994'.
               05  FILLER   PIC X(13)  VALUE    '110004 008519'.
               05  FILLER   PIC X(13)  VALUE    '110005 009350'.
               05  FILLER   PIC X(13)  VALUE    '110006 009208'.
               05  FILLER   PIC X(13)  VALUE    '110007 008521'.
               05  FILLER   PIC X(13)  VALUE    '110008 009350'.
               05  FILLER   PIC X(13)  VALUE    '110010 009350'.
               05  FILLER   PIC X(13)  VALUE    '110011 009350'.
               05  FILLER   PIC X(13)  VALUE    '110015 009350'.
               05  FILLER   PIC X(13)  VALUE    '110016 009208'.
               05  FILLER   PIC X(13)  VALUE    '110018 009350'.
               05  FILLER   PIC X(13)  VALUE    '110023 009208'.
               05  FILLER   PIC X(13)  VALUE    '110024 007920'.
               05  FILLER   PIC X(13)  VALUE    '110025 008311'.
               05  FILLER   PIC X(13)  VALUE    '110026 007313'.
               05  FILLER   PIC X(13)  VALUE    '110027 007490'.
               05  FILLER   PIC X(13)  VALUE    '110028 008690'.
               05  FILLER   PIC X(13)  VALUE    '110029 008744'.
               05  FILLER   PIC X(13)  VALUE    '110030 009350'.
               05  FILLER   PIC X(13)  VALUE    '110031 009350'.
               05  FILLER   PIC X(13)  VALUE    '110032 007313'.
               05  FILLER   PIC X(13)  VALUE    '110034 008690'.
               05  FILLER   PIC X(13)  VALUE    '110035 009350'.
               05  FILLER   PIC X(13)  VALUE    '110036 007920'.
               05  FILLER   PIC X(13)  VALUE    '110038 007764'.
               05  FILLER   PIC X(13)  VALUE    '110039 008690'.
               05  FILLER   PIC X(13)  VALUE    '110040 009208'.
               05  FILLER   PIC X(13)  VALUE    '110041 007648'.
               05  FILLER   PIC X(13)  VALUE    '110042 009350'.
               05  FILLER   PIC X(13)  VALUE    '110043 007920'.
               05  FILLER   PIC X(13)  VALUE    '110044 007525'.
               05  FILLER   PIC X(13)  VALUE    '110045 009350'.
               05  FILLER   PIC X(13)  VALUE    '110046 009350'.
               05  FILLER   PIC X(13)  VALUE    '110050 008262'.
               05  FILLER   PIC X(13)  VALUE    '110051 007313'.
               05  FILLER   PIC X(13)  VALUE    '110054 009208'.
               05  FILLER   PIC X(13)  VALUE    '110064 007932'.
               05  FILLER   PIC X(13)  VALUE    '110069 008612'.
               05  FILLER   PIC X(13)  VALUE    '110071 007313'.
               05  FILLER   PIC X(13)  VALUE    '110073 007313'.
               05  FILLER   PIC X(13)  VALUE    '110074 009208'.
               05  FILLER   PIC X(13)  VALUE    '110075 007920'.
               05  FILLER   PIC X(13)  VALUE    '110076 009350'.
               05  FILLER   PIC X(13)  VALUE    '110078 009350'.
               05  FILLER   PIC X(13)  VALUE    '110079 009350'.
               05  FILLER   PIC X(13)  VALUE    '110082 009350'.
               05  FILLER   PIC X(13)  VALUE    '110083 009350'.
               05  FILLER   PIC X(13)  VALUE    '110086 007313'.
               05  FILLER   PIC X(13)  VALUE    '110087 009350'.
               05  FILLER   PIC X(13)  VALUE    '110089 007313'.
               05  FILLER   PIC X(13)  VALUE    '110091 009350'.
               05  FILLER   PIC X(13)  VALUE    '110092 007313'.
               05  FILLER   PIC X(13)  VALUE    '110095 008362'.
               05  FILLER   PIC X(13)  VALUE    '110100 007892'.
               05  FILLER   PIC X(13)  VALUE    '110101 007313'.
               05  FILLER   PIC X(13)  VALUE    '110104 007313'.
               05  FILLER   PIC X(13)  VALUE    '110105 007764'.
               05  FILLER   PIC X(13)  VALUE    '110107 008929'.
               05  FILLER   PIC X(13)  VALUE    '110109 007313'.
               05  FILLER   PIC X(13)  VALUE    '110111 008690'.
               05  FILLER   PIC X(13)  VALUE    '110113 008690'.
               05  FILLER   PIC X(13)  VALUE    '110115 009350'.
               05  FILLER   PIC X(13)  VALUE    '110121 008362'.
               05  FILLER   PIC X(13)  VALUE    '110122 007764'.
               05  FILLER   PIC X(13)  VALUE    '110124 007313'.
               05  FILLER   PIC X(13)  VALUE    '110125 008612'.
               05  FILLER   PIC X(13)  VALUE    '110128 007920'.
               05  FILLER   PIC X(13)  VALUE    '110129 007932'.
               05  FILLER   PIC X(13)  VALUE    '110130 007313'.
               05  FILLER   PIC X(13)  VALUE    '110132 007313'.
               05  FILLER   PIC X(13)  VALUE    '110135 007601'.
               05  FILLER   PIC X(13)  VALUE    '110142 007539'.
               05  FILLER   PIC X(13)  VALUE    '110143 009350'.
               05  FILLER   PIC X(13)  VALUE    '110146 009044'.
               05  FILLER   PIC X(13)  VALUE    '110150 009208'.
               05  FILLER   PIC X(13)  VALUE    '110153 008612'.
               05  FILLER   PIC X(13)  VALUE    '110161 009350'.
               05  FILLER   PIC X(13)  VALUE    '110164 008929'.
               05  FILLER   PIC X(13)  VALUE    '110165 009350'.
               05  FILLER   PIC X(13)  VALUE    '110168 009208'.
               05  FILLER   PIC X(13)  VALUE    '110177 008690'.
               05  FILLER   PIC X(13)  VALUE    '110183 009350'.
               05  FILLER   PIC X(13)  VALUE    '110184 009350'.
               05  FILLER   PIC X(13)  VALUE    '110186 007932'.
               05  FILLER   PIC X(13)  VALUE    '110187 009208'.
               05  FILLER   PIC X(13)  VALUE    '110189 009208'.
               05  FILLER   PIC X(13)  VALUE    '110190 007313'.
               05  FILLER   PIC X(13)  VALUE    '110191 009350'.
               05  FILLER   PIC X(13)  VALUE    '110192 009350'.
               05  FILLER   PIC X(13)  VALUE    '110194 007313'.
               05  FILLER   PIC X(13)  VALUE    '110198 009350'.
               05  FILLER   PIC X(13)  VALUE    '110200 007932'.
               05  FILLER   PIC X(13)  VALUE    '110201 008929'.
               05  FILLER   PIC X(13)  VALUE    '110205 007550'.
               05  FILLER   PIC X(13)  VALUE    '110209 007313'.
               05  FILLER   PIC X(13)  VALUE    '110215 009350'.
               05  FILLER   PIC X(13)  VALUE    '110225 009350'.
               05  FILLER   PIC X(13)  VALUE    '110226 009350'.
               05  FILLER   PIC X(13)  VALUE    '110229 009350'.
               05  FILLER   PIC X(13)  VALUE    '110230 009350'.
               05  FILLER   PIC X(13)  VALUE    '110233 009350'.
               05  FILLER   PIC X(13)  VALUE    '110234 007313'.
               05  FILLER   PIC X(13)  VALUE    '110235 007920'.
               05  FILLER   PIC X(13)  VALUE    '110236 008519'.
               05  FILLER   PIC X(13)  VALUE    '120001 012595'.
               05  FILLER   PIC X(13)  VALUE    '120002 012595'.
               05  FILLER   PIC X(13)  VALUE    '120004 012595'.
               05  FILLER   PIC X(13)  VALUE    '120005 012595'.
               05  FILLER   PIC X(13)  VALUE    '120006 012595'.
               05  FILLER   PIC X(13)  VALUE    '120007 012595'.
               05  FILLER   PIC X(13)  VALUE    '120011 012595'.
               05  FILLER   PIC X(13)  VALUE    '120014 012595'.
               05  FILLER   PIC X(13)  VALUE    '120019 012595'.
               05  FILLER   PIC X(13)  VALUE    '120022 012595'.
               05  FILLER   PIC X(13)  VALUE    '120026 012595'.
               05  FILLER   PIC X(13)  VALUE    '120028 012595'.
               05  FILLER   PIC X(13)  VALUE    '130002 008820'.
               05  FILLER   PIC X(13)  VALUE    '130003 010292'.
               05  FILLER   PIC X(13)  VALUE    '130006 009657'.
               05  FILLER   PIC X(13)  VALUE    '130007 009657'.
               05  FILLER   PIC X(13)  VALUE    '130013 010634'.
               05  FILLER   PIC X(13)  VALUE    '130014 009657'.
               05  FILLER   PIC X(13)  VALUE    '130018 008791'.
               05  FILLER   PIC X(13)  VALUE    '130025 008019'.
               05  FILLER   PIC X(13)  VALUE    '130028 008791'.
               05  FILLER   PIC X(13)  VALUE    '130049 009726'.
               05  FILLER   PIC X(13)  VALUE    '130063 009657'.
               05  FILLER   PIC X(13)  VALUE    '130065 008713'.
               05  FILLER   PIC X(13)  VALUE    '130066 009726'.
               05  FILLER   PIC X(13)  VALUE    '130067 007812'.
               05  FILLER   PIC X(13)  VALUE    '130071 009657'.
               05  FILLER   PIC X(13)  VALUE    '130072 009657'.
               05  FILLER   PIC X(13)  VALUE    '14B010 010427'.
               05  FILLER   PIC X(13)  VALUE    '140001 008636'.
               05  FILLER   PIC X(13)  VALUE    '140002 009107'.
               05  FILLER   PIC X(13)  VALUE    '140007 010413'.
               05  FILLER   PIC X(13)  VALUE    '140008 010427'.
               05  FILLER   PIC X(13)  VALUE    '140010 010427'.
               05  FILLER   PIC X(13)  VALUE    '140011 008486'.
               05  FILLER   PIC X(13)  VALUE    '140012 010425'.
               05  FILLER   PIC X(13)  VALUE    '140013 009037'.
               05  FILLER   PIC X(13)  VALUE    '140015 009107'.
               05  FILLER   PIC X(13)  VALUE    '140018 010427'.
               05  FILLER   PIC X(13)  VALUE    '140019 008486'.
               05  FILLER   PIC X(13)  VALUE    '140026 008819'.
               05  FILLER   PIC X(13)  VALUE    '140029 010604'.
               05  FILLER   PIC X(13)  VALUE    '140030 010604'.
               05  FILLER   PIC X(13)  VALUE    '140032 009107'.
               05  FILLER   PIC X(13)  VALUE    '140033 010427'.
               05  FILLER   PIC X(13)  VALUE    '140034 009107'.
               05  FILLER   PIC X(13)  VALUE    '140040 009194'.
               05  FILLER   PIC X(13)  VALUE    '140043 009194'.
               05  FILLER   PIC X(13)  VALUE    '140046 009107'.
               05  FILLER   PIC X(13)  VALUE    '140048 010427'.
               05  FILLER   PIC X(13)  VALUE    '140049 010427'.
               05  FILLER   PIC X(13)  VALUE    '140052 009107'.
               05  FILLER   PIC X(13)  VALUE    '140053 009016'.
               05  FILLER   PIC X(13)  VALUE    '140054 010427'.
               05  FILLER   PIC X(13)  VALUE    '140058 009107'.
               05  FILLER   PIC X(13)  VALUE    '140059 008486'.
               05  FILLER   PIC X(13)  VALUE    '140062 010427'.
               05  FILLER   PIC X(13)  VALUE    '140063 010427'.
               05  FILLER   PIC X(13)  VALUE    '140064 009194'.
               05  FILLER   PIC X(13)  VALUE    '140065 010427'.
               05  FILLER   PIC X(13)  VALUE    '140067 009292'.
               05  FILLER   PIC X(13)  VALUE    '140068 010427'.
               05  FILLER   PIC X(13)  VALUE    '140077 009107'.
               05  FILLER   PIC X(13)  VALUE    '140080 010427'.
               05  FILLER   PIC X(13)  VALUE    '140082 010427'.
               05  FILLER   PIC X(13)  VALUE    '140083 010427'.
               05  FILLER   PIC X(13)  VALUE    '140084 010427'.
               05  FILLER   PIC X(13)  VALUE    '140088 010427'.
               05  FILLER   PIC X(13)  VALUE    '140089 008486'.
               05  FILLER   PIC X(13)  VALUE    '140091 008708'.
               05  FILLER   PIC X(13)  VALUE    '140093 009431'.
               05  FILLER   PIC X(13)  VALUE    '140095 010427'.
               05  FILLER   PIC X(13)  VALUE    '140100 010427'.
               05  FILLER   PIC X(13)  VALUE    '140101 010413'.
               05  FILLER   PIC X(13)  VALUE    '140103 010427'.
               05  FILLER   PIC X(13)  VALUE    '140110 010263'.
               05  FILLER   PIC X(13)  VALUE    '140113 008708'.
               05  FILLER   PIC X(13)  VALUE    '140114 010427'.
               05  FILLER   PIC X(13)  VALUE    '140115 010427'.
               05  FILLER   PIC X(13)  VALUE    '140116 010427'.
               05  FILLER   PIC X(13)  VALUE    '140117 010427'.
               05  FILLER   PIC X(13)  VALUE    '140118 010427'.
               05  FILLER   PIC X(13)  VALUE    '140119 010427'.
               05  FILLER   PIC X(13)  VALUE    '140120 009037'.
               05  FILLER   PIC X(13)  VALUE    '140122 010413'.
               05  FILLER   PIC X(13)  VALUE    '140124 010427'.
               05  FILLER   PIC X(13)  VALUE    '140125 009107'.
               05  FILLER   PIC X(13)  VALUE    '140127 009292'.
               05  FILLER   PIC X(13)  VALUE    '140130 010427'.
               05  FILLER   PIC X(13)  VALUE    '140133 010427'.
               05  FILLER   PIC X(13)  VALUE    '140135 009016'.
               05  FILLER   PIC X(13)  VALUE    '140137 009107'.
               05  FILLER   PIC X(13)  VALUE    '140143 008486'.
               05  FILLER   PIC X(13)  VALUE    '140145 009107'.
               05  FILLER   PIC X(13)  VALUE    '140147 008486'.
               05  FILLER   PIC X(13)  VALUE    '140148 009016'.
               05  FILLER   PIC X(13)  VALUE    '140150 010427'.
               05  FILLER   PIC X(13)  VALUE    '140155 010263'.
               05  FILLER   PIC X(13)  VALUE    '140158 010427'.
               05  FILLER   PIC X(13)  VALUE    '140160 009636'.
               05  FILLER   PIC X(13)  VALUE    '140161 010263'.
               05  FILLER   PIC X(13)  VALUE    '140162 009292'.
               05  FILLER   PIC X(13)  VALUE    '140164 008486'.
               05  FILLER   PIC X(13)  VALUE    '140166 008486'.
               05  FILLER   PIC X(13)  VALUE    '140167 008864'.
               05  FILLER   PIC X(13)  VALUE    '140172 010427'.
               05  FILLER   PIC X(13)  VALUE    '140174 010604'.
               05  FILLER   PIC X(13)  VALUE    '140176 010427'.
               05  FILLER   PIC X(13)  VALUE    '140177 010427'.
               05  FILLER   PIC X(13)  VALUE    '140179 010427'.
               05  FILLER   PIC X(13)  VALUE    '140180 010427'.
               05  FILLER   PIC X(13)  VALUE    '140181 010427'.
               05  FILLER   PIC X(13)  VALUE    '140182 010427'.
               05  FILLER   PIC X(13)  VALUE    '140184 008486'.
               05  FILLER   PIC X(13)  VALUE    '140185 009107'.
               05  FILLER   PIC X(13)  VALUE    '140186 010263'.
               05  FILLER   PIC X(13)  VALUE    '140187 009107'.
               05  FILLER   PIC X(13)  VALUE    '140189 008486'.
               05  FILLER   PIC X(13)  VALUE    '140191 010427'.
               05  FILLER   PIC X(13)  VALUE    '140197 010427'.
               05  FILLER   PIC X(13)  VALUE    '140200 010413'.
               05  FILLER   PIC X(13)  VALUE    '140202 010427'.
               05  FILLER   PIC X(13)  VALUE    '140206 010427'.
               05  FILLER   PIC X(13)  VALUE    '140208 010427'.
               05  FILLER   PIC X(13)  VALUE    '140209 009037'.
               05  FILLER   PIC X(13)  VALUE    '140210 008486'.
               05  FILLER   PIC X(13)  VALUE    '140211 010604'.
               05  FILLER   PIC X(13)  VALUE    '140213 010413'.
               05  FILLER   PIC X(13)  VALUE    '140217 010604'.
               05  FILLER   PIC X(13)  VALUE    '140223 010427'.
               05  FILLER   PIC X(13)  VALUE    '140224 010427'.
               05  FILLER   PIC X(13)  VALUE    '140228 009839'.
               05  FILLER   PIC X(13)  VALUE    '140231 010413'.
               05  FILLER   PIC X(13)  VALUE    '140233 009839'.
               05  FILLER   PIC X(13)  VALUE    '140234 008819'.
               05  FILLER   PIC X(13)  VALUE    '140239 009839'.
               05  FILLER   PIC X(13)  VALUE    '140240 010427'.
               05  FILLER   PIC X(13)  VALUE    '140242 010413'.
               05  FILLER   PIC X(13)  VALUE    '140250 010427'.
               05  FILLER   PIC X(13)  VALUE    '140251 010427'.
               05  FILLER   PIC X(13)  VALUE    '140252 010427'.
               05  FILLER   PIC X(13)  VALUE    '140258 010427'.
               05  FILLER   PIC X(13)  VALUE    '140275 009497'.
               05  FILLER   PIC X(13)  VALUE    '140276 010427'.
               05  FILLER   PIC X(13)  VALUE    '140280 009497'.
               05  FILLER   PIC X(13)  VALUE    '140281 010427'.
               05  FILLER   PIC X(13)  VALUE    '140286 010425'.
               05  FILLER   PIC X(13)  VALUE    '140288 010413'.
               05  FILLER   PIC X(13)  VALUE    '140289 009107'.
               05  FILLER   PIC X(13)  VALUE    '140290 010427'.
               05  FILLER   PIC X(13)  VALUE    '140291 010427'.
               05  FILLER   PIC X(13)  VALUE    '140292 010413'.
               05  FILLER   PIC X(13)  VALUE    '140294 008486'.
               05  FILLER   PIC X(13)  VALUE    '140300 010427'.
               05  FILLER   PIC X(13)  VALUE    '140304 010413'.
               05  FILLER   PIC X(13)  VALUE    '140307 009107'.
               05  FILLER   PIC X(13)  VALUE    '150001 010266'.
               05  FILLER   PIC X(13)  VALUE    '150002 010263'.
               05  FILLER   PIC X(13)  VALUE    '150003 009608'.
               05  FILLER   PIC X(13)  VALUE    '150004 010263'.
               05  FILLER   PIC X(13)  VALUE    '150005 010266'.
               05  FILLER   PIC X(13)  VALUE    '150006 009307'.
               05  FILLER   PIC X(13)  VALUE    '150007 009317'.
               05  FILLER   PIC X(13)  VALUE    '150008 010263'.
               05  FILLER   PIC X(13)  VALUE    '150009 008770'.
               05  FILLER   PIC X(13)  VALUE    '150010 009317'.
               05  FILLER   PIC X(13)  VALUE    '150011 010125'.
               05  FILLER   PIC X(13)  VALUE    '150012 008959'.
               05  FILLER   PIC X(13)  VALUE    '150015 010263'.
               05  FILLER   PIC X(13)  VALUE    '150017 008566'.
               05  FILLER   PIC X(13)  VALUE    '150018 008959'.
               05  FILLER   PIC X(13)  VALUE    '150021 008566'.
               05  FILLER   PIC X(13)  VALUE    '150022 010125'.
               05  FILLER   PIC X(13)  VALUE    '150023 010125'.
               05  FILLER   PIC X(13)  VALUE    '150024 010266'.
               05  FILLER   PIC X(13)  VALUE    '150026 008959'.
               05  FILLER   PIC X(13)  VALUE    '150030 010125'.
               05  FILLER   PIC X(13)  VALUE    '150034 010263'.
               05  FILLER   PIC X(13)  VALUE    '150035 009307'.
               05  FILLER   PIC X(13)  VALUE    '150037 010266'.
               05  FILLER   PIC X(13)  VALUE    '150038 010266'.
               05  FILLER   PIC X(13)  VALUE    '150042 008690'.
               05  FILLER   PIC X(13)  VALUE    '150044 008770'.
               05  FILLER   PIC X(13)  VALUE    '150045 008494'.
               05  FILLER   PIC X(13)  VALUE    '150046 009063'.
               05  FILLER   PIC X(13)  VALUE    '150047 008566'.
               05  FILLER   PIC X(13)  VALUE    '150048 009071'.
               05  FILLER   PIC X(13)  VALUE    '150051 010125'.
               05  FILLER   PIC X(13)  VALUE    '150056 010266'.
               05  FILLER   PIC X(13)  VALUE    '150057 010266'.
               05  FILLER   PIC X(13)  VALUE    '150058 008959'.
               05  FILLER   PIC X(13)  VALUE    '150059 010266'.
               05  FILLER   PIC X(13)  VALUE    '150061 008189'.
               05  FILLER   PIC X(13)  VALUE    '150064 008189'.
               05  FILLER   PIC X(13)  VALUE    '150065 010125'.
               05  FILLER   PIC X(13)  VALUE    '150069 009203'.
               05  FILLER   PIC X(13)  VALUE    '150072 008335'.
               05  FILLER   PIC X(13)  VALUE    '150074 010266'.
               05  FILLER   PIC X(13)  VALUE    '150075 009071'.
               05  FILLER   PIC X(13)  VALUE    '150076 008959'.
               05  FILLER   PIC X(13)  VALUE    '150082 009089'.
               05  FILLER   PIC X(13)  VALUE    '150084 010266'.
               05  FILLER   PIC X(13)  VALUE    '150086 009203'.
               05  FILLER   PIC X(13)  VALUE    '150088 010266'.
               05  FILLER   PIC X(13)  VALUE    '150089 010125'.
               05  FILLER   PIC X(13)  VALUE    '150090 010263'.
               05  FILLER   PIC X(13)  VALUE    '150091 008566'.
               05  FILLER   PIC X(13)  VALUE    '150097 010266'.
               05  FILLER   PIC X(13)  VALUE    '150100 009089'.
               05  FILLER   PIC X(13)  VALUE    '150101 008566'.
               05  FILLER   PIC X(13)  VALUE    '150102 009307'.
               05  FILLER   PIC X(13)  VALUE    '150104 010266'.
               05  FILLER   PIC X(13)  VALUE    '150109 009608'.
               05  FILLER   PIC X(13)  VALUE    '150112 010130'.
               05  FILLER   PIC X(13)  VALUE    '150113 010266'.
               05  FILLER   PIC X(13)  VALUE    '150115 008821'.
               05  FILLER   PIC X(13)  VALUE    '150125 010263'.
               05  FILLER   PIC X(13)  VALUE    '150126 010263'.
               05  FILLER   PIC X(13)  VALUE    '150128 010266'.
               05  FILLER   PIC X(13)  VALUE    '150129 010266'.
               05  FILLER   PIC X(13)  VALUE    '150133 008535'.
               05  FILLER   PIC X(13)  VALUE    '150146 008535'.
               05  FILLER   PIC X(13)  VALUE    '150149 009089'.
               05  FILLER   PIC X(13)  VALUE    '150150 008566'.
               05  FILLER   PIC X(13)  VALUE    '150153 010266'.
               05  FILLER   PIC X(13)  VALUE    '150154 010266'.
               05  FILLER   PIC X(13)  VALUE    '150157 010266'.
               05  FILLER   PIC X(13)  VALUE    '150158 010266'.
               05  FILLER   PIC X(13)  VALUE    '150160 010266'.
               05  FILLER   PIC X(13)  VALUE    '150161 010266'.
               05  FILLER   PIC X(13)  VALUE    '150162 010266'.
               05  FILLER   PIC X(13)  VALUE    '150164 009457'.
               05  FILLER   PIC X(13)  VALUE    '150165 010263'.
               05  FILLER   PIC X(13)  VALUE    '150166 010263'.
               05  FILLER   PIC X(13)  VALUE    '150167 008566'.
               05  FILLER   PIC X(13)  VALUE    '150168 008566'.
               05  FILLER   PIC X(13)  VALUE    '150169 010266'.
               05  FILLER   PIC X(13)  VALUE    '150172 008770'.
               05  FILLER   PIC X(13)  VALUE    '150173 009608'.
               05  FILLER   PIC X(13)  VALUE    '150175 009089'.
               05  FILLER   PIC X(13)  VALUE    '150176 008770'.
               05  FILLER   PIC X(13)  VALUE    '150177 008959'.
               05  FILLER   PIC X(13)  VALUE    '150179 010266'.
               05  FILLER   PIC X(13)  VALUE    '150180 008959'.
               05  FILLER   PIC X(13)  VALUE    '150181 010266'.
               05  FILLER   PIC X(13)  VALUE    '150182 010266'.
               05  FILLER   PIC X(13)  VALUE    '150183 009457'.
               05  FILLER   PIC X(13)  VALUE    '160001 009200'.
               05  FILLER   PIC X(13)  VALUE    '160005 008249'.
               05  FILLER   PIC X(13)  VALUE    '160008 008249'.
               05  FILLER   PIC X(13)  VALUE    '160013 008895'.
               05  FILLER   PIC X(13)  VALUE    '160016 008731'.
               05  FILLER   PIC X(13)  VALUE    '160024 009200'.
               05  FILLER   PIC X(13)  VALUE    '160028 009281'.
               05  FILLER   PIC X(13)  VALUE    '160029 009886'.
               05  FILLER   PIC X(13)  VALUE    '160030 009366'.
               05  FILLER   PIC X(13)  VALUE    '160032 009200'.
               05  FILLER   PIC X(13)  VALUE    '160033 009497'.
               05  FILLER   PIC X(13)  VALUE    '160040 008440'.
               05  FILLER   PIC X(13)  VALUE    '160045 009304'.
               05  FILLER   PIC X(13)  VALUE    '160047 009281'.
               05  FILLER   PIC X(13)  VALUE    '160057 009304'.
               05  FILLER   PIC X(13)  VALUE    '160058 009886'.
               05  FILLER   PIC X(13)  VALUE    '160064 008628'.
               05  FILLER   PIC X(13)  VALUE    '160067 008440'.
               05  FILLER   PIC X(13)  VALUE    '160069 008726'.
               05  FILLER   PIC X(13)  VALUE    '160079 009304'.
               05  FILLER   PIC X(13)  VALUE    '160080 009194'.
               05  FILLER   PIC X(13)  VALUE    '160082 009200'.
               05  FILLER   PIC X(13)  VALUE    '160083 009200'.
               05  FILLER   PIC X(13)  VALUE    '160089 009304'.
               05  FILLER   PIC X(13)  VALUE    '160101 009200'.
               05  FILLER   PIC X(13)  VALUE    '160104 009497'.
               05  FILLER   PIC X(13)  VALUE    '160110 008440'.
               05  FILLER   PIC X(13)  VALUE    '160112 008249'.
               05  FILLER   PIC X(13)  VALUE    '160117 008726'.
               05  FILLER   PIC X(13)  VALUE    '160122 008249'.
               05  FILLER   PIC X(13)  VALUE    '160124 008249'.
               05  FILLER   PIC X(13)  VALUE    '160146 008430'.
               05  FILLER   PIC X(13)  VALUE    '160147 008249'.
               05  FILLER   PIC X(13)  VALUE    '160153 009281'.
               05  FILLER   PIC X(13)  VALUE    '160157 009200'.
               05  FILLER   PIC X(13)  VALUE    '170006 007718'.
               05  FILLER   PIC X(13)  VALUE    '170009 009165'.
               05  FILLER   PIC X(13)  VALUE    '170010 007776'.
               05  FILLER   PIC X(13)  VALUE    '170012 007718'.
               05  FILLER   PIC X(13)  VALUE    '170013 008591'.
               05  FILLER   PIC X(13)  VALUE    '170014 009165'.
               05  FILLER   PIC X(13)  VALUE    '170016 008972'.
               05  FILLER   PIC X(13)  VALUE    '170017 008407'.
               05  FILLER   PIC X(13)  VALUE    '170020 008407'.
               05  FILLER   PIC X(13)  VALUE    '170023 007718'.
               05  FILLER   PIC X(13)  VALUE    '170027 007718'.
               05  FILLER   PIC X(13)  VALUE    '170039 007718'.
               05  FILLER   PIC X(13)  VALUE    '170040 009165'.
               05  FILLER   PIC X(13)  VALUE    '170049 009165'.
               05  FILLER   PIC X(13)  VALUE    '170058 009165'.
               05  FILLER   PIC X(13)  VALUE    '170068 008154'.
               05  FILLER   PIC X(13)  VALUE    '170074 007718'.
               05  FILLER   PIC X(13)  VALUE    '170075 007718'.
               05  FILLER   PIC X(13)  VALUE    '170086 008972'.
               05  FILLER   PIC X(13)  VALUE    '170103 008407'.
               05  FILLER   PIC X(13)  VALUE    '170104 009165'.
               05  FILLER   PIC X(13)  VALUE    '170105 007718'.
               05  FILLER   PIC X(13)  VALUE    '170109 009165'.
               05  FILLER   PIC X(13)  VALUE    '170110 007718'.
               05  FILLER   PIC X(13)  VALUE    '170120 007718'.
               05  FILLER   PIC X(13)  VALUE    '170122 008407'.
               05  FILLER   PIC X(13)  VALUE    '170123 008407'.
               05  FILLER   PIC X(13)  VALUE    '170133 009165'.
               05  FILLER   PIC X(13)  VALUE    '170137 009165'.
               05  FILLER   PIC X(13)  VALUE    '170142 008972'.
               05  FILLER   PIC X(13)  VALUE    '170145 007776'.
               05  FILLER   PIC X(13)  VALUE    '170146 009165'.
               05  FILLER   PIC X(13)  VALUE    '170150 007832'.
               05  FILLER   PIC X(13)  VALUE    '170166 007718'.
               05  FILLER   PIC X(13)  VALUE    '170175 008407'.
               05  FILLER   PIC X(13)  VALUE    '170176 009165'.
               05  FILLER   PIC X(13)  VALUE    '170180 009165'.
               05  FILLER   PIC X(13)  VALUE    '170182 009165'.
               05  FILLER   PIC X(13)  VALUE    '170183 008407'.
               05  FILLER   PIC X(13)  VALUE    '170185 009165'.
               05  FILLER   PIC X(13)  VALUE    '170186 008407'.
               05  FILLER   PIC X(13)  VALUE    '170187 007718'.
               05  FILLER   PIC X(13)  VALUE    '170188 009165'.
               05  FILLER   PIC X(13)  VALUE    '170190 008649'.
               05  FILLER   PIC X(13)  VALUE    '170191 007718'.
               05  FILLER   PIC X(13)  VALUE    '170194 009165'.
               05  FILLER   PIC X(13)  VALUE    '170196 008407'.
               05  FILLER   PIC X(13)  VALUE    '170197 008407'.
               05  FILLER   PIC X(13)  VALUE    '170198 007718'.
               05  FILLER   PIC X(13)  VALUE    '170199 009165'.
               05  FILLER   PIC X(13)  VALUE    '170200 008407'.
               05  FILLER   PIC X(13)  VALUE    '170201 009165'.
               05  FILLER   PIC X(13)  VALUE    '170203 008000'.
               05  FILLER   PIC X(13)  VALUE    '180001 009203'.
               05  FILLER   PIC X(13)  VALUE    '180002 007965'.
               05  FILLER   PIC X(13)  VALUE    '180004 007965'.
               05  FILLER   PIC X(13)  VALUE    '180005 008250'.
               05  FILLER   PIC X(13)  VALUE    '180009 008369'.
               05  FILLER   PIC X(13)  VALUE    '180010 009022'.
               05  FILLER   PIC X(13)  VALUE    '180011 007965'.
               05  FILLER   PIC X(13)  VALUE    '180012 008770'.
               05  FILLER   PIC X(13)  VALUE    '180013 008577'.
               05  FILLER   PIC X(13)  VALUE    '180016 007965'.
               05  FILLER   PIC X(13)  VALUE    '180017 008577'.
               05  FILLER   PIC X(13)  VALUE    '180018 007965'.
               05  FILLER   PIC X(13)  VALUE    '180019 007965'.
               05  FILLER   PIC X(13)  VALUE    '180020 007965'.
               05  FILLER   PIC X(13)  VALUE    '180021 007965'.
               05  FILLER   PIC X(13)  VALUE    '180024 007965'.
               05  FILLER   PIC X(13)  VALUE    '180025 008770'.
               05  FILLER   PIC X(13)  VALUE    '180027 007965'.
               05  FILLER   PIC X(13)  VALUE    '180029 008887'.
               05  FILLER   PIC X(13)  VALUE    '180035 009203'.
               05  FILLER   PIC X(13)  VALUE    '180036 008369'.
               05  FILLER   PIC X(13)  VALUE    '180038 008821'.
               05  FILLER   PIC X(13)  VALUE    '180040 008770'.
               05  FILLER   PIC X(13)  VALUE    '180043 007965'.
               05  FILLER   PIC X(13)  VALUE    '180044 008250'.
               05  FILLER   PIC X(13)  VALUE    '180045 009203'.
               05  FILLER   PIC X(13)  VALUE    '180046 009022'.
               05  FILLER   PIC X(13)  VALUE    '180048 008887'.
               05  FILLER   PIC X(13)  VALUE    '180049 008887'.
               05  FILLER   PIC X(13)  VALUE    '180050 007965'.
               05  FILLER   PIC X(13)  VALUE    '180051 008577'.
               05  FILLER   PIC X(13)  VALUE    '180053 007965'.
               05  FILLER   PIC X(13)  VALUE    '180056 009089'.
               05  FILLER   PIC X(13)  VALUE    '180064 008163'.
               05  FILLER   PIC X(13)  VALUE    '180066 008323'.
               05  FILLER   PIC X(13)  VALUE    '180067 009022'.
               05  FILLER   PIC X(13)  VALUE    '180069 008250'.
               05  FILLER   PIC X(13)  VALUE    '180070 007965'.
               05  FILLER   PIC X(13)  VALUE    '180078 008250'.
               05  FILLER   PIC X(13)  VALUE    '180079 008229'.
               05  FILLER   PIC X(13)  VALUE    '180080 007965'.
               05  FILLER   PIC X(13)  VALUE    '180087 007965'.
               05  FILLER   PIC X(13)  VALUE    '180088 008770'.
               05  FILLER   PIC X(13)  VALUE    '180092 009022'.
               05  FILLER   PIC X(13)  VALUE    '180093 008821'.
               05  FILLER   PIC X(13)  VALUE    '180095 007965'.
               05  FILLER   PIC X(13)  VALUE    '180101 009022'.
               05  FILLER   PIC X(13)  VALUE    '180102 008486'.
               05  FILLER   PIC X(13)  VALUE    '180103 009022'.
               05  FILLER   PIC X(13)  VALUE    '180104 008486'.
               05  FILLER   PIC X(13)  VALUE    '180105 007965'.
               05  FILLER   PIC X(13)  VALUE    '180106 007965'.
               05  FILLER   PIC X(13)  VALUE    '180115 007965'.
               05  FILLER   PIC X(13)  VALUE    '180116 008486'.
               05  FILLER   PIC X(13)  VALUE    '180117 007965'.
               05  FILLER   PIC X(13)  VALUE    '180124 008577'.
               05  FILLER   PIC X(13)  VALUE    '180127 009203'.
               05  FILLER   PIC X(13)  VALUE    '180128 007965'.
               05  FILLER   PIC X(13)  VALUE    '180130 008770'.
               05  FILLER   PIC X(13)  VALUE    '180132 008887'.
               05  FILLER   PIC X(13)  VALUE    '180138 008770'.
               05  FILLER   PIC X(13)  VALUE    '180139 007965'.
               05  FILLER   PIC X(13)  VALUE    '180141 008770'.
               05  FILLER   PIC X(13)  VALUE    '180143 009022'.
               05  FILLER   PIC X(13)  VALUE    '180149 007965'.
               05  FILLER   PIC X(13)  VALUE    '180152 007965'.
               05  FILLER   PIC X(13)  VALUE    '180153 007965'.
               05  FILLER   PIC X(13)  VALUE    '190002 007818'.
               05  FILLER   PIC X(13)  VALUE    '190003 007818'.
               05  FILLER   PIC X(13)  VALUE    '190004 008213'.
               05  FILLER   PIC X(13)  VALUE    '190005 008332'.
               05  FILLER   PIC X(13)  VALUE    '190006 007818'.
               05  FILLER   PIC X(13)  VALUE    '190007 008331'.
               05  FILLER   PIC X(13)  VALUE    '190008 008213'.
               05  FILLER   PIC X(13)  VALUE    '190011 007968'.
               05  FILLER   PIC X(13)  VALUE    '190013 007723'.
               05  FILLER   PIC X(13)  VALUE    '190014 007971'.
               05  FILLER   PIC X(13)  VALUE    '190015 008321'.
               05  FILLER   PIC X(13)  VALUE    '190017 007971'.
               05  FILLER   PIC X(13)  VALUE    '190019 008894'.
               05  FILLER   PIC X(13)  VALUE    '190020 007971'.
               05  FILLER   PIC X(13)  VALUE    '190025 007299'.
               05  FILLER   PIC X(13)  VALUE    '190026 008894'.
               05  FILLER   PIC X(13)  VALUE    '190027 008548'.
               05  FILLER   PIC X(13)  VALUE    '190034 007067'.
               05  FILLER   PIC X(13)  VALUE    '190036 008332'.
               05  FILLER   PIC X(13)  VALUE    '190039 008332'.
               05  FILLER   PIC X(13)  VALUE    '190040 008318'.
               05  FILLER   PIC X(13)  VALUE    '190041 008441'.
               05  FILLER   PIC X(13)  VALUE    '190044 007818'.
               05  FILLER   PIC X(13)  VALUE    '190045 008318'.
               05  FILLER   PIC X(13)  VALUE    '190046 008332'.
               05  FILLER   PIC X(13)  VALUE    '190050 007120'.
               05  FILLER   PIC X(13)  VALUE    '190053 007516'.
               05  FILLER   PIC X(13)  VALUE    '190054 007818'.
               05  FILLER   PIC X(13)  VALUE    '190060 008548'.
               05  FILLER   PIC X(13)  VALUE    '190064 007971'.
               05  FILLER   PIC X(13)  VALUE    '190065 008213'.
               05  FILLER   PIC X(13)  VALUE    '190079 008332'.
               05  FILLER   PIC X(13)  VALUE    '190081 007067'.
               05  FILLER   PIC X(13)  VALUE    '190086 008331'.
               05  FILLER   PIC X(13)  VALUE    '190088 007067'.
               05  FILLER   PIC X(13)  VALUE    '190090 007067'.
               05  FILLER   PIC X(13)  VALUE    '190098 008441'.
               05  FILLER   PIC X(13)  VALUE    '190099 007388'.
               05  FILLER   PIC X(13)  VALUE    '190102 007818'.
               05  FILLER   PIC X(13)  VALUE    '190106 007067'.
               05  FILLER   PIC X(13)  VALUE    '190111 008441'.
               05  FILLER   PIC X(13)  VALUE    '190114 007326'.
               05  FILLER   PIC X(13)  VALUE    '190116 007253'.
               05  FILLER   PIC X(13)  VALUE    '190118 008441'.
               05  FILLER   PIC X(13)  VALUE    '190125 007968'.
               05  FILLER   PIC X(13)  VALUE    '190128 007971'.
               05  FILLER   PIC X(13)  VALUE    '190133 007067'.
               05  FILLER   PIC X(13)  VALUE    '190140 007169'.
               05  FILLER   PIC X(13)  VALUE    '190144 008441'.
               05  FILLER   PIC X(13)  VALUE    '190145 007284'.
               05  FILLER   PIC X(13)  VALUE    '190146 008332'.
               05  FILLER   PIC X(13)  VALUE    '190151 007067'.
               05  FILLER   PIC X(13)  VALUE    '190160 007968'.
               05  FILLER   PIC X(13)  VALUE    '190164 008684'.
               05  FILLER   PIC X(13)  VALUE    '190167 008684'.
               05  FILLER   PIC X(13)  VALUE    '190175 008332'.
               05  FILLER   PIC X(13)  VALUE    '190176 008332'.
               05  FILLER   PIC X(13)  VALUE    '190177 008318'.
               05  FILLER   PIC X(13)  VALUE    '190183 007375'.
               05  FILLER   PIC X(13)  VALUE    '190184 008684'.
               05  FILLER   PIC X(13)  VALUE    '190190 008684'.
               05  FILLER   PIC X(13)  VALUE    '190199 007971'.
               05  FILLER   PIC X(13)  VALUE    '190201 007723'.
               05  FILLER   PIC X(13)  VALUE    '190202 007971'.
               05  FILLER   PIC X(13)  VALUE    '190204 008318'.
               05  FILLER   PIC X(13)  VALUE    '190205 007818'.
               05  FILLER   PIC X(13)  VALUE    '190208 007098'.
               05  FILLER   PIC X(13)  VALUE    '190218 007067'.
               05  FILLER   PIC X(13)  VALUE    '190236 008441'.
               05  FILLER   PIC X(13)  VALUE    '190241 007375'.
               05  FILLER   PIC X(13)  VALUE    '190242 008213'.
               05  FILLER   PIC X(13)  VALUE    '190245 007968'.
               05  FILLER   PIC X(13)  VALUE    '190246 007968'.
               05  FILLER   PIC X(13)  VALUE    '190250 008318'.
               05  FILLER   PIC X(13)  VALUE    '190251 007971'.
               05  FILLER   PIC X(13)  VALUE    '190255 007818'.
               05  FILLER   PIC X(13)  VALUE    '190256 008318'.
               05  FILLER   PIC X(13)  VALUE    '190257 007173'.
               05  FILLER   PIC X(13)  VALUE    '190259 007818'.
               05  FILLER   PIC X(13)  VALUE    '190261 007968'.
               05  FILLER   PIC X(13)  VALUE    '190263 007818'.
               05  FILLER   PIC X(13)  VALUE    '190266 007971'.
               05  FILLER   PIC X(13)  VALUE    '190267 008318'.
               05  FILLER   PIC X(13)  VALUE    '190268 007818'.
               05  FILLER   PIC X(13)  VALUE    '190270 008318'.
               05  FILLER   PIC X(13)  VALUE    '190274 008332'.
               05  FILLER   PIC X(13)  VALUE    '190278 008441'.
               05  FILLER   PIC X(13)  VALUE    '190297 007067'.
               05  FILLER   PIC X(13)  VALUE    '190298 008894'.
               05  FILLER   PIC X(13)  VALUE    '190300 008332'.
               05  FILLER   PIC X(13)  VALUE    '190302 008332'.
               05  FILLER   PIC X(13)  VALUE    '190303 008321'.
               05  FILLER   PIC X(13)  VALUE    '190307 007723'.
               05  FILLER   PIC X(13)  VALUE    '190308 008332'.
               05  FILLER   PIC X(13)  VALUE    '190312 007504'.
               05  FILLER   PIC X(13)  VALUE    '190313 008332'.
               05  FILLER   PIC X(13)  VALUE    '200001 010045'.
               05  FILLER   PIC X(13)  VALUE    '200008 010364'.
               05  FILLER   PIC X(13)  VALUE    '200009 010364'.
               05  FILLER   PIC X(13)  VALUE    '200018 008804'.
               05  FILLER   PIC X(13)  VALUE    '200019 010364'.
               05  FILLER   PIC X(13)  VALUE    '200020 010364'.
               05  FILLER   PIC X(13)  VALUE    '200021 010364'.
               05  FILLER   PIC X(13)  VALUE    '200024 009720'.
               05  FILLER   PIC X(13)  VALUE    '200025 010364'.
               05  FILLER   PIC X(13)  VALUE    '200031 008804'.
               05  FILLER   PIC X(13)  VALUE    '200033 010045'.
               05  FILLER   PIC X(13)  VALUE    '200034 009720'.
               05  FILLER   PIC X(13)  VALUE    '200037 008804'.
               05  FILLER   PIC X(13)  VALUE    '200039 009720'.
               05  FILLER   PIC X(13)  VALUE    '200040 010364'.
               05  FILLER   PIC X(13)  VALUE    '200041 008804'.
               05  FILLER   PIC X(13)  VALUE    '200050 010045'.
               05  FILLER   PIC X(13)  VALUE    '200052 008804'.
               05  FILLER   PIC X(13)  VALUE    '200063 009720'.
               05  FILLER   PIC X(13)  VALUE    '210001 009132'.
               05  FILLER   PIC X(13)  VALUE    '210002 009463'.
               05  FILLER   PIC X(13)  VALUE    '210003 009998'.
               05  FILLER   PIC X(13)  VALUE    '210004 009782'.
               05  FILLER   PIC X(13)  VALUE    '210005 009638'.
               05  FILLER   PIC X(13)  VALUE    '210006 009463'.
               05  FILLER   PIC X(13)  VALUE    '210008 009463'.
               05  FILLER   PIC X(13)  VALUE    '210009 009463'.
               05  FILLER   PIC X(13)  VALUE    '210011 009463'.
               05  FILLER   PIC X(13)  VALUE    '210012 009463'.
               05  FILLER   PIC X(13)  VALUE    '210013 009463'.
               05  FILLER   PIC X(13)  VALUE    '210015 009463'.
               05  FILLER   PIC X(13)  VALUE    '210016 009782'.
               05  FILLER   PIC X(13)  VALUE    '210017 008763'.
               05  FILLER   PIC X(13)  VALUE    '210018 009782'.
               05  FILLER   PIC X(13)  VALUE    '210019 009142'.
               05  FILLER   PIC X(13)  VALUE    '210022 009782'.
               05  FILLER   PIC X(13)  VALUE    '210023 009563'.
               05  FILLER   PIC X(13)  VALUE    '210024 009463'.
               05  FILLER   PIC X(13)  VALUE    '210027 008763'.
               05  FILLER   PIC X(13)  VALUE    '210028 008941'.
               05  FILLER   PIC X(13)  VALUE    '210029 009463'.
               05  FILLER   PIC X(13)  VALUE    '210030 009483'.
               05  FILLER   PIC X(13)  VALUE    '210032 011303'.
               05  FILLER   PIC X(13)  VALUE    '210033 009463'.
               05  FILLER   PIC X(13)  VALUE    '210034 009463'.
               05  FILLER   PIC X(13)  VALUE    '210035 009998'.
               05  FILLER   PIC X(13)  VALUE    '210037 008875'.
               05  FILLER   PIC X(13)  VALUE    '210038 009463'.
               05  FILLER   PIC X(13)  VALUE    '210039 009998'.
               05  FILLER   PIC X(13)  VALUE    '210040 009463'.
               05  FILLER   PIC X(13)  VALUE    '210043 009563'.
               05  FILLER   PIC X(13)  VALUE    '210044 009463'.
               05  FILLER   PIC X(13)  VALUE    '210045 009142'.
               05  FILLER   PIC X(13)  VALUE    '210048 009463'.
               05  FILLER   PIC X(13)  VALUE    '210049 009463'.
               05  FILLER   PIC X(13)  VALUE    '210051 009998'.
               05  FILLER   PIC X(13)  VALUE    '210055 009998'.
               05  FILLER   PIC X(13)  VALUE    '210056 009463'.
               05  FILLER   PIC X(13)  VALUE    '210057 009782'.
               05  FILLER   PIC X(13)  VALUE    '210058 009463'.
               05  FILLER   PIC X(13)  VALUE    '210060 009998'.
               05  FILLER   PIC X(13)  VALUE    '210061 009142'.
               05  FILLER   PIC X(13)  VALUE    '210062 009998'.
               05  FILLER   PIC X(13)  VALUE    '210063 009463'.
               05  FILLER   PIC X(13)  VALUE    '210064 009463'.
               05  FILLER   PIC X(13)  VALUE    '210065 009782'.
               05  FILLER   PIC X(13)  VALUE    '22B074 013545'.
               05  FILLER   PIC X(13)  VALUE    '220001 013545'.
               05  FILLER   PIC X(13)  VALUE    '220002 013545'.
               05  FILLER   PIC X(13)  VALUE    '220008 013545'.
               05  FILLER   PIC X(13)  VALUE    '220010 013545'.
               05  FILLER   PIC X(13)  VALUE    '220011 013545'.
               05  FILLER   PIC X(13)  VALUE    '220012 013629'.
               05  FILLER   PIC X(13)  VALUE    '220015 013545'.
               05  FILLER   PIC X(13)  VALUE    '220016 013545'.
               05  FILLER   PIC X(13)  VALUE    '220017 013545'.
               05  FILLER   PIC X(13)  VALUE    '220019 013545'.
               05  FILLER   PIC X(13)  VALUE    '220020 013545'.
               05  FILLER   PIC X(13)  VALUE    '220024 013545'.
               05  FILLER   PIC X(13)  VALUE    '220029 013545'.
               05  FILLER   PIC X(13)  VALUE    '220030 013545'.
               05  FILLER   PIC X(13)  VALUE    '220031 013545'.
               05  FILLER   PIC X(13)  VALUE    '220033 013545'.
               05  FILLER   PIC X(13)  VALUE    '220035 013545'.
               05  FILLER   PIC X(13)  VALUE    '220036 013545'.
               05  FILLER   PIC X(13)  VALUE    '220046 013545'.
               05  FILLER   PIC X(13)  VALUE    '220049 013545'.
               05  FILLER   PIC X(13)  VALUE    '220050 013545'.
               05  FILLER   PIC X(13)  VALUE    '220052 013545'.
               05  FILLER   PIC X(13)  VALUE    '220058 013545'.
               05  FILLER   PIC X(13)  VALUE    '220060 013545'.
               05  FILLER   PIC X(13)  VALUE    '220062 013545'.
               05  FILLER   PIC X(13)  VALUE    '220063 013545'.
               05  FILLER   PIC X(13)  VALUE    '220065 013545'.
               05  FILLER   PIC X(13)  VALUE    '220066 013545'.
               05  FILLER   PIC X(13)  VALUE    '220067 013545'.
               05  FILLER   PIC X(13)  VALUE    '220070 013545'.
               05  FILLER   PIC X(13)  VALUE    '220071 013545'.
               05  FILLER   PIC X(13)  VALUE    '220073 013545'.
               05  FILLER   PIC X(13)  VALUE    '220074 013545'.
               05  FILLER   PIC X(13)  VALUE    '220075 013545'.
               05  FILLER   PIC X(13)  VALUE    '220077 013545'.
               05  FILLER   PIC X(13)  VALUE    '220080 013545'.
               05  FILLER   PIC X(13)  VALUE    '220082 013545'.
               05  FILLER   PIC X(13)  VALUE    '220083 013545'.
               05  FILLER   PIC X(13)  VALUE    '220084 013545'.
               05  FILLER   PIC X(13)  VALUE    '220086 013545'.
               05  FILLER   PIC X(13)  VALUE    '220088 013545'.
               05  FILLER   PIC X(13)  VALUE    '220090 013545'.
               05  FILLER   PIC X(13)  VALUE    '220095 013545'.
               05  FILLER   PIC X(13)  VALUE    '220098 013545'.
               05  FILLER   PIC X(13)  VALUE    '220100 013545'.
               05  FILLER   PIC X(13)  VALUE    '220101 013545'.
               05  FILLER   PIC X(13)  VALUE    '220105 013545'.
               05  FILLER   PIC X(13)  VALUE    '220108 013545'.
               05  FILLER   PIC X(13)  VALUE    '220110 013545'.
               05  FILLER   PIC X(13)  VALUE    '220111 013545'.
               05  FILLER   PIC X(13)  VALUE    '220116 013545'.
               05  FILLER   PIC X(13)  VALUE    '220119 013545'.
               05  FILLER   PIC X(13)  VALUE    '220126 013545'.
               05  FILLER   PIC X(13)  VALUE    '220135 013629'.
               05  FILLER   PIC X(13)  VALUE    '220163 013545'.
               05  FILLER   PIC X(13)  VALUE    '220171 013545'.
               05  FILLER   PIC X(13)  VALUE    '220174 013545'.
               05  FILLER   PIC X(13)  VALUE    '220175 013545'.
               05  FILLER   PIC X(13)  VALUE    '220176 013545'.
               05  FILLER   PIC X(13)  VALUE    '220177 013545'.
               05  FILLER   PIC X(13)  VALUE    '230002 009258'.
               05  FILLER   PIC X(13)  VALUE    '230003 009099'.
               05  FILLER   PIC X(13)  VALUE    '230004 009409'.
               05  FILLER   PIC X(13)  VALUE    '230005 009481'.
               05  FILLER   PIC X(13)  VALUE    '230013 010072'.
               05  FILLER   PIC X(13)  VALUE    '230015 009025'.
               05  FILLER   PIC X(13)  VALUE    '230017 010015'.
               05  FILLER   PIC X(13)  VALUE    '230019 010072'.
               05  FILLER   PIC X(13)  VALUE    '230020 009481'.
               05  FILLER   PIC X(13)  VALUE    '230021 009560'.
               05  FILLER   PIC X(13)  VALUE    '230022 009708'.
               05  FILLER   PIC X(13)  VALUE    '230024 009534'.
               05  FILLER   PIC X(13)  VALUE    '230029 010072'.
               05  FILLER   PIC X(13)  VALUE    '230030 008928'.
               05  FILLER   PIC X(13)  VALUE    '230031 009685'.
               05  FILLER   PIC X(13)  VALUE    '230035 008928'.
               05  FILLER   PIC X(13)  VALUE    '230036 008469'.
               05  FILLER   PIC X(13)  VALUE    '230037 009481'.
               05  FILLER   PIC X(13)  VALUE    '230038 009099'.
               05  FILLER   PIC X(13)  VALUE    '230040 008469'.
               05  FILLER   PIC X(13)  VALUE    '230041 009593'.
               05  FILLER   PIC X(13)  VALUE    '230046 010129'.
               05  FILLER   PIC X(13)  VALUE    '230047 009685'.
               05  FILLER   PIC X(13)  VALUE    '230053 009534'.
               05  FILLER   PIC X(13)  VALUE    '230054 009081'.
               05  FILLER   PIC X(13)  VALUE    '230055 008469'.
               05  FILLER   PIC X(13)  VALUE    '230058 008469'.
               05  FILLER   PIC X(13)  VALUE    '230059 009099'.
               05  FILLER   PIC X(13)  VALUE    '230066 009409'.
               05  FILLER   PIC X(13)  VALUE    '230069 009685'.
               05  FILLER   PIC X(13)  VALUE    '230070 008969'.
               05  FILLER   PIC X(13)  VALUE    '230071 010072'.
               05  FILLER   PIC X(13)  VALUE    '230072 009099'.
               05  FILLER   PIC X(13)  VALUE    '230075 009708'.
               05  FILLER   PIC X(13)  VALUE    '230077 009534'.
               05  FILLER   PIC X(13)  VALUE    '230078 008469'.
               05  FILLER   PIC X(13)  VALUE    '230080 008469'.
               05  FILLER   PIC X(13)  VALUE    '230081 008469'.
               05  FILLER   PIC X(13)  VALUE    '230085 010015'.
               05  FILLER   PIC X(13)  VALUE    '230089 009258'.
               05  FILLER   PIC X(13)  VALUE    '230092 010130'.
               05  FILLER   PIC X(13)  VALUE    '230093 008703'.
               05  FILLER   PIC X(13)  VALUE    '230095 008469'.
               05  FILLER   PIC X(13)  VALUE    '230096 009025'.
               05  FILLER   PIC X(13)  VALUE    '230097 009086'.
               05  FILLER   PIC X(13)  VALUE    '230099 009481'.
               05  FILLER   PIC X(13)  VALUE    '230100 008469'.
               05  FILLER   PIC X(13)  VALUE    '230104 009534'.
               05  FILLER   PIC X(13)  VALUE    '230105 009593'.
               05  FILLER   PIC X(13)  VALUE    '230108 008469'.
               05  FILLER   PIC X(13)  VALUE    '230110 008469'.
               05  FILLER   PIC X(13)  VALUE    '230117 010015'.
               05  FILLER   PIC X(13)  VALUE    '230118 008469'.
               05  FILLER   PIC X(13)  VALUE    '230121 009708'.
               05  FILLER   PIC X(13)  VALUE    '230130 010072'.
               05  FILLER   PIC X(13)  VALUE    '230132 011019'.
               05  FILLER   PIC X(13)  VALUE    '230133 008469'.
               05  FILLER   PIC X(13)  VALUE    '230141 011019'.
               05  FILLER   PIC X(13)  VALUE    '230142 009258'.
               05  FILLER   PIC X(13)  VALUE    '230144 010129'.
               05  FILLER   PIC X(13)  VALUE    '230146 009534'.
               05  FILLER   PIC X(13)  VALUE    '230151 010072'.
               05  FILLER   PIC X(13)  VALUE    '230156 010129'.
               05  FILLER   PIC X(13)  VALUE    '230165 009534'.
               05  FILLER   PIC X(13)  VALUE    '230167 010015'.
               05  FILLER   PIC X(13)  VALUE    '230174 009099'.
               05  FILLER   PIC X(13)  VALUE    '230176 009258'.
               05  FILLER   PIC X(13)  VALUE    '230180 008469'.
               05  FILLER   PIC X(13)  VALUE    '230193 010072'.
               05  FILLER   PIC X(13)  VALUE    '230195 009685'.
               05  FILLER   PIC X(13)  VALUE    '230197 011019'.
               05  FILLER   PIC X(13)  VALUE    '230207 010072'.
               05  FILLER   PIC X(13)  VALUE    '230208 008928'.
               05  FILLER   PIC X(13)  VALUE    '230216 009685'.
               05  FILLER   PIC X(13)  VALUE    '230217 009521'.
               05  FILLER   PIC X(13)  VALUE    '230222 009361'.
               05  FILLER   PIC X(13)  VALUE    '230227 009685'.
               05  FILLER   PIC X(13)  VALUE    '230230 010015'.
               05  FILLER   PIC X(13)  VALUE    '230236 009099'.
               05  FILLER   PIC X(13)  VALUE    '230239 008469'.
               05  FILLER   PIC X(13)  VALUE    '230241 009685'.
               05  FILLER   PIC X(13)  VALUE    '230244 009258'.
               05  FILLER   PIC X(13)  VALUE    '230254 010072'.
               05  FILLER   PIC X(13)  VALUE    '230259 010129'.
               05  FILLER   PIC X(13)  VALUE    '230264 009685'.
               05  FILLER   PIC X(13)  VALUE    '230269 010072'.
               05  FILLER   PIC X(13)  VALUE    '230270 009258'.
               05  FILLER   PIC X(13)  VALUE    '230273 009258'.
               05  FILLER   PIC X(13)  VALUE    '230275 008969'.
               05  FILLER   PIC X(13)  VALUE    '230277 010072'.
               05  FILLER   PIC X(13)  VALUE    '230279 009685'.
               05  FILLER   PIC X(13)  VALUE    '230297 009258'.
               05  FILLER   PIC X(13)  VALUE    '230301 010072'.
               05  FILLER   PIC X(13)  VALUE    '230302 010072'.
               05  FILLER   PIC X(13)  VALUE    '230303 009099'.
               05  FILLER   PIC X(13)  VALUE    '230304 009685'.
               05  FILLER   PIC X(13)  VALUE    '240001 011038'.
               05  FILLER   PIC X(13)  VALUE    '240002 009910'.
               05  FILLER   PIC X(13)  VALUE    '240004 011038'.
               05  FILLER   PIC X(13)  VALUE    '240006 010691'.
               05  FILLER   PIC X(13)  VALUE    '240010 010691'.
               05  FILLER   PIC X(13)  VALUE    '240014 011038'.
               05  FILLER   PIC X(13)  VALUE    '240018 010770'.
               05  FILLER   PIC X(13)  VALUE    '240019 009910'.
               05  FILLER   PIC X(13)  VALUE    '240020 011038'.
               05  FILLER   PIC X(13)  VALUE    '240022 009013'.
               05  FILLER   PIC X(13)  VALUE    '240030 009013'.
               05  FILLER   PIC X(13)  VALUE    '240036 010770'.
               05  FILLER   PIC X(13)  VALUE    '240038 011038'.
               05  FILLER   PIC X(13)  VALUE    '240040 009910'.
               05  FILLER   PIC X(13)  VALUE    '240043 009013'.
               05  FILLER   PIC X(13)  VALUE    '240044 009082'.
               05  FILLER   PIC X(13)  VALUE    '240047 010770'.
               05  FILLER   PIC X(13)  VALUE    '240050 011038'.
               05  FILLER   PIC X(13)  VALUE    '240052 009013'.
               05  FILLER   PIC X(13)  VALUE    '240053 011038'.
               05  FILLER   PIC X(13)  VALUE    '240056 011038'.
               05  FILLER   PIC X(13)  VALUE    '240057 011038'.
               05  FILLER   PIC X(13)  VALUE    '240059 011038'.
               05  FILLER   PIC X(13)  VALUE    '240063 011038'.
               05  FILLER   PIC X(13)  VALUE    '240064 009179'.
               05  FILLER   PIC X(13)  VALUE    '240066 011038'.
               05  FILLER   PIC X(13)  VALUE    '240069 010770'.
               05  FILLER   PIC X(13)  VALUE    '240071 010480'.
               05  FILLER   PIC X(13)  VALUE    '240075 010770'.
               05  FILLER   PIC X(13)  VALUE    '240076 011038'.
               05  FILLER   PIC X(13)  VALUE    '240078 011038'.
               05  FILLER   PIC X(13)  VALUE    '240080 011038'.
               05  FILLER   PIC X(13)  VALUE    '240084 009910'.
               05  FILLER   PIC X(13)  VALUE    '240088 010054'.
               05  FILLER   PIC X(13)  VALUE    '240093 010770'.
               05  FILLER   PIC X(13)  VALUE    '240100 009013'.
               05  FILLER   PIC X(13)  VALUE    '240101 009200'.
               05  FILLER   PIC X(13)  VALUE    '240104 011038'.
               05  FILLER   PIC X(13)  VALUE    '240106 011038'.
               05  FILLER   PIC X(13)  VALUE    '240115 011038'.
               05  FILLER   PIC X(13)  VALUE    '240132 011038'.
               05  FILLER   PIC X(13)  VALUE    '240141 011038'.
               05  FILLER   PIC X(13)  VALUE    '240166 009013'.
               05  FILLER   PIC X(13)  VALUE    '240187 010770'.
               05  FILLER   PIC X(13)  VALUE    '240196 011038'.
               05  FILLER   PIC X(13)  VALUE    '240206 014448'.
               05  FILLER   PIC X(13)  VALUE    '240207 011038'.
               05  FILLER   PIC X(13)  VALUE    '240210 011038'.
               05  FILLER   PIC X(13)  VALUE    '240213 011038'.
               05  FILLER   PIC X(13)  VALUE    '240214 011038'.
               05  FILLER   PIC X(13)  VALUE    '250001 008117'.
               05  FILLER   PIC X(13)  VALUE    '250002 007197'.
               05  FILLER   PIC X(13)  VALUE    '250004 008421'.
               05  FILLER   PIC X(13)  VALUE    '250006 007197'.
               05  FILLER   PIC X(13)  VALUE    '250007 007902'.
               05  FILLER   PIC X(13)  VALUE    '250009 008421'.
               05  FILLER   PIC X(13)  VALUE    '250012 008713'.
               05  FILLER   PIC X(13)  VALUE    '250017 007197'.
               05  FILLER   PIC X(13)  VALUE    '250018 007197'.
               05  FILLER   PIC X(13)  VALUE    '250019 007902'.
               05  FILLER   PIC X(13)  VALUE    '250020 007768'.
               05  FILLER   PIC X(13)  VALUE    '250025 007197'.
               05  FILLER   PIC X(13)  VALUE    '250027 007197'.
               05  FILLER   PIC X(13)  VALUE    '250031 007766'.
               05  FILLER   PIC X(13)  VALUE    '250034 008421'.
               05  FILLER   PIC X(13)  VALUE    '250036 007197'.
               05  FILLER   PIC X(13)  VALUE    '250038 008117'.
               05  FILLER   PIC X(13)  VALUE    '250040 007902'.
               05  FILLER   PIC X(13)  VALUE    '250042 008421'.
               05  FILLER   PIC X(13)  VALUE    '250043 007197'.
               05  FILLER   PIC X(13)  VALUE    '250044 007197'.
               05  FILLER   PIC X(13)  VALUE    '250048 008117'.
               05  FILLER   PIC X(13)  VALUE    '250049 007197'.
               05  FILLER   PIC X(13)  VALUE    '250050 007197'.
               05  FILLER   PIC X(13)  VALUE    '250057 007766'.
               05  FILLER   PIC X(13)  VALUE    '250058 007197'.
               05  FILLER   PIC X(13)  VALUE    '250060 007766'.
               05  FILLER   PIC X(13)  VALUE    '250061 008421'.
               05  FILLER   PIC X(13)  VALUE    '250067 007768'.
               05  FILLER   PIC X(13)  VALUE    '250069 007768'.
               05  FILLER   PIC X(13)  VALUE    '250072 008117'.
               05  FILLER   PIC X(13)  VALUE    '250077 007197'.
               05  FILLER   PIC X(13)  VALUE    '250078 007766'.
               05  FILLER   PIC X(13)  VALUE    '250079 007197'.
               05  FILLER   PIC X(13)  VALUE    '250081 007197'.
               05  FILLER   PIC X(13)  VALUE    '250082 007766'.
               05  FILLER   PIC X(13)  VALUE    '250084 007197'.
               05  FILLER   PIC X(13)  VALUE    '250085 007197'.
               05  FILLER   PIC X(13)  VALUE    '250093 008421'.
               05  FILLER   PIC X(13)  VALUE    '250094 007734'.
               05  FILLER   PIC X(13)  VALUE    '250095 007197'.
               05  FILLER   PIC X(13)  VALUE    '250096 008117'.
               05  FILLER   PIC X(13)  VALUE    '250097 007766'.
               05  FILLER   PIC X(13)  VALUE    '250099 007766'.
               05  FILLER   PIC X(13)  VALUE    '250100 007768'.
               05  FILLER   PIC X(13)  VALUE    '250102 008117'.
               05  FILLER   PIC X(13)  VALUE    '250104 007766'.
               05  FILLER   PIC X(13)  VALUE    '250117 007517'.
               05  FILLER   PIC X(13)  VALUE    '250122 007197'.
               05  FILLER   PIC X(13)  VALUE    '250123 007902'.
               05  FILLER   PIC X(13)  VALUE    '250124 008117'.
               05  FILLER   PIC X(13)  VALUE    '250126 008713'.
               05  FILLER   PIC X(13)  VALUE    '250127 014448'.
               05  FILLER   PIC X(13)  VALUE    '250128 007327'.
               05  FILLER   PIC X(13)  VALUE    '250134 008117'.
               05  FILLER   PIC X(13)  VALUE    '250136 008117'.
               05  FILLER   PIC X(13)  VALUE    '250138 008117'.
               05  FILLER   PIC X(13)  VALUE    '250141 008713'.
               05  FILLER   PIC X(13)  VALUE    '250151 007197'.
               05  FILLER   PIC X(13)  VALUE    '250152 008117'.
               05  FILLER   PIC X(13)  VALUE    '250162 007902'.
               05  FILLER   PIC X(13)  VALUE    '250163 007318'.
               05  FILLER   PIC X(13)  VALUE    '250167 008713'.
               05  FILLER   PIC X(13)  VALUE    '250168 007197'.
               05  FILLER   PIC X(13)  VALUE    '260001 008000'.
               05  FILLER   PIC X(13)  VALUE    '260004 007698'.
               05  FILLER   PIC X(13)  VALUE    '260005 009107'.
               05  FILLER   PIC X(13)  VALUE    '260006 009728'.
               05  FILLER   PIC X(13)  VALUE    '260009 009165'.
               05  FILLER   PIC X(13)  VALUE    '260011 008551'.
               05  FILLER   PIC X(13)  VALUE    '260015 007698'.
               05  FILLER   PIC X(13)  VALUE    '260017 008551'.
               05  FILLER   PIC X(13)  VALUE    '260020 009107'.
               05  FILLER   PIC X(13)  VALUE    '260022 008249'.
               05  FILLER   PIC X(13)  VALUE    '260023 009107'.
               05  FILLER   PIC X(13)  VALUE    '260024 007698'.
               05  FILLER   PIC X(13)  VALUE    '260025 009107'.
               05  FILLER   PIC X(13)  VALUE    '260027 009165'.
               05  FILLER   PIC X(13)  VALUE    '260032 009107'.
               05  FILLER   PIC X(13)  VALUE    '260034 007698'.
               05  FILLER   PIC X(13)  VALUE    '260040 007943'.
               05  FILLER   PIC X(13)  VALUE    '260047 008551'.
               05  FILLER   PIC X(13)  VALUE    '260048 009165'.
               05  FILLER   PIC X(13)  VALUE    '260050 009728'.
               05  FILLER   PIC X(13)  VALUE    '260052 009107'.
               05  FILLER   PIC X(13)  VALUE    '260057 009165'.
               05  FILLER   PIC X(13)  VALUE    '260059 007735'.
               05  FILLER   PIC X(13)  VALUE    '260061 007698'.
               05  FILLER   PIC X(13)  VALUE    '260062 009165'.
               05  FILLER   PIC X(13)  VALUE    '260064 008551'.
               05  FILLER   PIC X(13)  VALUE    '260065 007943'.
               05  FILLER   PIC X(13)  VALUE    '260068 008239'.
               05  FILLER   PIC X(13)  VALUE    '260070 007698'.
               05  FILLER   PIC X(13)  VALUE    '260074 008551'.
               05  FILLER   PIC X(13)  VALUE    '260077 009107'.
               05  FILLER   PIC X(13)  VALUE    '260078 007943'.
               05  FILLER   PIC X(13)  VALUE    '260080 007698'.
               05  FILLER   PIC X(13)  VALUE    '260081 009107'.
               05  FILLER   PIC X(13)  VALUE    '260085 009165'.
               05  FILLER   PIC X(13)  VALUE    '260091 009107'.
               05  FILLER   PIC X(13)  VALUE    '260094 007943'.
               05  FILLER   PIC X(13)  VALUE    '260095 009165'.
               05  FILLER   PIC X(13)  VALUE    '260096 009165'.
               05  FILLER   PIC X(13)  VALUE    '260097 008160'.
               05  FILLER   PIC X(13)  VALUE    '260102 009165'.
               05  FILLER   PIC X(13)  VALUE    '260104 009107'.
               05  FILLER   PIC X(13)  VALUE    '260105 009107'.
               05  FILLER   PIC X(13)  VALUE    '260108 009107'.
               05  FILLER   PIC X(13)  VALUE    '260110 007967'.
               05  FILLER   PIC X(13)  VALUE    '260113 008486'.
               05  FILLER   PIC X(13)  VALUE    '260116 007814'.
               05  FILLER   PIC X(13)  VALUE    '260119 007786'.
               05  FILLER   PIC X(13)  VALUE    '260137 008000'.
               05  FILLER   PIC X(13)  VALUE    '260138 009165'.
               05  FILLER   PIC X(13)  VALUE    '260141 008239'.
               05  FILLER   PIC X(13)  VALUE    '260142 007698'.
               05  FILLER   PIC X(13)  VALUE    '260147 007698'.
               05  FILLER   PIC X(13)  VALUE    '260160 007698'.
               05  FILLER   PIC X(13)  VALUE    '260162 009107'.
               05  FILLER   PIC X(13)  VALUE    '260163 007814'.
               05  FILLER   PIC X(13)  VALUE    '260175 009165'.
               05  FILLER   PIC X(13)  VALUE    '260176 009107'.
               05  FILLER   PIC X(13)  VALUE    '260177 009165'.
               05  FILLER   PIC X(13)  VALUE    '260179 009107'.
               05  FILLER   PIC X(13)  VALUE    '260180 009107'.
               05  FILLER   PIC X(13)  VALUE    '260183 007920'.
               05  FILLER   PIC X(13)  VALUE    '260186 008551'.
               05  FILLER   PIC X(13)  VALUE    '260190 009165'.
               05  FILLER   PIC X(13)  VALUE    '260191 009107'.
               05  FILLER   PIC X(13)  VALUE    '260193 009165'.
               05  FILLER   PIC X(13)  VALUE    '260195 007698'.
               05  FILLER   PIC X(13)  VALUE    '260200 009107'.
               05  FILLER   PIC X(13)  VALUE    '260207 007943'.
               05  FILLER   PIC X(13)  VALUE    '260209 008551'.
               05  FILLER   PIC X(13)  VALUE    '260210 009107'.
               05  FILLER   PIC X(13)  VALUE    '260214 009165'.
               05  FILLER   PIC X(13)  VALUE    '260216 009165'.
               05  FILLER   PIC X(13)  VALUE    '260219 009107'.
               05  FILLER   PIC X(13)  VALUE    '260227 007698'.
               05  FILLER   PIC X(13)  VALUE    '270003 010000'.
               05  FILLER   PIC X(13)  VALUE    '270004 010000'.
               05  FILLER   PIC X(13)  VALUE    '270012 010000'.
               05  FILLER   PIC X(13)  VALUE    '270014 010000'.
               05  FILLER   PIC X(13)  VALUE    '270017 010000'.
               05  FILLER   PIC X(13)  VALUE    '270023 010000'.
               05  FILLER   PIC X(13)  VALUE    '270032 010000'.
               05  FILLER   PIC X(13)  VALUE    '270049 010000'.
               05  FILLER   PIC X(13)  VALUE    '270051 010000'.
               05  FILLER   PIC X(13)  VALUE    '270057 010000'.
               05  FILLER   PIC X(13)  VALUE    '270074 014448'.
               05  FILLER   PIC X(13)  VALUE    '270086 010000'.
               05  FILLER   PIC X(13)  VALUE    '270087 010000'.
               05  FILLER   PIC X(13)  VALUE    '270089 010000'.
               05  FILLER   PIC X(13)  VALUE    '280003 009638'.
               05  FILLER   PIC X(13)  VALUE    '280009 009656'.
               05  FILLER   PIC X(13)  VALUE    '280013 009281'.
               05  FILLER   PIC X(13)  VALUE    '280020 009638'.
               05  FILLER   PIC X(13)  VALUE    '280023 009638'.
               05  FILLER   PIC X(13)  VALUE    '280030 009281'.
               05  FILLER   PIC X(13)  VALUE    '280032 008747'.
               05  FILLER   PIC X(13)  VALUE    '280040 009281'.
               05  FILLER   PIC X(13)  VALUE    '280060 009281'.
               05  FILLER   PIC X(13)  VALUE    '280061 008979'.
               05  FILLER   PIC X(13)  VALUE    '280065 009726'.
               05  FILLER   PIC X(13)  VALUE    '280077 009281'.
               05  FILLER   PIC X(13)  VALUE    '280081 009281'.
               05  FILLER   PIC X(13)  VALUE    '280105 009281'.
               05  FILLER   PIC X(13)  VALUE    '280111 008747'.
               05  FILLER   PIC X(13)  VALUE    '280125 008747'.
               05  FILLER   PIC X(13)  VALUE    '280127 009638'.
               05  FILLER   PIC X(13)  VALUE    '280128 009638'.
               05  FILLER   PIC X(13)  VALUE    '280129 009281'.
               05  FILLER   PIC X(13)  VALUE    '280130 009281'.
               05  FILLER   PIC X(13)  VALUE    '280131 009281'.
               05  FILLER   PIC X(13)  VALUE    '280132 009281'.
               05  FILLER   PIC X(13)  VALUE    '280133 009281'.
               05  FILLER   PIC X(13)  VALUE    '280134 008747'.
               05  FILLER   PIC X(13)  VALUE    '280135 009638'.
               05  FILLER   PIC X(13)  VALUE    '290001 010000'.
               05  FILLER   PIC X(13)  VALUE    '290002 010000'.
               05  FILLER   PIC X(13)  VALUE    '290003 011690'.
               05  FILLER   PIC X(13)  VALUE    '290005 011690'.
               05  FILLER   PIC X(13)  VALUE    '290007 011690'.
               05  FILLER   PIC X(13)  VALUE    '290008 010000'.
               05  FILLER   PIC X(13)  VALUE    '290009 012500'.
               05  FILLER   PIC X(13)  VALUE    '290012 011690'.
               05  FILLER   PIC X(13)  VALUE    '290019 010317'.
               05  FILLER   PIC X(13)  VALUE    '290020 010000'.
               05  FILLER   PIC X(13)  VALUE    '290021 011690'.
               05  FILLER   PIC X(13)  VALUE    '290022 011690'.
               05  FILLER   PIC X(13)  VALUE    '290032 010000'.
               05  FILLER   PIC X(13)  VALUE    '290039 011690'.
               05  FILLER   PIC X(13)  VALUE    '290041 011690'.
               05  FILLER   PIC X(13)  VALUE    '290045 011690'.
               05  FILLER   PIC X(13)  VALUE    '290046 011690'.
               05  FILLER   PIC X(13)  VALUE    '290047 011690'.
               05  FILLER   PIC X(13)  VALUE    '290049 010000'.
               05  FILLER   PIC X(13)  VALUE    '290051 010317'.
               05  FILLER   PIC X(13)  VALUE    '290053 011690'.
               05  FILLER   PIC X(13)  VALUE    '290054 011690'.
               05  FILLER   PIC X(13)  VALUE    '290056 011690'.
               05  FILLER   PIC X(13)  VALUE    '290057 011690'.
               05  FILLER   PIC X(13)  VALUE    '290058 011690'.
               05  FILLER   PIC X(13)  VALUE    '300001 010956'.
               05  FILLER   PIC X(13)  VALUE    '300003 010956'.
               05  FILLER   PIC X(13)  VALUE    '300005 010956'.
               05  FILLER   PIC X(13)  VALUE    '300011 011159'.
               05  FILLER   PIC X(13)  VALUE    '300012 011159'.
               05  FILLER   PIC X(13)  VALUE    '300014 010956'.
               05  FILLER   PIC X(13)  VALUE    '300017 011281'.
               05  FILLER   PIC X(13)  VALUE    '300018 010956'.
               05  FILLER   PIC X(13)  VALUE    '300019 011244'.
               05  FILLER   PIC X(13)  VALUE    '300020 011159'.
               05  FILLER   PIC X(13)  VALUE    '300023 011244'.
               05  FILLER   PIC X(13)  VALUE    '300029 011281'.
               05  FILLER   PIC X(13)  VALUE    '300034 011159'.
               05  FILLER   PIC X(13)  VALUE    '310001 012853'.
               05  FILLER   PIC X(13)  VALUE    '310002 012747'.
               05  FILLER   PIC X(13)  VALUE    '310003 012853'.
               05  FILLER   PIC X(13)  VALUE    '310005 011482'.
               05  FILLER   PIC X(13)  VALUE    '310006 012853'.
               05  FILLER   PIC X(13)  VALUE    '310008 012853'.
               05  FILLER   PIC X(13)  VALUE    '310009 012747'.
               05  FILLER   PIC X(13)  VALUE    '310010 012853'.
               05  FILLER   PIC X(13)  VALUE    '310011 011897'.
               05  FILLER   PIC X(13)  VALUE    '310012 012853'.
               05  FILLER   PIC X(13)  VALUE    '310014 010871'.
               05  FILLER   PIC X(13)  VALUE    '310015 012747'.
               05  FILLER   PIC X(13)  VALUE    '310016 012853'.
               05  FILLER   PIC X(13)  VALUE    '310017 012747'.
               05  FILLER   PIC X(13)  VALUE    '310019 012853'.
               05  FILLER   PIC X(13)  VALUE    '310021 010956'.
               05  FILLER   PIC X(13)  VALUE    '310022 010795'.
               05  FILLER   PIC X(13)  VALUE    '310024 011482'.
               05  FILLER   PIC X(13)  VALUE    '310025 012853'.
               05  FILLER   PIC X(13)  VALUE    '310027 011482'.
               05  FILLER   PIC X(13)  VALUE    '310028 012747'.
               05  FILLER   PIC X(13)  VALUE    '310029 010795'.
               05  FILLER   PIC X(13)  VALUE    '310031 010713'.
               05  FILLER   PIC X(13)  VALUE    '310032 011897'.
               05  FILLER   PIC X(13)  VALUE    '310034 012853'.
               05  FILLER   PIC X(13)  VALUE    '310038 012853'.
               05  FILLER   PIC X(13)  VALUE    '310039 012853'.
               05  FILLER   PIC X(13)  VALUE    '310040 012853'.
               05  FILLER   PIC X(13)  VALUE    '310041 012853'.
               05  FILLER   PIC X(13)  VALUE    '310044 010956'.
               05  FILLER   PIC X(13)  VALUE    '310045 012853'.
               05  FILLER   PIC X(13)  VALUE    '310047 012656'.
               05  FILLER   PIC X(13)  VALUE    '310048 011482'.
               05  FILLER   PIC X(13)  VALUE    '310050 012747'.
               05  FILLER   PIC X(13)  VALUE    '310051 012747'.
               05  FILLER   PIC X(13)  VALUE    '310052 012853'.
               05  FILLER   PIC X(13)  VALUE    '310054 012747'.
               05  FILLER   PIC X(13)  VALUE    '310057 010713'.
               05  FILLER   PIC X(13)  VALUE    '310058 012853'.
               05  FILLER   PIC X(13)  VALUE    '310060 009534'.
               05  FILLER   PIC X(13)  VALUE    '310061 010713'.
               05  FILLER   PIC X(13)  VALUE    '310064 012656'.
               05  FILLER   PIC X(13)  VALUE    '310069 011303'.
               05  FILLER   PIC X(13)  VALUE    '310070 012853'.
               05  FILLER   PIC X(13)  VALUE    '310073 012853'.
               05  FILLER   PIC X(13)  VALUE    '310074 012853'.
               05  FILLER   PIC X(13)  VALUE    '310075 012853'.
               05  FILLER   PIC X(13)  VALUE    '310076 012747'.
               05  FILLER   PIC X(13)  VALUE    '310081 010713'.
               05  FILLER   PIC X(13)  VALUE    '310083 012747'.
               05  FILLER   PIC X(13)  VALUE    '310084 012853'.
               05  FILLER   PIC X(13)  VALUE    '310086 010795'.
               05  FILLER   PIC X(13)  VALUE    '310091 011303'.
               05  FILLER   PIC X(13)  VALUE    '310092 010956'.
               05  FILLER   PIC X(13)  VALUE    '310096 012747'.
               05  FILLER   PIC X(13)  VALUE    '310108 012853'.
               05  FILLER   PIC X(13)  VALUE    '310110 010956'.
               05  FILLER   PIC X(13)  VALUE    '310111 012853'.
               05  FILLER   PIC X(13)  VALUE    '310112 012853'.
               05  FILLER   PIC X(13)  VALUE    '310113 012853'.
               05  FILLER   PIC X(13)  VALUE    '310115 009534'.
               05  FILLER   PIC X(13)  VALUE    '310118 012853'.
               05  FILLER   PIC X(13)  VALUE    '310119 012747'.
               05  FILLER   PIC X(13)  VALUE    '310130 012853'.
               05  FILLER   PIC X(13)  VALUE    '320001 009269'.
               05  FILLER   PIC X(13)  VALUE    '320002 011220'.
               05  FILLER   PIC X(13)  VALUE    '320003 009269'.
               05  FILLER   PIC X(13)  VALUE    '320004 008588'.
               05  FILLER   PIC X(13)  VALUE    '320005 009726'.
               05  FILLER   PIC X(13)  VALUE    '320006 009073'.
               05  FILLER   PIC X(13)  VALUE    '320009 009269'.
               05  FILLER   PIC X(13)  VALUE    '320011 009269'.
               05  FILLER   PIC X(13)  VALUE    '320016 008588'.
               05  FILLER   PIC X(13)  VALUE    '320017 009269'.
               05  FILLER   PIC X(13)  VALUE    '320018 008588'.
               05  FILLER   PIC X(13)  VALUE    '320021 009269'.
               05  FILLER   PIC X(13)  VALUE    '320022 008588'.
               05  FILLER   PIC X(13)  VALUE    '320030 008588'.
               05  FILLER   PIC X(13)  VALUE    '320033 009269'.
               05  FILLER   PIC X(13)  VALUE    '320038 008588'.
               05  FILLER   PIC X(13)  VALUE    '320057 014448'.
               05  FILLER   PIC X(13)  VALUE    '320058 014448'.
               05  FILLER   PIC X(13)  VALUE    '320059 014448'.
               05  FILLER   PIC X(13)  VALUE    '320060 014448'.
               05  FILLER   PIC X(13)  VALUE    '320061 014448'.
               05  FILLER   PIC X(13)  VALUE    '320062 014448'.
               05  FILLER   PIC X(13)  VALUE    '320063 008588'.
               05  FILLER   PIC X(13)  VALUE    '320065 008969'.
               05  FILLER   PIC X(13)  VALUE    '320067 008588'.
               05  FILLER   PIC X(13)  VALUE    '320070 014448'.
               05  FILLER   PIC X(13)  VALUE    '320074 009269'.
               05  FILLER   PIC X(13)  VALUE    '320084 008588'.
               05  FILLER   PIC X(13)  VALUE    '320085 008588'.
               05  FILLER   PIC X(13)  VALUE    '320086 008588'.
               05  FILLER   PIC X(13)  VALUE    '320089 009073'.
               05  FILLER   PIC X(13)  VALUE    '33B195 013348'.
               05  FILLER   PIC X(13)  VALUE    '33B234 012211'.
               05  FILLER   PIC X(13)  VALUE    '330003 008640'.
               05  FILLER   PIC X(13)  VALUE    '330004 009966'.
               05  FILLER   PIC X(13)  VALUE    '330005 010280'.
               05  FILLER   PIC X(13)  VALUE    '330006 012853'.
               05  FILLER   PIC X(13)  VALUE    '330008 008903'.
               05  FILLER   PIC X(13)  VALUE    '330009 012853'.
               05  FILLER   PIC X(13)  VALUE    '330011 008640'.
               05  FILLER   PIC X(13)  VALUE    '330013 008640'.
               05  FILLER   PIC X(13)  VALUE    '330014 013348'.
               05  FILLER   PIC X(13)  VALUE    '330019 013348'.
               05  FILLER   PIC X(13)  VALUE    '330023 012747'.
               05  FILLER   PIC X(13)  VALUE    '330024 012853'.
               05  FILLER   PIC X(13)  VALUE    '330027 013348'.
               05  FILLER   PIC X(13)  VALUE    '330028 012853'.
               05  FILLER   PIC X(13)  VALUE    '330030 008640'.
               05  FILLER   PIC X(13)  VALUE    '330033 008640'.
               05  FILLER   PIC X(13)  VALUE    '330043 013348'.
               05  FILLER   PIC X(13)  VALUE    '330044 008893'.
               05  FILLER   PIC X(13)  VALUE    '330045 013348'.
               05  FILLER   PIC X(13)  VALUE    '330046 013348'.
               05  FILLER   PIC X(13)  VALUE    '330047 008640'.
               05  FILLER   PIC X(13)  VALUE    '330049 012747'.
               05  FILLER   PIC X(13)  VALUE    '330055 013348'.
               05  FILLER   PIC X(13)  VALUE    '330056 012853'.
               05  FILLER   PIC X(13)  VALUE    '330057 008640'.
               05  FILLER   PIC X(13)  VALUE    '330058 008640'.
               05  FILLER   PIC X(13)  VALUE    '330059 013348'.
               05  FILLER   PIC X(13)  VALUE    '330061 012853'.
               05  FILLER   PIC X(13)  VALUE    '330065 010280'.
               05  FILLER   PIC X(13)  VALUE    '330067 012211'.
               05  FILLER   PIC X(13)  VALUE    '330073 008640'.
               05  FILLER   PIC X(13)  VALUE    '330074 008640'.
               05  FILLER   PIC X(13)  VALUE    '330078 010280'.
               05  FILLER   PIC X(13)  VALUE    '330079 010175'.
               05  FILLER   PIC X(13)  VALUE    '330080 012853'.
               05  FILLER   PIC X(13)  VALUE    '330084 008640'.
               05  FILLER   PIC X(13)  VALUE    '330085 008640'.
               05  FILLER   PIC X(13)  VALUE    '330086 012853'.
               05  FILLER   PIC X(13)  VALUE    '330088 013348'.
               05  FILLER   PIC X(13)  VALUE    '330090 008702'.
               05  FILLER   PIC X(13)  VALUE    '330094 010560'.
               05  FILLER   PIC X(13)  VALUE    '330096 008640'.
               05  FILLER   PIC X(13)  VALUE    '330100 012853'.
               05  FILLER   PIC X(13)  VALUE    '330101 013348'.
               05  FILLER   PIC X(13)  VALUE    '330102 010280'.
               05  FILLER   PIC X(13)  VALUE    '330103 008897'.
               05  FILLER   PIC X(13)  VALUE    '330104 012853'.
               05  FILLER   PIC X(13)  VALUE    '330106 013348'.
               05  FILLER   PIC X(13)  VALUE    '330107 013348'.
               05  FILLER   PIC X(13)  VALUE    '330108 008640'.
               05  FILLER   PIC X(13)  VALUE    '330111 010280'.
               05  FILLER   PIC X(13)  VALUE    '330115 009977'.
               05  FILLER   PIC X(13)  VALUE    '330119 013348'.
               05  FILLER   PIC X(13)  VALUE    '330125 008640'.
               05  FILLER   PIC X(13)  VALUE    '330126 012853'.
               05  FILLER   PIC X(13)  VALUE    '330127 012853'.
               05  FILLER   PIC X(13)  VALUE    '330128 013348'.
               05  FILLER   PIC X(13)  VALUE    '330132 008897'.
               05  FILLER   PIC X(13)  VALUE    '330135 012853'.
               05  FILLER   PIC X(13)  VALUE    '330136 009526'.
               05  FILLER   PIC X(13)  VALUE    '330140 009977'.
               05  FILLER   PIC X(13)  VALUE    '330141 013348'.
               05  FILLER   PIC X(13)  VALUE    '330144 008640'.
               05  FILLER   PIC X(13)  VALUE    '330151 008640'.
               05  FILLER   PIC X(13)  VALUE    '330153 008640'.
               05  FILLER   PIC X(13)  VALUE    '330157 009526'.
               05  FILLER   PIC X(13)  VALUE    '330158 012853'.
               05  FILLER   PIC X(13)  VALUE    '330160 012853'.
               05  FILLER   PIC X(13)  VALUE    '330162 012853'.
               05  FILLER   PIC X(13)  VALUE    '330163 010280'.
               05  FILLER   PIC X(13)  VALUE    '330164 009830'.
               05  FILLER   PIC X(13)  VALUE    '330166 008640'.
               05  FILLER   PIC X(13)  VALUE    '330167 013348'.
               05  FILLER   PIC X(13)  VALUE    '330169 013348'.
               05  FILLER   PIC X(13)  VALUE    '330175 008804'.
               05  FILLER   PIC X(13)  VALUE    '330180 009086'.
               05  FILLER   PIC X(13)  VALUE    '330181 013348'.
               05  FILLER   PIC X(13)  VALUE    '330182 013348'.
               05  FILLER   PIC X(13)  VALUE    '330184 013348'.
               05  FILLER   PIC X(13)  VALUE    '330185 013348'.
               05  FILLER   PIC X(13)  VALUE    '330188 010280'.
               05  FILLER   PIC X(13)  VALUE    '330191 009086'.
               05  FILLER   PIC X(13)  VALUE    '330193 013348'.
               05  FILLER   PIC X(13)  VALUE    '330194 013348'.
               05  FILLER   PIC X(13)  VALUE    '330195 013348'.
               05  FILLER   PIC X(13)  VALUE    '330196 012853'.
               05  FILLER   PIC X(13)  VALUE    '330197 009627'.
               05  FILLER   PIC X(13)  VALUE    '330198 013348'.
               05  FILLER   PIC X(13)  VALUE    '330199 012853'.
               05  FILLER   PIC X(13)  VALUE    '330201 012853'.
               05  FILLER   PIC X(13)  VALUE    '330202 013348'.
               05  FILLER   PIC X(13)  VALUE    '330203 009977'.
               05  FILLER   PIC X(13)  VALUE    '330204 012853'.
               05  FILLER   PIC X(13)  VALUE    '330205 012853'.
               05  FILLER   PIC X(13)  VALUE    '330208 013348'.
               05  FILLER   PIC X(13)  VALUE    '330211 008640'.
               05  FILLER   PIC X(13)  VALUE    '330214 012853'.
               05  FILLER   PIC X(13)  VALUE    '330215 009526'.
               05  FILLER   PIC X(13)  VALUE    '330218 009977'.
               05  FILLER   PIC X(13)  VALUE    '330219 010280'.
               05  FILLER   PIC X(13)  VALUE    '330221 012853'.
               05  FILLER   PIC X(13)  VALUE    '330222 009086'.
               05  FILLER   PIC X(13)  VALUE    '330223 009627'.
               05  FILLER   PIC X(13)  VALUE    '330224 012090'.
               05  FILLER   PIC X(13)  VALUE    '330226 008640'.
               05  FILLER   PIC X(13)  VALUE    '330229 008640'.
               05  FILLER   PIC X(13)  VALUE    '330231 013348'.
               05  FILLER   PIC X(13)  VALUE    '330232 008640'.
               05  FILLER   PIC X(13)  VALUE    '330233 012853'.
               05  FILLER   PIC X(13)  VALUE    '330234 012660'.
               05  FILLER   PIC X(13)  VALUE    '330235 009526'.
               05  FILLER   PIC X(13)  VALUE    '330236 012853'.
               05  FILLER   PIC X(13)  VALUE    '330238 008640'.
               05  FILLER   PIC X(13)  VALUE    '330239 008640'.
               05  FILLER   PIC X(13)  VALUE    '330240 012853'.
               05  FILLER   PIC X(13)  VALUE    '330241 009977'.
               05  FILLER   PIC X(13)  VALUE    '330245 008893'.
               05  FILLER   PIC X(13)  VALUE    '330246 013348'.
               05  FILLER   PIC X(13)  VALUE    '330250 010175'.
               05  FILLER   PIC X(13)  VALUE    '330259 013348'.
               05  FILLER   PIC X(13)  VALUE    '330261 012853'.
               05  FILLER   PIC X(13)  VALUE    '330264 012853'.
               05  FILLER   PIC X(13)  VALUE    '330265 008640'.
               05  FILLER   PIC X(13)  VALUE    '330267 012853'.
               05  FILLER   PIC X(13)  VALUE    '330270 013348'.
               05  FILLER   PIC X(13)  VALUE    '330273 012747'.
               05  FILLER   PIC X(13)  VALUE    '330276 008640'.
               05  FILLER   PIC X(13)  VALUE    '330277 008640'.
               05  FILLER   PIC X(13)  VALUE    '330279 010280'.
               05  FILLER   PIC X(13)  VALUE    '330285 009830'.
               05  FILLER   PIC X(13)  VALUE    '330286 013348'.
               05  FILLER   PIC X(13)  VALUE    '330304 013348'.
               05  FILLER   PIC X(13)  VALUE    '330306 012853'.
               05  FILLER   PIC X(13)  VALUE    '330307 009034'.
               05  FILLER   PIC X(13)  VALUE    '330331 013348'.
               05  FILLER   PIC X(13)  VALUE    '330332 013348'.
               05  FILLER   PIC X(13)  VALUE    '330340 013348'.
               05  FILLER   PIC X(13)  VALUE    '330350 012853'.
               05  FILLER   PIC X(13)  VALUE    '330353 012913'.
               05  FILLER   PIC X(13)  VALUE    '330372 013348'.
               05  FILLER   PIC X(13)  VALUE    '330385 013348'.
               05  FILLER   PIC X(13)  VALUE    '330386 012747'.
               05  FILLER   PIC X(13)  VALUE    '330393 013348'.
               05  FILLER   PIC X(13)  VALUE    '330394 008640'.
               05  FILLER   PIC X(13)  VALUE    '330395 013348'.
               05  FILLER   PIC X(13)  VALUE    '330396 012853'.
               05  FILLER   PIC X(13)  VALUE    '330397 012853'.
               05  FILLER   PIC X(13)  VALUE    '330399 013348'.
               05  FILLER   PIC X(13)  VALUE    '330401 013348'.
               05  FILLER   PIC X(13)  VALUE    '330404 012853'.
               05  FILLER   PIC X(13)  VALUE    '330405 012853'.
               05  FILLER   PIC X(13)  VALUE    '330406 008640'.
               05  FILLER   PIC X(13)  VALUE    '330408 008640'.
               05  FILLER   PIC X(13)  VALUE    '330409 008640'.
               05  FILLER   PIC X(13)  VALUE    '34B115 008239'.
               05  FILLER   PIC X(13)  VALUE    '340001 009422'.
               05  FILLER   PIC X(13)  VALUE    '340002 008889'.
               05  FILLER   PIC X(13)  VALUE    '340003 007850'.
               05  FILLER   PIC X(13)  VALUE    '340004 009399'.
               05  FILLER   PIC X(13)  VALUE    '340008 007850'.
               05  FILLER   PIC X(13)  VALUE    '340010 008997'.
               05  FILLER   PIC X(13)  VALUE    '340013 009298'.
               05  FILLER   PIC X(13)  VALUE    '340014 009158'.
               05  FILLER   PIC X(13)  VALUE    '340015 009422'.
               05  FILLER   PIC X(13)  VALUE    '340016 007850'.
               05  FILLER   PIC X(13)  VALUE    '340017 008959'.
               05  FILLER   PIC X(13)  VALUE    '340020 008179'.
               05  FILLER   PIC X(13)  VALUE    '340021 009298'.
               05  FILLER   PIC X(13)  VALUE    '340023 008889'.
               05  FILLER   PIC X(13)  VALUE    '340024 008038'.
               05  FILLER   PIC X(13)  VALUE    '340027 008963'.
               05  FILLER   PIC X(13)  VALUE    '340028 008997'.
               05  FILLER   PIC X(13)  VALUE    '340030 009847'.
               05  FILLER   PIC X(13)  VALUE    '340032 009422'.
               05  FILLER   PIC X(13)  VALUE    '340036 009413'.
               05  FILLER   PIC X(13)  VALUE    '340037 008053'.
               05  FILLER   PIC X(13)  VALUE    '340039 009422'.
               05  FILLER   PIC X(13)  VALUE    '340040 009431'.
               05  FILLER   PIC X(13)  VALUE    '340041 008703'.
               05  FILLER   PIC X(13)  VALUE    '340042 008149'.
               05  FILLER   PIC X(13)  VALUE    '340047 009158'.
               05  FILLER   PIC X(13)  VALUE    '340049 009847'.
               05  FILLER   PIC X(13)  VALUE    '340050 008239'.
               05  FILLER   PIC X(13)  VALUE    '340051 008703'.
               05  FILLER   PIC X(13)  VALUE    '340053 009422'.
               05  FILLER   PIC X(13)  VALUE    '340060 008727'.
               05  FILLER   PIC X(13)  VALUE    '340061 009847'.
               05  FILLER   PIC X(13)  VALUE    '340064 007850'.
               05  FILLER   PIC X(13)  VALUE    '340068 008605'.
               05  FILLER   PIC X(13)  VALUE    '340069 009524'.
               05  FILLER   PIC X(13)  VALUE    '340070 009399'.
               05  FILLER   PIC X(13)  VALUE    '340071 008997'.
               05  FILLER   PIC X(13)  VALUE    '340073 009524'.
               05  FILLER   PIC X(13)  VALUE    '340075 008703'.
               05  FILLER   PIC X(13)  VALUE    '340084 008190'.
               05  FILLER   PIC X(13)  VALUE    '340085 009158'.
               05  FILLER   PIC X(13)  VALUE    '340087 007850'.
               05  FILLER   PIC X(13)  VALUE    '340090 009413'.
               05  FILLER   PIC X(13)  VALUE    '340091 009399'.
               05  FILLER   PIC X(13)  VALUE    '340096 009158'.
               05  FILLER   PIC X(13)  VALUE    '340097 007850'.
               05  FILLER   PIC X(13)  VALUE    '340098 009422'.
               05  FILLER   PIC X(13)  VALUE    '340099 007850'.
               05  FILLER   PIC X(13)  VALUE    '340106 007850'.
               05  FILLER   PIC X(13)  VALUE    '340107 008586'.
               05  FILLER   PIC X(13)  VALUE    '340109 008852'.
               05  FILLER   PIC X(13)  VALUE    '340113 009422'.
               05  FILLER   PIC X(13)  VALUE    '340114 009524'.
               05  FILLER   PIC X(13)  VALUE    '340115 009399'.
               05  FILLER   PIC X(13)  VALUE    '340116 009298'.
               05  FILLER   PIC X(13)  VALUE    '340119 009422'.
               05  FILLER   PIC X(13)  VALUE    '340120 007850'.
               05  FILLER   PIC X(13)  VALUE    '340123 009298'.
               05  FILLER   PIC X(13)  VALUE    '340126 008963'.
               05  FILLER   PIC X(13)  VALUE    '340127 009399'.
               05  FILLER   PIC X(13)  VALUE    '340129 009422'.
               05  FILLER   PIC X(13)  VALUE    '340130 009422'.
               05  FILLER   PIC X(13)  VALUE    '340131 008963'.
               05  FILLER   PIC X(13)  VALUE    '340132 007850'.
               05  FILLER   PIC X(13)  VALUE    '340133 007850'.
               05  FILLER   PIC X(13)  VALUE    '340141 008802'.
               05  FILLER   PIC X(13)  VALUE    '340142 007928'.
               05  FILLER   PIC X(13)  VALUE    '340143 009298'.
               05  FILLER   PIC X(13)  VALUE    '340144 009422'.
               05  FILLER   PIC X(13)  VALUE    '340145 009422'.
               05  FILLER   PIC X(13)  VALUE    '340147 008997'.
               05  FILLER   PIC X(13)  VALUE    '340148 009158'.
               05  FILLER   PIC X(13)  VALUE    '340151 008046'.
               05  FILLER   PIC X(13)  VALUE    '340153 009422'.
               05  FILLER   PIC X(13)  VALUE    '340155 009847'.
               05  FILLER   PIC X(13)  VALUE    '340156 014448'.
               05  FILLER   PIC X(13)  VALUE    '340158 008336'.
               05  FILLER   PIC X(13)  VALUE    '340159 009847'.
               05  FILLER   PIC X(13)  VALUE    '340166 009422'.
               05  FILLER   PIC X(13)  VALUE    '340168 008802'.
               05  FILLER   PIC X(13)  VALUE    '340171 009422'.
               05  FILLER   PIC X(13)  VALUE    '340173 009524'.
               05  FILLER   PIC X(13)  VALUE    '340183 009422'.
               05  FILLER   PIC X(13)  VALUE    '340184 008959'.
               05  FILLER   PIC X(13)  VALUE    '340186 008389'.
               05  FILLER   PIC X(13)  VALUE    '340187 009158'.
               05  FILLER   PIC X(13)  VALUE    '340188 008239'.
               05  FILLER   PIC X(13)  VALUE    '350002 010000'.
               05  FILLER   PIC X(13)  VALUE    '350006 010000'.
               05  FILLER   PIC X(13)  VALUE    '350011 010000'.
               05  FILLER   PIC X(13)  VALUE    '350015 010000'.
               05  FILLER   PIC X(13)  VALUE    '350019 010000'.
               05  FILLER   PIC X(13)  VALUE    '350063 014448'.
               05  FILLER   PIC X(13)  VALUE    '350070 010000'.
               05  FILLER   PIC X(13)  VALUE    '36B019 007993'.
               05  FILLER   PIC X(13)  VALUE    '36B020 008829'.
               05  FILLER   PIC X(13)  VALUE    '360001 009203'.
               05  FILLER   PIC X(13)  VALUE    '360002 007993'.
               05  FILLER   PIC X(13)  VALUE    '360003 009203'.
               05  FILLER   PIC X(13)  VALUE    '360006 009549'.
               05  FILLER   PIC X(13)  VALUE    '360008 008250'.
               05  FILLER   PIC X(13)  VALUE    '360009 008713'.
               05  FILLER   PIC X(13)  VALUE    '360010 008019'.
               05  FILLER   PIC X(13)  VALUE    '360011 009256'.
               05  FILLER   PIC X(13)  VALUE    '360012 009549'.
               05  FILLER   PIC X(13)  VALUE    '360013 008489'.
               05  FILLER   PIC X(13)  VALUE    '360014 009256'.
               05  FILLER   PIC X(13)  VALUE    '360016 009203'.
               05  FILLER   PIC X(13)  VALUE    '360017 009549'.
               05  FILLER   PIC X(13)  VALUE    '360019 008585'.
               05  FILLER   PIC X(13)  VALUE    '360020 008585'.
               05  FILLER   PIC X(13)  VALUE    '360025 008540'.
               05  FILLER   PIC X(13)  VALUE    '360026 008823'.
               05  FILLER   PIC X(13)  VALUE    '360027 008585'.
               05  FILLER   PIC X(13)  VALUE    '360029 008671'.
               05  FILLER   PIC X(13)  VALUE    '360032 008489'.
               05  FILLER   PIC X(13)  VALUE    '360035 009549'.
               05  FILLER   PIC X(13)  VALUE    '360036 008585'.
               05  FILLER   PIC X(13)  VALUE    '360037 008829'.
               05  FILLER   PIC X(13)  VALUE    '360039 009256'.
               05  FILLER   PIC X(13)  VALUE    '360040 008593'.
               05  FILLER   PIC X(13)  VALUE    '360041 008829'.
               05  FILLER   PIC X(13)  VALUE    '360044 008214'.
               05  FILLER   PIC X(13)  VALUE    '360046 009203'.
               05  FILLER   PIC X(13)  VALUE    '360048 008671'.
               05  FILLER   PIC X(13)  VALUE    '360051 009256'.
               05  FILLER   PIC X(13)  VALUE    '360052 008823'.
               05  FILLER   PIC X(13)  VALUE    '360054 007993'.
               05  FILLER   PIC X(13)  VALUE    '360055 008585'.
               05  FILLER   PIC X(13)  VALUE    '360056 009203'.
               05  FILLER   PIC X(13)  VALUE    '360058 007993'.
               05  FILLER   PIC X(13)  VALUE    '360059 008829'.
               05  FILLER   PIC X(13)  VALUE    '360064 008585'.
               05  FILLER   PIC X(13)  VALUE    '360065 008585'.
               05  FILLER   PIC X(13)  VALUE    '360066 008713'.
               05  FILLER   PIC X(13)  VALUE    '360068 009481'.
               05  FILLER   PIC X(13)  VALUE    '360070 008585'.
               05  FILLER   PIC X(13)  VALUE    '360071 008048'.
               05  FILLER   PIC X(13)  VALUE    '360072 009549'.
               05  FILLER   PIC X(13)  VALUE    '360074 008671'.
               05  FILLER   PIC X(13)  VALUE    '360075 008829'.
               05  FILLER   PIC X(13)  VALUE    '360076 009203'.
               05  FILLER   PIC X(13)  VALUE    '360077 008829'.
               05  FILLER   PIC X(13)  VALUE    '360078 008136'.
               05  FILLER   PIC X(13)  VALUE    '360079 009256'.
               05  FILLER   PIC X(13)  VALUE    '360080 007993'.
               05  FILLER   PIC X(13)  VALUE    '360081 008671'.
               05  FILLER   PIC X(13)  VALUE    '360082 008829'.
               05  FILLER   PIC X(13)  VALUE    '360084 008585'.
               05  FILLER   PIC X(13)  VALUE    '360085 009549'.
               05  FILLER   PIC X(13)  VALUE    '360086 009256'.
               05  FILLER   PIC X(13)  VALUE    '360087 008829'.
               05  FILLER   PIC X(13)  VALUE    '360089 007993'.
               05  FILLER   PIC X(13)  VALUE    '360090 008671'.
               05  FILLER   PIC X(13)  VALUE    '360091 008829'.
               05  FILLER   PIC X(13)  VALUE    '360092 009549'.
               05  FILLER   PIC X(13)  VALUE    '360095 008489'.
               05  FILLER   PIC X(13)  VALUE    '360096 007993'.
               05  FILLER   PIC X(13)  VALUE    '360098 008829'.
               05  FILLER   PIC X(13)  VALUE    '360107 008097'.
               05  FILLER   PIC X(13)  VALUE    '360109 009256'.
               05  FILLER   PIC X(13)  VALUE    '360112 008671'.
               05  FILLER   PIC X(13)  VALUE    '360118 008243'.
               05  FILLER   PIC X(13)  VALUE    '360121 008540'.
               05  FILLER   PIC X(13)  VALUE    '360123 008829'.
               05  FILLER   PIC X(13)  VALUE    '360125 008585'.
               05  FILLER   PIC X(13)  VALUE    '360131 008034'.
               05  FILLER   PIC X(13)  VALUE    '360132 009203'.
               05  FILLER   PIC X(13)  VALUE    '360133 009203'.
               05  FILLER   PIC X(13)  VALUE    '360134 009203'.
               05  FILLER   PIC X(13)  VALUE    '360137 008829'.
               05  FILLER   PIC X(13)  VALUE    '360141 008585'.
               05  FILLER   PIC X(13)  VALUE    '360143 008829'.
               05  FILLER   PIC X(13)  VALUE    '360144 008829'.
               05  FILLER   PIC X(13)  VALUE    '360145 008829'.
               05  FILLER   PIC X(13)  VALUE    '360147 007993'.
               05  FILLER   PIC X(13)  VALUE    '360148 007993'.
               05  FILLER   PIC X(13)  VALUE    '360150 008585'.
               05  FILLER   PIC X(13)  VALUE    '360151 008585'.
               05  FILLER   PIC X(13)  VALUE    '360152 009549'.
               05  FILLER   PIC X(13)  VALUE    '360153 007993'.
               05  FILLER   PIC X(13)  VALUE    '360155 008829'.
               05  FILLER   PIC X(13)  VALUE    '360156 008097'.
               05  FILLER   PIC X(13)  VALUE    '360159 009256'.
               05  FILLER   PIC X(13)  VALUE    '360161 008058'.
               05  FILLER   PIC X(13)  VALUE    '360163 009203'.
               05  FILLER   PIC X(13)  VALUE    '360170 009549'.
               05  FILLER   PIC X(13)  VALUE    '360172 008829'.
               05  FILLER   PIC X(13)  VALUE    '360174 008823'.
               05  FILLER   PIC X(13)  VALUE    '360175 008221'.
               05  FILLER   PIC X(13)  VALUE    '360179 009203'.
               05  FILLER   PIC X(13)  VALUE    '360180 008829'.
               05  FILLER   PIC X(13)  VALUE    '360185 008272'.
               05  FILLER   PIC X(13)  VALUE    '360189 009549'.
               05  FILLER   PIC X(13)  VALUE    '360192 008829'.
               05  FILLER   PIC X(13)  VALUE    '360195 008829'.
               05  FILLER   PIC X(13)  VALUE    '360197 009256'.
               05  FILLER   PIC X(13)  VALUE    '360203 007993'.
               05  FILLER   PIC X(13)  VALUE    '360210 009549'.
               05  FILLER   PIC X(13)  VALUE    '360211 008040'.
               05  FILLER   PIC X(13)  VALUE    '360212 008829'.
               05  FILLER   PIC X(13)  VALUE    '360218 009549'.
               05  FILLER   PIC X(13)  VALUE    '360230 008829'.
               05  FILLER   PIC X(13)  VALUE    '360234 009203'.
               05  FILLER   PIC X(13)  VALUE    '360236 009203'.
               05  FILLER   PIC X(13)  VALUE    '360239 008823'.
               05  FILLER   PIC X(13)  VALUE    '360241 008585'.
               05  FILLER   PIC X(13)  VALUE    '360245 008585'.
               05  FILLER   PIC X(13)  VALUE    '360247 009549'.
               05  FILLER   PIC X(13)  VALUE    '360259 008671'.
               05  FILLER   PIC X(13)  VALUE    '360261 008369'.
               05  FILLER   PIC X(13)  VALUE    '360262 008671'.
               05  FILLER   PIC X(13)  VALUE    '360263 008713'.
               05  FILLER   PIC X(13)  VALUE    '360266 009549'.
               05  FILLER   PIC X(13)  VALUE    '360270 007993'.
               05  FILLER   PIC X(13)  VALUE    '360274 008823'.
               05  FILLER   PIC X(13)  VALUE    '360276 007993'.
               05  FILLER   PIC X(13)  VALUE    '360348 009549'.
               05  FILLER   PIC X(13)  VALUE    '360351 008585'.
               05  FILLER   PIC X(13)  VALUE    '360352 007993'.
               05  FILLER   PIC X(13)  VALUE    '360354 009203'.
               05  FILLER   PIC X(13)  VALUE    '360355 008712'.
               05  FILLER   PIC X(13)  VALUE    '360358 009549'.
               05  FILLER   PIC X(13)  VALUE    '360359 008829'.
               05  FILLER   PIC X(13)  VALUE    '360360 008823'.
               05  FILLER   PIC X(13)  VALUE    '360361 007993'.
               05  FILLER   PIC X(13)  VALUE    '360362 009203'.
               05  FILLER   PIC X(13)  VALUE    '360363 007993'.
               05  FILLER   PIC X(13)  VALUE    '360364 008829'.
               05  FILLER   PIC X(13)  VALUE    '360365 008243'.
               05  FILLER   PIC X(13)  VALUE    '37B041 007706'.
               05  FILLER   PIC X(13)  VALUE    '370001 008909'.
               05  FILLER   PIC X(13)  VALUE    '370002 008425'.
               05  FILLER   PIC X(13)  VALUE    '370004 007706'.
               05  FILLER   PIC X(13)  VALUE    '370006 008425'.
               05  FILLER   PIC X(13)  VALUE    '370008 008909'.
               05  FILLER   PIC X(13)  VALUE    '370011 008909'.
               05  FILLER   PIC X(13)  VALUE    '370013 008909'.
               05  FILLER   PIC X(13)  VALUE    '370014 008025'.
               05  FILLER   PIC X(13)  VALUE    '370015 008643'.
               05  FILLER   PIC X(13)  VALUE    '370016 008881'.
               05  FILLER   PIC X(13)  VALUE    '370018 008643'.
               05  FILLER   PIC X(13)  VALUE    '370019 007706'.
               05  FILLER   PIC X(13)  VALUE    '370020 008909'.
               05  FILLER   PIC X(13)  VALUE    '370022 008106'.
               05  FILLER   PIC X(13)  VALUE    '370023 007735'.
               05  FILLER   PIC X(13)  VALUE    '370025 008643'.
               05  FILLER   PIC X(13)  VALUE    '370026 008881'.
               05  FILLER   PIC X(13)  VALUE    '370028 008909'.
               05  FILLER   PIC X(13)  VALUE    '370029 008909'.
               05  FILLER   PIC X(13)  VALUE    '370030 007706'.
               05  FILLER   PIC X(13)  VALUE    '370032 008909'.
               05  FILLER   PIC X(13)  VALUE    '370034 008643'.
               05  FILLER   PIC X(13)  VALUE    '370037 008909'.
               05  FILLER   PIC X(13)  VALUE    '370039 008643'.
               05  FILLER   PIC X(13)  VALUE    '370041 008643'.
               05  FILLER   PIC X(13)  VALUE    '370047 008909'.
               05  FILLER   PIC X(13)  VALUE    '370049 008909'.
               05  FILLER   PIC X(13)  VALUE    '370051 007706'.
               05  FILLER   PIC X(13)  VALUE    '370054 008909'.
               05  FILLER   PIC X(13)  VALUE    '370056 007706'.
               05  FILLER   PIC X(13)  VALUE    '370057 008643'.
               05  FILLER   PIC X(13)  VALUE    '370065 007723'.
               05  FILLER   PIC X(13)  VALUE    '370072 007706'.
               05  FILLER   PIC X(13)  VALUE    '370078 008643'.
               05  FILLER   PIC X(13)  VALUE    '370083 007706'.
               05  FILLER   PIC X(13)  VALUE    '370089 007706'.
               05  FILLER   PIC X(13)  VALUE    '370091 008643'.
               05  FILLER   PIC X(13)  VALUE    '370093 008909'.
               05  FILLER   PIC X(13)  VALUE    '370094 008909'.
               05  FILLER   PIC X(13)  VALUE    '370097 008909'.
               05  FILLER   PIC X(13)  VALUE    '370099 008909'.
               05  FILLER   PIC X(13)  VALUE    '370100 007706'.
               05  FILLER   PIC X(13)  VALUE    '370103 007706'.
               05  FILLER   PIC X(13)  VALUE    '370106 008909'.
               05  FILLER   PIC X(13)  VALUE    '370112 007706'.
               05  FILLER   PIC X(13)  VALUE    '370113 008000'.
               05  FILLER   PIC X(13)  VALUE    '370114 008909'.
               05  FILLER   PIC X(13)  VALUE    '370139 007706'.
               05  FILLER   PIC X(13)  VALUE    '370149 008909'.
               05  FILLER   PIC X(13)  VALUE    '370153 007756'.
               05  FILLER   PIC X(13)  VALUE    '370156 007919'.
               05  FILLER   PIC X(13)  VALUE    '370158 008909'.
               05  FILLER   PIC X(13)  VALUE    '370166 008643'.
               05  FILLER   PIC X(13)  VALUE    '370169 007741'.
               05  FILLER   PIC X(13)  VALUE    '370170 014448'.
               05  FILLER   PIC X(13)  VALUE    '370171 014448'.
               05  FILLER   PIC X(13)  VALUE    '370172 014448'.
               05  FILLER   PIC X(13)  VALUE    '370173 014448'.
               05  FILLER   PIC X(13)  VALUE    '370178 007706'.
               05  FILLER   PIC X(13)  VALUE    '370180 014448'.
               05  FILLER   PIC X(13)  VALUE    '370183 008643'.
               05  FILLER   PIC X(13)  VALUE    '370190 008643'.
               05  FILLER   PIC X(13)  VALUE    '370192 008909'.
               05  FILLER   PIC X(13)  VALUE    '370199 008909'.
               05  FILLER   PIC X(13)  VALUE    '370201 008909'.
               05  FILLER   PIC X(13)  VALUE    '370202 008643'.
               05  FILLER   PIC X(13)  VALUE    '370203 008909'.
               05  FILLER   PIC X(13)  VALUE    '370206 008909'.
               05  FILLER   PIC X(13)  VALUE    '370210 008643'.
               05  FILLER   PIC X(13)  VALUE    '370211 008909'.
               05  FILLER   PIC X(13)  VALUE    '370212 008909'.
               05  FILLER   PIC X(13)  VALUE    '370214 007919'.
               05  FILLER   PIC X(13)  VALUE    '370215 008909'.
               05  FILLER   PIC X(13)  VALUE    '370216 008643'.
               05  FILLER   PIC X(13)  VALUE    '370218 008643'.
               05  FILLER   PIC X(13)  VALUE    '370220 008909'.
               05  FILLER   PIC X(13)  VALUE    '370222 008909'.
               05  FILLER   PIC X(13)  VALUE    '370225 008909'.
               05  FILLER   PIC X(13)  VALUE    '370227 008643'.
               05  FILLER   PIC X(13)  VALUE    '370228 008643'.
               05  FILLER   PIC X(13)  VALUE    '370229 007706'.
               05  FILLER   PIC X(13)  VALUE    '370233 008643'.
               05  FILLER   PIC X(13)  VALUE    '370234 008909'.
               05  FILLER   PIC X(13)  VALUE    '370235 008643'.
               05  FILLER   PIC X(13)  VALUE    '370236 008909'.
               05  FILLER   PIC X(13)  VALUE    '370237 007723'.
               05  FILLER   PIC X(13)  VALUE    '370239 007706'.
               05  FILLER   PIC X(13)  VALUE    '380001 011786'.
               05  FILLER   PIC X(13)  VALUE    '380002 010650'.
               05  FILLER   PIC X(13)  VALUE    '380004 011888'.
               05  FILLER   PIC X(13)  VALUE    '380005 010731'.
               05  FILLER   PIC X(13)  VALUE    '380007 011888'.
               05  FILLER   PIC X(13)  VALUE    '380009 011888'.
               05  FILLER   PIC X(13)  VALUE    '380014 010634'.
               05  FILLER   PIC X(13)  VALUE    '380017 011888'.
               05  FILLER   PIC X(13)  VALUE    '380018 012500'.
               05  FILLER   PIC X(13)  VALUE    '380020 011883'.
               05  FILLER   PIC X(13)  VALUE    '380021 011888'.
               05  FILLER   PIC X(13)  VALUE    '380022 011083'.
               05  FILLER   PIC X(13)  VALUE    '380025 011888'.
               05  FILLER   PIC X(13)  VALUE    '380027 011760'.
               05  FILLER   PIC X(13)  VALUE    '380029 010836'.
               05  FILLER   PIC X(13)  VALUE    '380033 011883'.
               05  FILLER   PIC X(13)  VALUE    '380037 011888'.
               05  FILLER   PIC X(13)  VALUE    '380038 011888'.
               05  FILLER   PIC X(13)  VALUE    '380040 010634'.
               05  FILLER   PIC X(13)  VALUE    '380047 011321'.
               05  FILLER   PIC X(13)  VALUE    '380050 010634'.
               05  FILLER   PIC X(13)  VALUE    '380051 011786'.
               05  FILLER   PIC X(13)  VALUE    '380052 010634'.
               05  FILLER   PIC X(13)  VALUE    '380056 010836'.
               05  FILLER   PIC X(13)  VALUE    '380060 011888'.
               05  FILLER   PIC X(13)  VALUE    '380061 011888'.
               05  FILLER   PIC X(13)  VALUE    '380071 011888'.
               05  FILLER   PIC X(13)  VALUE    '380075 012500'.
               05  FILLER   PIC X(13)  VALUE    '380082 011888'.
               05  FILLER   PIC X(13)  VALUE    '380089 011888'.
               05  FILLER   PIC X(13)  VALUE    '380090 011760'.
               05  FILLER   PIC X(13)  VALUE    '380091 011888'.
               05  FILLER   PIC X(13)  VALUE    '380102 011883'.
               05  FILLER   PIC X(13)  VALUE    '380103 011888'.
               05  FILLER   PIC X(13)  VALUE    '39B006 008657'.
               05  FILLER   PIC X(13)  VALUE    '39B115 010871'.
               05  FILLER   PIC X(13)  VALUE    '39B142 010307'.
               05  FILLER   PIC X(13)  VALUE    '390001 009150'.
               05  FILLER   PIC X(13)  VALUE    '390002 008411'.
               05  FILLER   PIC X(13)  VALUE    '390003 009086'.
               05  FILLER   PIC X(13)  VALUE    '390004 009461'.
               05  FILLER   PIC X(13)  VALUE    '390006 009086'.
               05  FILLER   PIC X(13)  VALUE    '390008 008013'.
               05  FILLER   PIC X(13)  VALUE    '390009 008442'.
               05  FILLER   PIC X(13)  VALUE    '390012 010307'.
               05  FILLER   PIC X(13)  VALUE    '390013 009309'.
               05  FILLER   PIC X(13)  VALUE    '390016 008272'.
               05  FILLER   PIC X(13)  VALUE    '390019 009534'.
               05  FILLER   PIC X(13)  VALUE    '390025 010871'.
               05  FILLER   PIC X(13)  VALUE    '390026 010871'.
               05  FILLER   PIC X(13)  VALUE    '390027 010871'.
               05  FILLER   PIC X(13)  VALUE    '390028 008411'.
               05  FILLER   PIC X(13)  VALUE    '390030 009512'.
               05  FILLER   PIC X(13)  VALUE    '390031 009512'.
               05  FILLER   PIC X(13)  VALUE    '390032 008411'.
               05  FILLER   PIC X(13)  VALUE    '390035 010871'.
               05  FILLER   PIC X(13)  VALUE    '390036 008411'.
               05  FILLER   PIC X(13)  VALUE    '390037 008411'.
               05  FILLER   PIC X(13)  VALUE    '390039 007894'.
               05  FILLER   PIC X(13)  VALUE    '390041 008411'.
               05  FILLER   PIC X(13)  VALUE    '390042 008411'.
               05  FILLER   PIC X(13)  VALUE    '390044 009915'.
               05  FILLER   PIC X(13)  VALUE    '390045 009223'.
               05  FILLER   PIC X(13)  VALUE    '390046 009585'.
               05  FILLER   PIC X(13)  VALUE    '390048 009223'.
               05  FILLER   PIC X(13)  VALUE    '390049 010956'.
               05  FILLER   PIC X(13)  VALUE    '390050 008411'.
               05  FILLER   PIC X(13)  VALUE    '390052 008350'.
               05  FILLER   PIC X(13)  VALUE    '390056 008425'.
               05  FILLER   PIC X(13)  VALUE    '390057 010871'.
               05  FILLER   PIC X(13)  VALUE    '390058 009461'.
               05  FILLER   PIC X(13)  VALUE    '390061 009234'.
               05  FILLER   PIC X(13)  VALUE    '390062 010112'.
               05  FILLER   PIC X(13)  VALUE    '390063 008442'.
               05  FILLER   PIC X(13)  VALUE    '390065 011386'.
               05  FILLER   PIC X(13)  VALUE    '390066 009437'.
               05  FILLER   PIC X(13)  VALUE    '390067 009585'.
               05  FILLER   PIC X(13)  VALUE    '390068 009234'.
               05  FILLER   PIC X(13)  VALUE    '390070 010871'.
               05  FILLER   PIC X(13)  VALUE    '390071 009223'.
               05  FILLER   PIC X(13)  VALUE    '390072 009086'.
               05  FILLER   PIC X(13)  VALUE    '390073 010112'.
               05  FILLER   PIC X(13)  VALUE    '390076 010211'.
               05  FILLER   PIC X(13)  VALUE    '390079 008570'.
               05  FILLER   PIC X(13)  VALUE    '390080 010871'.
               05  FILLER   PIC X(13)  VALUE    '390081 010871'.
               05  FILLER   PIC X(13)  VALUE    '390084 008657'.
               05  FILLER   PIC X(13)  VALUE    '390086 008350'.
               05  FILLER   PIC X(13)  VALUE    '390090 008411'.
               05  FILLER   PIC X(13)  VALUE    '390091 008272'.
               05  FILLER   PIC X(13)  VALUE    '390093 007894'.
               05  FILLER   PIC X(13)  VALUE    '390096 009915'.
               05  FILLER   PIC X(13)  VALUE    '390097 010307'.
               05  FILLER   PIC X(13)  VALUE    '390100 009461'.
               05  FILLER   PIC X(13)  VALUE    '390101 009476'.
               05  FILLER   PIC X(13)  VALUE    '390102 008411'.
               05  FILLER   PIC X(13)  VALUE    '390104 007894'.
               05  FILLER   PIC X(13)  VALUE    '390107 008411'.
               05  FILLER   PIC X(13)  VALUE    '390110 008257'.
               05  FILLER   PIC X(13)  VALUE    '390111 010871'.
               05  FILLER   PIC X(13)  VALUE    '390112 007894'.
               05  FILLER   PIC X(13)  VALUE    '390113 007993'.
               05  FILLER   PIC X(13)  VALUE    '390114 008411'.
               05  FILLER   PIC X(13)  VALUE    '390115 010871'.
               05  FILLER   PIC X(13)  VALUE    '390116 010307'.
               05  FILLER   PIC X(13)  VALUE    '390117 008466'.
               05  FILLER   PIC X(13)  VALUE    '390118 007894'.
               05  FILLER   PIC X(13)  VALUE    '390119 009150'.
               05  FILLER   PIC X(13)  VALUE    '390123 010307'.
               05  FILLER   PIC X(13)  VALUE    '390125 008316'.
               05  FILLER   PIC X(13)  VALUE    '390127 010211'.
               05  FILLER   PIC X(13)  VALUE    '390130 007894'.
               05  FILLER   PIC X(13)  VALUE    '390132 010871'.
               05  FILLER   PIC X(13)  VALUE    '390133 010956'.
               05  FILLER   PIC X(13)  VALUE    '390137 009150'.
               05  FILLER   PIC X(13)  VALUE    '390138 011747'.
               05  FILLER   PIC X(13)  VALUE    '390139 010871'.
               05  FILLER   PIC X(13)  VALUE    '390142 010871'.
               05  FILLER   PIC X(13)  VALUE    '390145 008411'.
               05  FILLER   PIC X(13)  VALUE    '390146 008442'.
               05  FILLER   PIC X(13)  VALUE    '390147 008411'.
               05  FILLER   PIC X(13)  VALUE    '390150 007978'.
               05  FILLER   PIC X(13)  VALUE    '390151 011747'.
               05  FILLER   PIC X(13)  VALUE    '390153 010871'.
               05  FILLER   PIC X(13)  VALUE    '390156 010871'.
               05  FILLER   PIC X(13)  VALUE    '390157 008411'.
               05  FILLER   PIC X(13)  VALUE    '390160 008411'.
               05  FILLER   PIC X(13)  VALUE    '390162 010956'.
               05  FILLER   PIC X(13)  VALUE    '390163 008411'.
               05  FILLER   PIC X(13)  VALUE    '390164 008411'.
               05  FILLER   PIC X(13)  VALUE    '390168 008411'.
               05  FILLER   PIC X(13)  VALUE    '390173 008029'.
               05  FILLER   PIC X(13)  VALUE    '390174 010871'.
               05  FILLER   PIC X(13)  VALUE    '390178 007894'.
               05  FILLER   PIC X(13)  VALUE    '390179 010211'.
               05  FILLER   PIC X(13)  VALUE    '390180 010871'.
               05  FILLER   PIC X(13)  VALUE    '390183 009512'.
               05  FILLER   PIC X(13)  VALUE    '390184 008411'.
               05  FILLER   PIC X(13)  VALUE    '390185 009150'.
               05  FILLER   PIC X(13)  VALUE    '390192 008541'.
               05  FILLER   PIC X(13)  VALUE    '390194 009534'.
               05  FILLER   PIC X(13)  VALUE    '390195 010871'.
               05  FILLER   PIC X(13)  VALUE    '390197 009534'.
               05  FILLER   PIC X(13)  VALUE    '390198 007894'.
               05  FILLER   PIC X(13)  VALUE    '390199 007894'.
               05  FILLER   PIC X(13)  VALUE    '390201 010304'.
               05  FILLER   PIC X(13)  VALUE    '390203 010871'.
               05  FILLER   PIC X(13)  VALUE    '390204 010871'.
               05  FILLER   PIC X(13)  VALUE    '390211 008585'.
               05  FILLER   PIC X(13)  VALUE    '390217 008411'.
               05  FILLER   PIC X(13)  VALUE    '390219 008411'.
               05  FILLER   PIC X(13)  VALUE    '390220 010211'.
               05  FILLER   PIC X(13)  VALUE    '390222 010871'.
               05  FILLER   PIC X(13)  VALUE    '390223 010871'.
               05  FILLER   PIC X(13)  VALUE    '390225 009234'.
               05  FILLER   PIC X(13)  VALUE    '390226 010871'.
               05  FILLER   PIC X(13)  VALUE    '390228 008411'.
               05  FILLER   PIC X(13)  VALUE    '390231 010307'.
               05  FILLER   PIC X(13)  VALUE    '390233 009476'.
               05  FILLER   PIC X(13)  VALUE    '390236 008023'.
               05  FILLER   PIC X(13)  VALUE    '390237 009150'.
               05  FILLER   PIC X(13)  VALUE    '390256 009585'.
               05  FILLER   PIC X(13)  VALUE    '390258 010871'.
               05  FILLER   PIC X(13)  VALUE    '390263 009534'.
               05  FILLER   PIC X(13)  VALUE    '390265 008411'.
               05  FILLER   PIC X(13)  VALUE    '390266 007894'.
               05  FILLER   PIC X(13)  VALUE    '390267 008411'.
               05  FILLER   PIC X(13)  VALUE    '390268 010112'.
               05  FILLER   PIC X(13)  VALUE    '390270 010956'.
               05  FILLER   PIC X(13)  VALUE    '390272 010307'.
               05  FILLER   PIC X(13)  VALUE    '390278 010307'.
               05  FILLER   PIC X(13)  VALUE    '390290 010871'.
               05  FILLER   PIC X(13)  VALUE    '390302 010871'.
               05  FILLER   PIC X(13)  VALUE    '390304 010871'.
               05  FILLER   PIC X(13)  VALUE    '390307 007894'.
               05  FILLER   PIC X(13)  VALUE    '390312 010871'.
               05  FILLER   PIC X(13)  VALUE    '390314 009534'.
               05  FILLER   PIC X(13)  VALUE    '390316 009915'.
               05  FILLER   PIC X(13)  VALUE    '390321 009534'.
               05  FILLER   PIC X(13)  VALUE    '390322 010871'.
               05  FILLER   PIC X(13)  VALUE    '390323 008411'.
               05  FILLER   PIC X(13)  VALUE    '390324 010307'.
               05  FILLER   PIC X(13)  VALUE    '390325 009476'.
               05  FILLER   PIC X(13)  VALUE    '390326 009820'.
               05  FILLER   PIC X(13)  VALUE    '390327 009476'.
               05  FILLER   PIC X(13)  VALUE    '390328 008411'.
               05  FILLER   PIC X(13)  VALUE    '390329 010307'.
               05  FILLER   PIC X(13)  VALUE    '390330 010304'.
               05  FILLER   PIC X(13)  VALUE    '390331 010871'.
               05  FILLER   PIC X(13)  VALUE    '400001 004141'.
               05  FILLER   PIC X(13)  VALUE    '400003 003846'.
               05  FILLER   PIC X(13)  VALUE    '400004 004141'.
               05  FILLER   PIC X(13)  VALUE    '400005 004141'.
               05  FILLER   PIC X(13)  VALUE    '400006 004141'.
               05  FILLER   PIC X(13)  VALUE    '400007 004141'.
               05  FILLER   PIC X(13)  VALUE    '400009 003821'.
               05  FILLER   PIC X(13)  VALUE    '400010 003711'.
               05  FILLER   PIC X(13)  VALUE    '400011 004141'.
               05  FILLER   PIC X(13)  VALUE    '400012 004141'.
               05  FILLER   PIC X(13)  VALUE    '400013 004141'.
               05  FILLER   PIC X(13)  VALUE    '400014 003711'.
               05  FILLER   PIC X(13)  VALUE    '400015 004141'.
               05  FILLER   PIC X(13)  VALUE    '400016 004141'.
               05  FILLER   PIC X(13)  VALUE    '400018 004141'.
               05  FILLER   PIC X(13)  VALUE    '400019 004141'.
               05  FILLER   PIC X(13)  VALUE    '400021 004232'.
               05  FILLER   PIC X(13)  VALUE    '400022 003846'.
               05  FILLER   PIC X(13)  VALUE    '400026 003711'.
               05  FILLER   PIC X(13)  VALUE    '400032 004141'.
               05  FILLER   PIC X(13)  VALUE    '400044 003846'.
               05  FILLER   PIC X(13)  VALUE    '400048 003821'.
               05  FILLER   PIC X(13)  VALUE    '400061 004141'.
               05  FILLER   PIC X(13)  VALUE    '400079 003711'.
               05  FILLER   PIC X(13)  VALUE    '400087 003882'.
               05  FILLER   PIC X(13)  VALUE    '400098 004141'.
               05  FILLER   PIC X(13)  VALUE    '400102 004141'.
               05  FILLER   PIC X(13)  VALUE    '400103 003711'.
               05  FILLER   PIC X(13)  VALUE    '400104 004141'.
               05  FILLER   PIC X(13)  VALUE    '400105 004141'.
               05  FILLER   PIC X(13)  VALUE    '400106 004141'.
               05  FILLER   PIC X(13)  VALUE    '400109 004141'.
               05  FILLER   PIC X(13)  VALUE    '400110 003846'.
               05  FILLER   PIC X(13)  VALUE    '400111 003711'.
               05  FILLER   PIC X(13)  VALUE    '400112 004141'.
               05  FILLER   PIC X(13)  VALUE    '400113 003846'.
               05  FILLER   PIC X(13)  VALUE    '400114 004141'.
               05  FILLER   PIC X(13)  VALUE    '400115 004141'.
               05  FILLER   PIC X(13)  VALUE    '400117 003882'.
               05  FILLER   PIC X(13)  VALUE    '400118 004141'.
               05  FILLER   PIC X(13)  VALUE    '400120 004141'.
               05  FILLER   PIC X(13)  VALUE    '400121 004141'.
               05  FILLER   PIC X(13)  VALUE    '400122 004141'.
               05  FILLER   PIC X(13)  VALUE    '400123 003711'.
               05  FILLER   PIC X(13)  VALUE    '400124 004141'.
               05  FILLER   PIC X(13)  VALUE    '400125 004141'.
               05  FILLER   PIC X(13)  VALUE    '400126 004232'.
               05  FILLER   PIC X(13)  VALUE    '400127 004141'.
               05  FILLER   PIC X(13)  VALUE    '400128 004141'.
               05  FILLER   PIC X(13)  VALUE    '400130 003860'.
               05  FILLER   PIC X(13)  VALUE    '400131 004141'.
               05  FILLER   PIC X(13)  VALUE    '400132 004141'.
               05  FILLER   PIC X(13)  VALUE    '400133 004141'.
               05  FILLER   PIC X(13)  VALUE    '400134 004141'.
               05  FILLER   PIC X(13)  VALUE    '410001 010445'.
               05  FILLER   PIC X(13)  VALUE    '410004 010445'.
               05  FILLER   PIC X(13)  VALUE    '410005 010445'.
               05  FILLER   PIC X(13)  VALUE    '410006 010445'.
               05  FILLER   PIC X(13)  VALUE    '410007 010445'.
               05  FILLER   PIC X(13)  VALUE    '410008 010445'.
               05  FILLER   PIC X(13)  VALUE    '410009 011322'.
               05  FILLER   PIC X(13)  VALUE    '410010 012200'.
               05  FILLER   PIC X(13)  VALUE    '410011 010445'.
               05  FILLER   PIC X(13)  VALUE    '410012 010445'.
               05  FILLER   PIC X(13)  VALUE    '410013 010445'.
               05  FILLER   PIC X(13)  VALUE    '420002 009422'.
               05  FILLER   PIC X(13)  VALUE    '420004 008778'.
               05  FILLER   PIC X(13)  VALUE    '420005 008048'.
               05  FILLER   PIC X(13)  VALUE    '420007 008889'.
               05  FILLER   PIC X(13)  VALUE    '420009 008284'.
               05  FILLER   PIC X(13)  VALUE    '420010 009298'.
               05  FILLER   PIC X(13)  VALUE    '420011 008889'.
               05  FILLER   PIC X(13)  VALUE    '420015 008889'.
               05  FILLER   PIC X(13)  VALUE    '420016 008048'.
               05  FILLER   PIC X(13)  VALUE    '420018 008557'.
               05  FILLER   PIC X(13)  VALUE    '420019 009422'.
               05  FILLER   PIC X(13)  VALUE    '420020 008778'.
               05  FILLER   PIC X(13)  VALUE    '420023 008889'.
               05  FILLER   PIC X(13)  VALUE    '420026 008557'.
               05  FILLER   PIC X(13)  VALUE    '420027 008889'.
               05  FILLER   PIC X(13)  VALUE    '420030 008778'.
               05  FILLER   PIC X(13)  VALUE    '420033 008889'.
               05  FILLER   PIC X(13)  VALUE    '420036 009422'.
               05  FILLER   PIC X(13)  VALUE    '420037 008889'.
               05  FILLER   PIC X(13)  VALUE    '420038 008048'.
               05  FILLER   PIC X(13)  VALUE    '420039 008406'.
               05  FILLER   PIC X(13)  VALUE    '420043 008172'.
               05  FILLER   PIC X(13)  VALUE    '420048 008382'.
               05  FILLER   PIC X(13)  VALUE    '420049 008336'.
               05  FILLER   PIC X(13)  VALUE    '420051 008048'.
               05  FILLER   PIC X(13)  VALUE    '420053 008223'.
               05  FILLER   PIC X(13)  VALUE    '420055 008048'.
               05  FILLER   PIC X(13)  VALUE    '420057 008048'.
               05  FILLER   PIC X(13)  VALUE    '420062 008048'.
               05  FILLER   PIC X(13)  VALUE    '420065 008778'.
               05  FILLER   PIC X(13)  VALUE    '420066 008048'.
               05  FILLER   PIC X(13)  VALUE    '420067 008048'.
               05  FILLER   PIC X(13)  VALUE    '420068 008778'.
               05  FILLER   PIC X(13)  VALUE    '420069 008048'.
               05  FILLER   PIC X(13)  VALUE    '420070 008223'.
               05  FILLER   PIC X(13)  VALUE    '420071 008889'.
               05  FILLER   PIC X(13)  VALUE    '420072 008048'.
               05  FILLER   PIC X(13)  VALUE    '420073 008382'.
               05  FILLER   PIC X(13)  VALUE    '420078 008889'.
               05  FILLER   PIC X(13)  VALUE    '420079 008778'.
               05  FILLER   PIC X(13)  VALUE    '420080 008048'.
               05  FILLER   PIC X(13)  VALUE    '420082 008690'.
               05  FILLER   PIC X(13)  VALUE    '420083 008889'.
               05  FILLER   PIC X(13)  VALUE    '420085 008336'.
               05  FILLER   PIC X(13)  VALUE    '420086 008382'.
               05  FILLER   PIC X(13)  VALUE    '420087 008778'.
               05  FILLER   PIC X(13)  VALUE    '420089 008778'.
               05  FILLER   PIC X(13)  VALUE    '420091 008048'.
               05  FILLER   PIC X(13)  VALUE    '420098 008098'.
               05  FILLER   PIC X(13)  VALUE    '420101 008059'.
               05  FILLER   PIC X(13)  VALUE    '420102 008889'.
               05  FILLER   PIC X(13)  VALUE    '420103 008889'.
               05  FILLER   PIC X(13)  VALUE    '420104 008778'.
               05  FILLER   PIC X(13)  VALUE    '420105 008336'.
               05  FILLER   PIC X(13)  VALUE    '420106 008382'.
               05  FILLER   PIC X(13)  VALUE    '420107 008048'.
               05  FILLER   PIC X(13)  VALUE    '420108 008406'.
               05  FILLER   PIC X(13)  VALUE    '420109 008048'.
               05  FILLER   PIC X(13)  VALUE    '430005 010000'.
               05  FILLER   PIC X(13)  VALUE    '430008 010000'.
               05  FILLER   PIC X(13)  VALUE    '430012 010000'.
               05  FILLER   PIC X(13)  VALUE    '430013 010000'.
               05  FILLER   PIC X(13)  VALUE    '430014 010000'.
               05  FILLER   PIC X(13)  VALUE    '430015 010000'.
               05  FILLER   PIC X(13)  VALUE    '430016 010000'.
               05  FILLER   PIC X(13)  VALUE    '430027 010000'.
               05  FILLER   PIC X(13)  VALUE    '430048 010000'.
               05  FILLER   PIC X(13)  VALUE    '430077 010000'.
               05  FILLER   PIC X(13)  VALUE    '430081 014448'.
               05  FILLER   PIC X(13)  VALUE    '430083 014448'.
               05  FILLER   PIC X(13)  VALUE    '430084 014448'.
               05  FILLER   PIC X(13)  VALUE    '430089 010000'.
               05  FILLER   PIC X(13)  VALUE    '430090 010000'.
               05  FILLER   PIC X(13)  VALUE    '430091 010000'.
               05  FILLER   PIC X(13)  VALUE    '430092 010000'.
               05  FILLER   PIC X(13)  VALUE    '430093 010000'.
               05  FILLER   PIC X(13)  VALUE    '430095 010000'.
               05  FILLER   PIC X(13)  VALUE    '430096 010000'.
               05  FILLER   PIC X(13)  VALUE    '430097 010000'.
               05  FILLER   PIC X(13)  VALUE    '440001 007101'.
               05  FILLER   PIC X(13)  VALUE    '440002 008421'.
               05  FILLER   PIC X(13)  VALUE    '440003 008799'.
               05  FILLER   PIC X(13)  VALUE    '440006 008799'.
               05  FILLER   PIC X(13)  VALUE    '440007 007305'.
               05  FILLER   PIC X(13)  VALUE    '440008 007265'.
               05  FILLER   PIC X(13)  VALUE    '440009 007101'.
               05  FILLER   PIC X(13)  VALUE    '440010 007101'.
               05  FILLER   PIC X(13)  VALUE    '440011 007850'.
               05  FILLER   PIC X(13)  VALUE    '440012 007364'.
               05  FILLER   PIC X(13)  VALUE    '440015 007175'.
               05  FILLER   PIC X(13)  VALUE    '440016 007174'.
               05  FILLER   PIC X(13)  VALUE    '440017 007364'.
               05  FILLER   PIC X(13)  VALUE    '440018 007101'.
               05  FILLER   PIC X(13)  VALUE    '440020 008577'.
               05  FILLER   PIC X(13)  VALUE    '440025 007101'.
               05  FILLER   PIC X(13)  VALUE    '440029 008799'.
               05  FILLER   PIC X(13)  VALUE    '440030 007101'.
               05  FILLER   PIC X(13)  VALUE    '440031 007175'.
               05  FILLER   PIC X(13)  VALUE    '440032 007101'.
               05  FILLER   PIC X(13)  VALUE    '440033 007965'.
               05  FILLER   PIC X(13)  VALUE    '440034 007175'.
               05  FILLER   PIC X(13)  VALUE    '440035 008577'.
               05  FILLER   PIC X(13)  VALUE    '440039 008799'.
               05  FILLER   PIC X(13)  VALUE    '440040 007101'.
               05  FILLER   PIC X(13)  VALUE    '440046 008799'.
               05  FILLER   PIC X(13)  VALUE    '440048 008713'.
               05  FILLER   PIC X(13)  VALUE    '440049 008713'.
               05  FILLER   PIC X(13)  VALUE    '440050 007101'.
               05  FILLER   PIC X(13)  VALUE    '440051 007125'.
               05  FILLER   PIC X(13)  VALUE    '440053 008799'.
               05  FILLER   PIC X(13)  VALUE    '440056 007175'.
               05  FILLER   PIC X(13)  VALUE    '440057 007101'.
               05  FILLER   PIC X(13)  VALUE    '440058 008331'.
               05  FILLER   PIC X(13)  VALUE    '440059 008577'.
               05  FILLER   PIC X(13)  VALUE    '440060 007275'.
               05  FILLER   PIC X(13)  VALUE    '440061 007167'.
               05  FILLER   PIC X(13)  VALUE    '440063 008463'.
               05  FILLER   PIC X(13)  VALUE    '440064 008519'.
               05  FILLER   PIC X(13)  VALUE    '440065 008799'.
               05  FILLER   PIC X(13)  VALUE    '440067 007175'.
               05  FILLER   PIC X(13)  VALUE    '440068 008331'.
               05  FILLER   PIC X(13)  VALUE    '440070 007101'.
               05  FILLER   PIC X(13)  VALUE    '440072 007101'.
               05  FILLER   PIC X(13)  VALUE    '440073 008799'.
               05  FILLER   PIC X(13)  VALUE    '440081 007101'.
               05  FILLER   PIC X(13)  VALUE    '440082 008799'.
               05  FILLER   PIC X(13)  VALUE    '440083 007965'.
               05  FILLER   PIC X(13)  VALUE    '440084 007101'.
               05  FILLER   PIC X(13)  VALUE    '440091 008519'.
               05  FILLER   PIC X(13)  VALUE    '440102 007101'.
               05  FILLER   PIC X(13)  VALUE    '440104 008519'.
               05  FILLER   PIC X(13)  VALUE    '440109 007101'.
               05  FILLER   PIC X(13)  VALUE    '440110 007175'.
               05  FILLER   PIC X(13)  VALUE    '440111 008799'.
               05  FILLER   PIC X(13)  VALUE    '440120 007175'.
               05  FILLER   PIC X(13)  VALUE    '440125 007175'.
               05  FILLER   PIC X(13)  VALUE    '440130 007965'.
               05  FILLER   PIC X(13)  VALUE    '440131 008713'.
               05  FILLER   PIC X(13)  VALUE    '440132 007101'.
               05  FILLER   PIC X(13)  VALUE    '440133 008799'.
               05  FILLER   PIC X(13)  VALUE    '440137 008577'.
               05  FILLER   PIC X(13)  VALUE    '440144 008577'.
               05  FILLER   PIC X(13)  VALUE    '440147 008713'.
               05  FILLER   PIC X(13)  VALUE    '440148 007101'.
               05  FILLER   PIC X(13)  VALUE    '440150 008799'.
               05  FILLER   PIC X(13)  VALUE    '440151 008577'.
               05  FILLER   PIC X(13)  VALUE    '440152 008713'.
               05  FILLER   PIC X(13)  VALUE    '440153 007101'.
               05  FILLER   PIC X(13)  VALUE    '440156 008519'.
               05  FILLER   PIC X(13)  VALUE    '440159 008713'.
               05  FILLER   PIC X(13)  VALUE    '440161 008799'.
               05  FILLER   PIC X(13)  VALUE    '440168 008713'.
               05  FILLER   PIC X(13)  VALUE    '440173 007175'.
               05  FILLER   PIC X(13)  VALUE    '440174 007785'.
               05  FILLER   PIC X(13)  VALUE    '440175 008165'.
               05  FILLER   PIC X(13)  VALUE    '440176 007116'.
               05  FILLER   PIC X(13)  VALUE    '440180 007175'.
               05  FILLER   PIC X(13)  VALUE    '440181 007576'.
               05  FILLER   PIC X(13)  VALUE    '440182 007174'.
               05  FILLER   PIC X(13)  VALUE    '440183 008713'.
               05  FILLER   PIC X(13)  VALUE    '440184 007101'.
               05  FILLER   PIC X(13)  VALUE    '440185 008331'.
               05  FILLER   PIC X(13)  VALUE    '440187 008577'.
               05  FILLER   PIC X(13)  VALUE    '440189 008421'.
               05  FILLER   PIC X(13)  VALUE    '440192 008577'.
               05  FILLER   PIC X(13)  VALUE    '440193 008799'.
               05  FILLER   PIC X(13)  VALUE    '440194 008799'.
               05  FILLER   PIC X(13)  VALUE    '440197 008799'.
               05  FILLER   PIC X(13)  VALUE    '440200 008799'.
               05  FILLER   PIC X(13)  VALUE    '440218 008799'.
               05  FILLER   PIC X(13)  VALUE    '440227 008799'.
               05  FILLER   PIC X(13)  VALUE    '440228 008713'.
               05  FILLER   PIC X(13)  VALUE    '440231 008799'.
               05  FILLER   PIC X(13)  VALUE    '440234 008713'.
               05  FILLER   PIC X(13)  VALUE    '440235 007101'.
               05  FILLER   PIC X(13)  VALUE    '450002 008106'.
               05  FILLER   PIC X(13)  VALUE    '450005 008878'.
               05  FILLER   PIC X(13)  VALUE    '450007 008538'.
               05  FILLER   PIC X(13)  VALUE    '450010 008643'.
               05  FILLER   PIC X(13)  VALUE    '450011 008106'.
               05  FILLER   PIC X(13)  VALUE    '450015 009736'.
               05  FILLER   PIC X(13)  VALUE    '450018 009754'.
               05  FILLER   PIC X(13)  VALUE    '450021 009736'.
               05  FILLER   PIC X(13)  VALUE    '450023 008106'.
               05  FILLER   PIC X(13)  VALUE    '450024 008106'.
               05  FILLER   PIC X(13)  VALUE    '450028 008760'.
               05  FILLER   PIC X(13)  VALUE    '450029 008840'.
               05  FILLER   PIC X(13)  VALUE    '450032 008106'.
               05  FILLER   PIC X(13)  VALUE    '450033 008760'.
               05  FILLER   PIC X(13)  VALUE    '450034 009754'.
               05  FILLER   PIC X(13)  VALUE    '450035 009754'.
               05  FILLER   PIC X(13)  VALUE    '450037 008106'.
               05  FILLER   PIC X(13)  VALUE    '450039 009736'.
               05  FILLER   PIC X(13)  VALUE    '450040 008597'.
               05  FILLER   PIC X(13)  VALUE    '450042 009510'.
               05  FILLER   PIC X(13)  VALUE    '450044 009736'.
               05  FILLER   PIC X(13)  VALUE    '450046 009170'.
               05  FILLER   PIC X(13)  VALUE    '450051 009736'.
               05  FILLER   PIC X(13)  VALUE    '450054 009701'.
               05  FILLER   PIC X(13)  VALUE    '450055 008138'.
               05  FILLER   PIC X(13)  VALUE    '450056 009417'.
               05  FILLER   PIC X(13)  VALUE    '450058 008538'.
               05  FILLER   PIC X(13)  VALUE    '450064 009736'.
               05  FILLER   PIC X(13)  VALUE    '450068 009754'.
               05  FILLER   PIC X(13)  VALUE    '450072 009754'.
               05  FILLER   PIC X(13)  VALUE    '450078 008106'.
               05  FILLER   PIC X(13)  VALUE    '450079 009736'.
               05  FILLER   PIC X(13)  VALUE    '450080 008106'.
               05  FILLER   PIC X(13)  VALUE    '450082 008296'.
               05  FILLER   PIC X(13)  VALUE    '450083 008244'.
               05  FILLER   PIC X(13)  VALUE    '450085 008106'.
               05  FILLER   PIC X(13)  VALUE    '450087 009736'.
               05  FILLER   PIC X(13)  VALUE    '450090 008810'.
               05  FILLER   PIC X(13)  VALUE    '450092 008106'.
               05  FILLER   PIC X(13)  VALUE    '450097 009754'.
               05  FILLER   PIC X(13)  VALUE    '450099 008106'.
               05  FILLER   PIC X(13)  VALUE    '450101 009510'.
               05  FILLER   PIC X(13)  VALUE    '450102 008244'.
               05  FILLER   PIC X(13)  VALUE    '450104 008538'.
               05  FILLER   PIC X(13)  VALUE    '450107 008566'.
               05  FILLER   PIC X(13)  VALUE    '450108 008538'.
               05  FILLER   PIC X(13)  VALUE    '450119 008760'.
               05  FILLER   PIC X(13)  VALUE    '450124 009417'.
               05  FILLER   PIC X(13)  VALUE    '450128 008224'.
               05  FILLER   PIC X(13)  VALUE    '450130 008538'.
               05  FILLER   PIC X(13)  VALUE    '450132 008969'.
               05  FILLER   PIC X(13)  VALUE    '450133 008969'.
               05  FILLER   PIC X(13)  VALUE    '450135 009736'.
               05  FILLER   PIC X(13)  VALUE    '450137 009736'.
               05  FILLER   PIC X(13)  VALUE    '450143 009417'.
               05  FILLER   PIC X(13)  VALUE    '450144 008969'.
               05  FILLER   PIC X(13)  VALUE    '450147 008725'.
               05  FILLER   PIC X(13)  VALUE    '450148 009736'.
               05  FILLER   PIC X(13)  VALUE    '450152 009701'.
               05  FILLER   PIC X(13)  VALUE    '450154 008106'.
               05  FILLER   PIC X(13)  VALUE    '450155 008106'.
               05  FILLER   PIC X(13)  VALUE    '450162 008597'.
               05  FILLER   PIC X(13)  VALUE    '450163 008267'.
               05  FILLER   PIC X(13)  VALUE    '450165 008538'.
               05  FILLER   PIC X(13)  VALUE    '450176 008224'.
               05  FILLER   PIC X(13)  VALUE    '450184 009754'.
               05  FILLER   PIC X(13)  VALUE    '450187 008106'.
               05  FILLER   PIC X(13)  VALUE    '450188 008106'.
               05  FILLER   PIC X(13)  VALUE    '450192 009592'.
               05  FILLER   PIC X(13)  VALUE    '450193 009754'.
               05  FILLER   PIC X(13)  VALUE    '450194 008106'.
               05  FILLER   PIC X(13)  VALUE    '450196 009736'.
               05  FILLER   PIC X(13)  VALUE    '450200 008803'.
               05  FILLER   PIC X(13)  VALUE    '450203 009592'.
               05  FILLER   PIC X(13)  VALUE    '450209 008597'.
               05  FILLER   PIC X(13)  VALUE    '450210 008291'.
               05  FILLER   PIC X(13)  VALUE    '450211 008106'.
               05  FILLER   PIC X(13)  VALUE    '450213 009250'.
               05  FILLER   PIC X(13)  VALUE    '450214 008106'.
               05  FILLER   PIC X(13)  VALUE    '450219 008106'.
               05  FILLER   PIC X(13)  VALUE    '450222 009754'.
               05  FILLER   PIC X(13)  VALUE    '450229 008247'.
               05  FILLER   PIC X(13)  VALUE    '450231 008154'.
               05  FILLER   PIC X(13)  VALUE    '450235 008106'.
               05  FILLER   PIC X(13)  VALUE    '450236 008414'.
               05  FILLER   PIC X(13)  VALUE    '450237 009250'.
               05  FILLER   PIC X(13)  VALUE    '450241 008106'.
               05  FILLER   PIC X(13)  VALUE    '450243 008106'.
               05  FILLER   PIC X(13)  VALUE    '450253 009754'.
               05  FILLER   PIC X(13)  VALUE    '450271 009592'.
               05  FILLER   PIC X(13)  VALUE    '450272 009417'.
               05  FILLER   PIC X(13)  VALUE    '450280 009736'.
               05  FILLER   PIC X(13)  VALUE    '450289 009754'.
               05  FILLER   PIC X(13)  VALUE    '450292 009736'.
               05  FILLER   PIC X(13)  VALUE    '450299 008491'.
               05  FILLER   PIC X(13)  VALUE    '450306 008247'.
               05  FILLER   PIC X(13)  VALUE    '450324 009736'.
               05  FILLER   PIC X(13)  VALUE    '450330 009754'.
               05  FILLER   PIC X(13)  VALUE    '450340 008106'.
               05  FILLER   PIC X(13)  VALUE    '450346 009754'.
               05  FILLER   PIC X(13)  VALUE    '450347 009754'.
               05  FILLER   PIC X(13)  VALUE    '450348 008106'.
               05  FILLER   PIC X(13)  VALUE    '450351 009592'.
               05  FILLER   PIC X(13)  VALUE    '450352 009736'.
               05  FILLER   PIC X(13)  VALUE    '450358 009754'.
               05  FILLER   PIC X(13)  VALUE    '450369 008106'.
               05  FILLER   PIC X(13)  VALUE    '450370 009754'.
               05  FILLER   PIC X(13)  VALUE    '450372 009736'.
               05  FILLER   PIC X(13)  VALUE    '450373 008106'.
               05  FILLER   PIC X(13)  VALUE    '450379 009736'.
               05  FILLER   PIC X(13)  VALUE    '450388 008538'.
               05  FILLER   PIC X(13)  VALUE    '450389 008244'.
               05  FILLER   PIC X(13)  VALUE    '450395 008106'.
               05  FILLER   PIC X(13)  VALUE    '450399 008106'.
               05  FILLER   PIC X(13)  VALUE    '450400 008491'.
               05  FILLER   PIC X(13)  VALUE    '450403 009736'.
               05  FILLER   PIC X(13)  VALUE    '450411 008106'.
               05  FILLER   PIC X(13)  VALUE    '450419 009736'.
               05  FILLER   PIC X(13)  VALUE    '450422 009736'.
               05  FILLER   PIC X(13)  VALUE    '450424 009754'.
               05  FILLER   PIC X(13)  VALUE    '450431 009417'.
               05  FILLER   PIC X(13)  VALUE    '450447 009736'.
               05  FILLER   PIC X(13)  VALUE    '450451 009592'.
               05  FILLER   PIC X(13)  VALUE    '450460 008210'.
               05  FILLER   PIC X(13)  VALUE    '450462 009736'.
               05  FILLER   PIC X(13)  VALUE    '450465 009754'.
               05  FILLER   PIC X(13)  VALUE    '450469 009736'.
               05  FILLER   PIC X(13)  VALUE    '450475 008106'.
               05  FILLER   PIC X(13)  VALUE    '450484 008106'.
               05  FILLER   PIC X(13)  VALUE    '450488 008106'.
               05  FILLER   PIC X(13)  VALUE    '450489 008106'.
               05  FILLER   PIC X(13)  VALUE    '450497 008106'.
               05  FILLER   PIC X(13)  VALUE    '450498 008106'.
               05  FILLER   PIC X(13)  VALUE    '450508 008106'.
               05  FILLER   PIC X(13)  VALUE    '450518 008878'.
               05  FILLER   PIC X(13)  VALUE    '450537 009736'.
               05  FILLER   PIC X(13)  VALUE    '450539 008205'.
               05  FILLER   PIC X(13)  VALUE    '450558 008247'.
               05  FILLER   PIC X(13)  VALUE    '450563 009736'.
               05  FILLER   PIC X(13)  VALUE    '450565 008656'.
               05  FILLER   PIC X(13)  VALUE    '450571 008106'.
               05  FILLER   PIC X(13)  VALUE    '450573 008548'.
               05  FILLER   PIC X(13)  VALUE    '450578 008106'.
               05  FILLER   PIC X(13)  VALUE    '450580 008106'.
               05  FILLER   PIC X(13)  VALUE    '450584 008106'.
               05  FILLER   PIC X(13)  VALUE    '450586 008106'.
               05  FILLER   PIC X(13)  VALUE    '450587 008106'.
               05  FILLER   PIC X(13)  VALUE    '450591 009754'.
               05  FILLER   PIC X(13)  VALUE    '450596 009592'.
               05  FILLER   PIC X(13)  VALUE    '450597 008240'.
               05  FILLER   PIC X(13)  VALUE    '450604 008538'.
               05  FILLER   PIC X(13)  VALUE    '450605 009170'.
               05  FILLER   PIC X(13)  VALUE    '450610 009754'.
               05  FILLER   PIC X(13)  VALUE    '450617 009754'.
               05  FILLER   PIC X(13)  VALUE    '450634 009736'.
               05  FILLER   PIC X(13)  VALUE    '450638 009754'.
               05  FILLER   PIC X(13)  VALUE    '450639 009736'.
               05  FILLER   PIC X(13)  VALUE    '450641 008680'.
               05  FILLER   PIC X(13)  VALUE    '450643 008106'.
               05  FILLER   PIC X(13)  VALUE    '450644 009754'.
               05  FILLER   PIC X(13)  VALUE    '450647 009736'.
               05  FILLER   PIC X(13)  VALUE    '450651 009736'.
               05  FILLER   PIC X(13)  VALUE    '450653 008918'.
               05  FILLER   PIC X(13)  VALUE    '450654 008106'.
               05  FILLER   PIC X(13)  VALUE    '450656 008106'.
               05  FILLER   PIC X(13)  VALUE    '450658 008106'.
               05  FILLER   PIC X(13)  VALUE    '450659 009754'.
               05  FILLER   PIC X(13)  VALUE    '450661 008969'.
               05  FILLER   PIC X(13)  VALUE    '450662 008760'.
               05  FILLER   PIC X(13)  VALUE    '450668 008106'.
               05  FILLER   PIC X(13)  VALUE    '450669 009736'.
               05  FILLER   PIC X(13)  VALUE    '450670 009754'.
               05  FILLER   PIC X(13)  VALUE    '450672 009736'.
               05  FILLER   PIC X(13)  VALUE    '450674 009754'.
               05  FILLER   PIC X(13)  VALUE    '450675 009736'.
               05  FILLER   PIC X(13)  VALUE    '450677 009736'.
               05  FILLER   PIC X(13)  VALUE    '450678 009736'.
               05  FILLER   PIC X(13)  VALUE    '450684 009754'.
               05  FILLER   PIC X(13)  VALUE    '450686 008597'.
               05  FILLER   PIC X(13)  VALUE    '450688 009736'.
               05  FILLER   PIC X(13)  VALUE    '450690 008244'.
               05  FILLER   PIC X(13)  VALUE    '450694 008106'.
               05  FILLER   PIC X(13)  VALUE    '450697 008538'.
               05  FILLER   PIC X(13)  VALUE    '450698 008106'.
               05  FILLER   PIC X(13)  VALUE    '450702 008106'.
               05  FILLER   PIC X(13)  VALUE    '450709 009754'.
               05  FILLER   PIC X(13)  VALUE    '450711 008760'.
               05  FILLER   PIC X(13)  VALUE    '450713 009417'.
               05  FILLER   PIC X(13)  VALUE    '450716 009754'.
               05  FILLER   PIC X(13)  VALUE    '450718 009417'.
               05  FILLER   PIC X(13)  VALUE    '450723 009736'.
               05  FILLER   PIC X(13)  VALUE    '450730 009736'.
               05  FILLER   PIC X(13)  VALUE    '450742 009736'.
               05  FILLER   PIC X(13)  VALUE    '450743 009736'.
               05  FILLER   PIC X(13)  VALUE    '450746 008106'.
               05  FILLER   PIC X(13)  VALUE    '450747 008244'.
               05  FILLER   PIC X(13)  VALUE    '450749 008106'.
               05  FILLER   PIC X(13)  VALUE    '450755 008106'.
               05  FILLER   PIC X(13)  VALUE    '450766 009736'.
               05  FILLER   PIC X(13)  VALUE    '450771 009736'.
               05  FILLER   PIC X(13)  VALUE    '450774 009754'.
               05  FILLER   PIC X(13)  VALUE    '450775 009754'.
               05  FILLER   PIC X(13)  VALUE    '450779 009736'.
               05  FILLER   PIC X(13)  VALUE    '450780 008538'.
               05  FILLER   PIC X(13)  VALUE    '450788 009170'.
               05  FILLER   PIC X(13)  VALUE    '450796 008154'.
               05  FILLER   PIC X(13)  VALUE    '450797 009754'.
               05  FILLER   PIC X(13)  VALUE    '450801 008803'.
               05  FILLER   PIC X(13)  VALUE    '450803 009754'.
               05  FILLER   PIC X(13)  VALUE    '450804 009754'.
               05  FILLER   PIC X(13)  VALUE    '450808 009417'.
               05  FILLER   PIC X(13)  VALUE    '450809 009417'.
               05  FILLER   PIC X(13)  VALUE    '450820 009754'.
               05  FILLER   PIC X(13)  VALUE    '450822 009736'.
               05  FILLER   PIC X(13)  VALUE    '450825 008224'.
               05  FILLER   PIC X(13)  VALUE    '450827 008643'.
               05  FILLER   PIC X(13)  VALUE    '450828 008106'.
               05  FILLER   PIC X(13)  VALUE    '450831 009754'.
               05  FILLER   PIC X(13)  VALUE    '450832 009754'.
               05  FILLER   PIC X(13)  VALUE    '450833 009736'.
               05  FILLER   PIC X(13)  VALUE    '450834 008491'.
               05  FILLER   PIC X(13)  VALUE    '450840 009736'.
               05  FILLER   PIC X(13)  VALUE    '450844 009754'.
               05  FILLER   PIC X(13)  VALUE    '450845 008566'.
               05  FILLER   PIC X(13)  VALUE    '450847 009754'.
               05  FILLER   PIC X(13)  VALUE    '450848 009754'.
               05  FILLER   PIC X(13)  VALUE    '450851 009736'.
               05  FILLER   PIC X(13)  VALUE    '450853 009736'.
               05  FILLER   PIC X(13)  VALUE    '450855 008760'.
               05  FILLER   PIC X(13)  VALUE    '450856 008538'.
               05  FILLER   PIC X(13)  VALUE    '450860 009754'.
               05  FILLER   PIC X(13)  VALUE    '450862 009754'.
               05  FILLER   PIC X(13)  VALUE    '450864 008244'.
               05  FILLER   PIC X(13)  VALUE    '450865 009417'.
               05  FILLER   PIC X(13)  VALUE    '450867 009417'.
               05  FILLER   PIC X(13)  VALUE    '450869 008224'.
               05  FILLER   PIC X(13)  VALUE    '450871 009417'.
               05  FILLER   PIC X(13)  VALUE    '450872 009736'.
               05  FILLER   PIC X(13)  VALUE    '450874 009736'.
               05  FILLER   PIC X(13)  VALUE    '450875 008154'.
               05  FILLER   PIC X(13)  VALUE    '450876 008597'.
               05  FILLER   PIC X(13)  VALUE    '450877 008106'.
               05  FILLER   PIC X(13)  VALUE    '450880 009736'.
               05  FILLER   PIC X(13)  VALUE    '450883 009736'.
               05  FILLER   PIC X(13)  VALUE    '450884 008106'.
               05  FILLER   PIC X(13)  VALUE    '450885 009736'.
               05  FILLER   PIC X(13)  VALUE    '450888 009736'.
               05  FILLER   PIC X(13)  VALUE    '450889 009736'.
               05  FILLER   PIC X(13)  VALUE    '450890 009736'.
               05  FILLER   PIC X(13)  VALUE    '450891 009736'.
               05  FILLER   PIC X(13)  VALUE    '450893 009736'.
               05  FILLER   PIC X(13)  VALUE    '450894 009736'.
               05  FILLER   PIC X(13)  VALUE    '46B051 009326'.
               05  FILLER   PIC X(13)  VALUE    '460001 009527'.
               05  FILLER   PIC X(13)  VALUE    '460003 009693'.
               05  FILLER   PIC X(13)  VALUE    '460004 009527'.
               05  FILLER   PIC X(13)  VALUE    '460005 009527'.
               05  FILLER   PIC X(13)  VALUE    '460006 009693'.
               05  FILLER   PIC X(13)  VALUE    '460007 008738'.
               05  FILLER   PIC X(13)  VALUE    '460009 009693'.
               05  FILLER   PIC X(13)  VALUE    '460010 009693'.
               05  FILLER   PIC X(13)  VALUE    '460011 008738'.
               05  FILLER   PIC X(13)  VALUE    '460013 009527'.
               05  FILLER   PIC X(13)  VALUE    '460014 009693'.
               05  FILLER   PIC X(13)  VALUE    '460015 009095'.
               05  FILLER   PIC X(13)  VALUE    '460017 009527'.
               05  FILLER   PIC X(13)  VALUE    '460019 008738'.
               05  FILLER   PIC X(13)  VALUE    '460021 009434'.
               05  FILLER   PIC X(13)  VALUE    '460023 009527'.
               05  FILLER   PIC X(13)  VALUE    '460026 009255'.
               05  FILLER   PIC X(13)  VALUE    '460030 008738'.
               05  FILLER   PIC X(13)  VALUE    '460039 009527'.
               05  FILLER   PIC X(13)  VALUE    '460041 009527'.
               05  FILLER   PIC X(13)  VALUE    '460042 009527'.
               05  FILLER   PIC X(13)  VALUE    '460043 009527'.
               05  FILLER   PIC X(13)  VALUE    '460044 009693'.
               05  FILLER   PIC X(13)  VALUE    '460047 009693'.
               05  FILLER   PIC X(13)  VALUE    '460049 009693'.
               05  FILLER   PIC X(13)  VALUE    '460051 009693'.
               05  FILLER   PIC X(13)  VALUE    '460052 009527'.
               05  FILLER   PIC X(13)  VALUE    '460054 008822'.
               05  FILLER   PIC X(13)  VALUE    '460057 009527'.
               05  FILLER   PIC X(13)  VALUE    '460058 009693'.
               05  FILLER   PIC X(13)  VALUE    '460060 009693'.
               05  FILLER   PIC X(13)  VALUE    '470001 010474'.
               05  FILLER   PIC X(13)  VALUE    '470003 010175'.
               05  FILLER   PIC X(13)  VALUE    '470005 009825'.
               05  FILLER   PIC X(13)  VALUE    '470011 010219'.
               05  FILLER   PIC X(13)  VALUE    '470012 010560'.
               05  FILLER   PIC X(13)  VALUE    '470024 010175'.
               05  FILLER   PIC X(13)  VALUE    '490001 007575'.
               05  FILLER   PIC X(13)  VALUE    '490002 007575'.
               05  FILLER   PIC X(13)  VALUE    '490004 008969'.
               05  FILLER   PIC X(13)  VALUE    '490005 009998'.
               05  FILLER   PIC X(13)  VALUE    '490007 008852'.
               05  FILLER   PIC X(13)  VALUE    '490009 009097'.
               05  FILLER   PIC X(13)  VALUE    '490011 008852'.
               05  FILLER   PIC X(13)  VALUE    '490013 008361'.
               05  FILLER   PIC X(13)  VALUE    '490017 008852'.
               05  FILLER   PIC X(13)  VALUE    '490018 008969'.
               05  FILLER   PIC X(13)  VALUE    '490019 009998'.
               05  FILLER   PIC X(13)  VALUE    '490020 009065'.
               05  FILLER   PIC X(13)  VALUE    '490021 008969'.
               05  FILLER   PIC X(13)  VALUE    '490022 009998'.
               05  FILLER   PIC X(13)  VALUE    '490023 009998'.
               05  FILLER   PIC X(13)  VALUE    '490024 008411'.
               05  FILLER   PIC X(13)  VALUE    '490032 009065'.
               05  FILLER   PIC X(13)  VALUE    '490033 009998'.
               05  FILLER   PIC X(13)  VALUE    '490037 009142'.
               05  FILLER   PIC X(13)  VALUE    '490038 007575'.
               05  FILLER   PIC X(13)  VALUE    '490040 009998'.
               05  FILLER   PIC X(13)  VALUE    '490041 008852'.
               05  FILLER   PIC X(13)  VALUE    '490042 008295'.
               05  FILLER   PIC X(13)  VALUE    '490043 009998'.
               05  FILLER   PIC X(13)  VALUE    '490044 008852'.
               05  FILLER   PIC X(13)  VALUE    '490045 009998'.
               05  FILLER   PIC X(13)  VALUE    '490046 008852'.
               05  FILLER   PIC X(13)  VALUE    '490048 008411'.
               05  FILLER   PIC X(13)  VALUE    '490050 009998'.
               05  FILLER   PIC X(13)  VALUE    '490052 008852'.
               05  FILLER   PIC X(13)  VALUE    '490053 007575'.
               05  FILLER   PIC X(13)  VALUE    '490057 008852'.
               05  FILLER   PIC X(13)  VALUE    '490059 009065'.
               05  FILLER   PIC X(13)  VALUE    '490060 007575'.
               05  FILLER   PIC X(13)  VALUE    '490063 009998'.
               05  FILLER   PIC X(13)  VALUE    '490066 009065'.
               05  FILLER   PIC X(13)  VALUE    '490067 009065'.
               05  FILLER   PIC X(13)  VALUE    '490069 009065'.
               05  FILLER   PIC X(13)  VALUE    '490075 008310'.
               05  FILLER   PIC X(13)  VALUE    '490077 009097'.
               05  FILLER   PIC X(13)  VALUE    '490079 007575'.
               05  FILLER   PIC X(13)  VALUE    '490084 009065'.
               05  FILLER   PIC X(13)  VALUE    '490088 008499'.
               05  FILLER   PIC X(13)  VALUE    '490089 008411'.
               05  FILLER   PIC X(13)  VALUE    '490090 009065'.
               05  FILLER   PIC X(13)  VALUE    '490092 007575'.
               05  FILLER   PIC X(13)  VALUE    '490093 008852'.
               05  FILLER   PIC X(13)  VALUE    '490094 009065'.
               05  FILLER   PIC X(13)  VALUE    '490097 009065'.
               05  FILLER   PIC X(13)  VALUE    '490098 007575'.
               05  FILLER   PIC X(13)  VALUE    '490101 009998'.
               05  FILLER   PIC X(13)  VALUE    '490104 009065'.
               05  FILLER   PIC X(13)  VALUE    '490106 009300'.
               05  FILLER   PIC X(13)  VALUE    '490107 009998'.
               05  FILLER   PIC X(13)  VALUE    '490110 008498'.
               05  FILLER   PIC X(13)  VALUE    '490111 007575'.
               05  FILLER   PIC X(13)  VALUE    '490112 009065'.
               05  FILLER   PIC X(13)  VALUE    '490113 009998'.
               05  FILLER   PIC X(13)  VALUE    '490114 007575'.
               05  FILLER   PIC X(13)  VALUE    '490115 007575'.
               05  FILLER   PIC X(13)  VALUE    '490116 007575'.
               05  FILLER   PIC X(13)  VALUE    '490117 007575'.
               05  FILLER   PIC X(13)  VALUE    '490118 009065'.
               05  FILLER   PIC X(13)  VALUE    '490119 008852'.
               05  FILLER   PIC X(13)  VALUE    '490120 008852'.
               05  FILLER   PIC X(13)  VALUE    '490122 009998'.
               05  FILLER   PIC X(13)  VALUE    '490126 008310'.
               05  FILLER   PIC X(13)  VALUE    '490127 007575'.
               05  FILLER   PIC X(13)  VALUE    '490130 008852'.
               05  FILLER   PIC X(13)  VALUE    '490134 007575'.
               05  FILLER   PIC X(13)  VALUE    '490135 008411'.
               05  FILLER   PIC X(13)  VALUE    '490136 009065'.
               05  FILLER   PIC X(13)  VALUE    '490140 009998'.
               05  FILLER   PIC X(13)  VALUE    '490141 009998'.
               05  FILLER   PIC X(13)  VALUE    '490143 008852'.
               05  FILLER   PIC X(13)  VALUE    '490144 009998'.
               05  FILLER   PIC X(13)  VALUE    '490145 009998'.
               05  FILLER   PIC X(13)  VALUE    '500001 011612'.
               05  FILLER   PIC X(13)  VALUE    '500002 010389'.
               05  FILLER   PIC X(13)  VALUE    '500003 011493'.
               05  FILLER   PIC X(13)  VALUE    '500005 011612'.
               05  FILLER   PIC X(13)  VALUE    '500007 011493'.
               05  FILLER   PIC X(13)  VALUE    '500008 011612'.
               05  FILLER   PIC X(13)  VALUE    '500011 011612'.
               05  FILLER   PIC X(13)  VALUE    '500012 010314'.
               05  FILLER   PIC X(13)  VALUE    '500014 011612'.
               05  FILLER   PIC X(13)  VALUE    '500015 011612'.
               05  FILLER   PIC X(13)  VALUE    '500016 011493'.
               05  FILLER   PIC X(13)  VALUE    '500019 011687'.
               05  FILLER   PIC X(13)  VALUE    '500021 011687'.
               05  FILLER   PIC X(13)  VALUE    '500024 011687'.
               05  FILLER   PIC X(13)  VALUE    '500025 011612'.
               05  FILLER   PIC X(13)  VALUE    '500026 011612'.
               05  FILLER   PIC X(13)  VALUE    '500027 011612'.
               05  FILLER   PIC X(13)  VALUE    '500030 012073'.
               05  FILLER   PIC X(13)  VALUE    '500031 011309'.
               05  FILLER   PIC X(13)  VALUE    '500033 010314'.
               05  FILLER   PIC X(13)  VALUE    '500036 010314'.
               05  FILLER   PIC X(13)  VALUE    '500037 010314'.
               05  FILLER   PIC X(13)  VALUE    '500039 011687'.
               05  FILLER   PIC X(13)  VALUE    '500041 010314'.
               05  FILLER   PIC X(13)  VALUE    '500044 011133'.
               05  FILLER   PIC X(13)  VALUE    '500049 010389'.
               05  FILLER   PIC X(13)  VALUE    '500050 011888'.
               05  FILLER   PIC X(13)  VALUE    '500051 011612'.
               05  FILLER   PIC X(13)  VALUE    '500052 011612'.
               05  FILLER   PIC X(13)  VALUE    '500053 010427'.
               05  FILLER   PIC X(13)  VALUE    '500054 011133'.
               05  FILLER   PIC X(13)  VALUE    '500058 010427'.
               05  FILLER   PIC X(13)  VALUE    '500060 011612'.
               05  FILLER   PIC X(13)  VALUE    '500064 011612'.
               05  FILLER   PIC X(13)  VALUE    '500072 010368'.
               05  FILLER   PIC X(13)  VALUE    '500077 011133'.
               05  FILLER   PIC X(13)  VALUE    '500079 011687'.
               05  FILLER   PIC X(13)  VALUE    '500084 011612'.
               05  FILLER   PIC X(13)  VALUE    '500088 011687'.
               05  FILLER   PIC X(13)  VALUE    '500108 011687'.
               05  FILLER   PIC X(13)  VALUE    '500119 011133'.
               05  FILLER   PIC X(13)  VALUE    '500124 011612'.
               05  FILLER   PIC X(13)  VALUE    '500129 011687'.
               05  FILLER   PIC X(13)  VALUE    '500139 011687'.
               05  FILLER   PIC X(13)  VALUE    '500141 011612'.
               05  FILLER   PIC X(13)  VALUE    '500148 010314'.
               05  FILLER   PIC X(13)  VALUE    '500150 011888'.
               05  FILLER   PIC X(13)  VALUE    '500151 011687'.
               05  FILLER   PIC X(13)  VALUE    '500152 011612'.
               05  FILLER   PIC X(13)  VALUE    '500154 011612'.
               05  FILLER   PIC X(13)  VALUE    '51B022 008369'.
               05  FILLER   PIC X(13)  VALUE    '510001 008272'.
               05  FILLER   PIC X(13)  VALUE    '510002 008310'.
               05  FILLER   PIC X(13)  VALUE    '510006 008252'.
               05  FILLER   PIC X(13)  VALUE    '510007 008369'.
               05  FILLER   PIC X(13)  VALUE    '510008 009998'.
               05  FILLER   PIC X(13)  VALUE    '510012 007650'.
               05  FILLER   PIC X(13)  VALUE    '510013 007335'.
               05  FILLER   PIC X(13)  VALUE    '510022 008436'.
               05  FILLER   PIC X(13)  VALUE    '510023 008272'.
               05  FILLER   PIC X(13)  VALUE    '510024 008272'.
               05  FILLER   PIC X(13)  VALUE    '510029 008436'.
               05  FILLER   PIC X(13)  VALUE    '510030 007335'.
               05  FILLER   PIC X(13)  VALUE    '510031 008436'.
               05  FILLER   PIC X(13)  VALUE    '510038 007335'.
               05  FILLER   PIC X(13)  VALUE    '510039 007335'.
               05  FILLER   PIC X(13)  VALUE    '510046 007801'.
               05  FILLER   PIC X(13)  VALUE    '510047 008272'.
               05  FILLER   PIC X(13)  VALUE    '510048 007335'.
               05  FILLER   PIC X(13)  VALUE    '510050 008272'.
               05  FILLER   PIC X(13)  VALUE    '510055 008369'.
               05  FILLER   PIC X(13)  VALUE    '510058 007993'.
               05  FILLER   PIC X(13)  VALUE    '510059 008436'.
               05  FILLER   PIC X(13)  VALUE    '510062 008003'.
               05  FILLER   PIC X(13)  VALUE    '510070 008336'.
               05  FILLER   PIC X(13)  VALUE    '510071 007801'.
               05  FILLER   PIC X(13)  VALUE    '510072 007335'.
               05  FILLER   PIC X(13)  VALUE    '510077 007675'.
               05  FILLER   PIC X(13)  VALUE    '510082 007335'.
               05  FILLER   PIC X(13)  VALUE    '510085 008369'.
               05  FILLER   PIC X(13)  VALUE    '510086 007335'.
               05  FILLER   PIC X(13)  VALUE    '510091 008436'.
               05  FILLER   PIC X(13)  VALUE    '520002 009221'.
               05  FILLER   PIC X(13)  VALUE    '520004 010480'.
               05  FILLER   PIC X(13)  VALUE    '520008 009734'.
               05  FILLER   PIC X(13)  VALUE    '520009 009335'.
               05  FILLER   PIC X(13)  VALUE    '520011 009683'.
               05  FILLER   PIC X(13)  VALUE    '520013 010770'.
               05  FILLER   PIC X(13)  VALUE    '520017 009683'.
               05  FILLER   PIC X(13)  VALUE    '520019 009221'.
               05  FILLER   PIC X(13)  VALUE    '520021 010427'.
               05  FILLER   PIC X(13)  VALUE    '520027 009734'.
               05  FILLER   PIC X(13)  VALUE    '520028 010694'.
               05  FILLER   PIC X(13)  VALUE    '520030 009221'.
               05  FILLER   PIC X(13)  VALUE    '520033 009221'.
               05  FILLER   PIC X(13)  VALUE    '520034 009221'.
               05  FILLER   PIC X(13)  VALUE    '520035 009734'.
               05  FILLER   PIC X(13)  VALUE    '520037 009221'.
               05  FILLER   PIC X(13)  VALUE    '520038 009734'.
               05  FILLER   PIC X(13)  VALUE    '520041 010694'.
               05  FILLER   PIC X(13)  VALUE    '520044 009437'.
               05  FILLER   PIC X(13)  VALUE    '520045 009324'.
               05  FILLER   PIC X(13)  VALUE    '520048 009324'.
               05  FILLER   PIC X(13)  VALUE    '520049 009221'.
               05  FILLER   PIC X(13)  VALUE    '520051 010427'.
               05  FILLER   PIC X(13)  VALUE    '520057 010568'.
               05  FILLER   PIC X(13)  VALUE    '520059 009533'.
               05  FILLER   PIC X(13)  VALUE    '520062 009734'.
               05  FILLER   PIC X(13)  VALUE    '520063 009734'.
               05  FILLER   PIC X(13)  VALUE    '520066 009615'.
               05  FILLER   PIC X(13)  VALUE    '520070 010770'.
               05  FILLER   PIC X(13)  VALUE    '520071 009734'.
               05  FILLER   PIC X(13)  VALUE    '520075 009335'.
               05  FILLER   PIC X(13)  VALUE    '520076 009526'.
               05  FILLER   PIC X(13)  VALUE    '520078 009734'.
               05  FILLER   PIC X(13)  VALUE    '520083 010694'.
               05  FILLER   PIC X(13)  VALUE    '520087 009416'.
               05  FILLER   PIC X(13)  VALUE    '520088 009734'.
               05  FILLER   PIC X(13)  VALUE    '520089 010694'.
               05  FILLER   PIC X(13)  VALUE    '520091 009221'.
               05  FILLER   PIC X(13)  VALUE    '520095 010568'.
               05  FILLER   PIC X(13)  VALUE    '520096 010263'.
               05  FILLER   PIC X(13)  VALUE    '520097 009221'.
               05  FILLER   PIC X(13)  VALUE    '520098 010694'.
               05  FILLER   PIC X(13)  VALUE    '520100 010568'.
               05  FILLER   PIC X(13)  VALUE    '520102 010427'.
               05  FILLER   PIC X(13)  VALUE    '520103 009734'.
               05  FILLER   PIC X(13)  VALUE    '520107 009335'.
               05  FILLER   PIC X(13)  VALUE    '520109 009221'.
               05  FILLER   PIC X(13)  VALUE    '520113 009221'.
               05  FILLER   PIC X(13)  VALUE    '520116 009734'.
               05  FILLER   PIC X(13)  VALUE    '520136 009734'.
               05  FILLER   PIC X(13)  VALUE    '520138 010427'.
               05  FILLER   PIC X(13)  VALUE    '520139 009734'.
               05  FILLER   PIC X(13)  VALUE    '520160 009335'.
               05  FILLER   PIC X(13)  VALUE    '520177 010427'.
               05  FILLER   PIC X(13)  VALUE    '520189 010427'.
               05  FILLER   PIC X(13)  VALUE    '520193 009335'.
               05  FILLER   PIC X(13)  VALUE    '520194 009734'.
               05  FILLER   PIC X(13)  VALUE    '520195 009734'.
               05  FILLER   PIC X(13)  VALUE    '520196 009683'.
               05  FILLER   PIC X(13)  VALUE    '520198 009324'.
               05  FILLER   PIC X(13)  VALUE    '520202 009335'.
               05  FILLER   PIC X(13)  VALUE    '520204 009734'.
               05  FILLER   PIC X(13)  VALUE    '520205 009734'.
               05  FILLER   PIC X(13)  VALUE    '520206 009734'.
               05  FILLER   PIC X(13)  VALUE    '520207 009734'.
               05  FILLER   PIC X(13)  VALUE    '520208 010568'.
               05  FILLER   PIC X(13)  VALUE    '530002 010000'.
               05  FILLER   PIC X(13)  VALUE    '530006 010000'.
               05  FILLER   PIC X(13)  VALUE    '530008 010000'.
               05  FILLER   PIC X(13)  VALUE    '530010 010000'.
               05  FILLER   PIC X(13)  VALUE    '530011 010000'.
               05  FILLER   PIC X(13)  VALUE    '530012 010000'.
               05  FILLER   PIC X(13)  VALUE    '530014 010000'.
               05  FILLER   PIC X(13)  VALUE    '530015 010000'.
               05  FILLER   PIC X(13)  VALUE    '530025 010000'.
               05  FILLER   PIC X(13)  VALUE    '530032 010000'.
               05  FILLER   PIC X(13)  VALUE    '530033 010000'.
               05  FILLER   PIC X(13)  VALUE    '67B062 009681'.
               05  FILLER   PIC X(13)  VALUE    '670002 009736'.
               05  FILLER   PIC X(13)  VALUE    '670004 008106'.
               05  FILLER   PIC X(13)  VALUE    '670005 009754'.
               05  FILLER   PIC X(13)  VALUE    '670006 009417'.
               05  FILLER   PIC X(13)  VALUE    '670008 009754'.
               05  FILLER   PIC X(13)  VALUE    '670010 009736'.
               05  FILLER   PIC X(13)  VALUE    '670012 009754'.
               05  FILLER   PIC X(13)  VALUE    '670019 009754'.
               05  FILLER   PIC X(13)  VALUE    '670023 009736'.
               05  FILLER   PIC X(13)  VALUE    '670024 009754'.
               05  FILLER   PIC X(13)  VALUE    '670025 009736'.
               05  FILLER   PIC X(13)  VALUE    '670029 009754'.
               05  FILLER   PIC X(13)  VALUE    '670031 009754'.
               05  FILLER   PIC X(13)  VALUE    '670034 009417'.
               05  FILLER   PIC X(13)  VALUE    '670041 009417'.
               05  FILLER   PIC X(13)  VALUE    '670043 009417'.
               05  FILLER   PIC X(13)  VALUE    '670044 009736'.
               05  FILLER   PIC X(13)  VALUE    '670045 009736'.
               05  FILLER   PIC X(13)  VALUE    '670046 009736'.
               05  FILLER   PIC X(13)  VALUE    '670047 008106'.
               05  FILLER   PIC X(13)  VALUE    '670049 009736'.
               05  FILLER   PIC X(13)  VALUE    '670050 008597'.
               05  FILLER   PIC X(13)  VALUE    '670053 009754'.
               05  FILLER   PIC X(13)  VALUE    '670054 008538'.
               05  FILLER   PIC X(13)  VALUE    '670055 008538'.
               05  FILLER   PIC X(13)  VALUE    '670056 009417'.
               05  FILLER   PIC X(13)  VALUE    '670058 009754'.
               05  FILLER   PIC X(13)  VALUE    '670059 009754'.
               05  FILLER   PIC X(13)  VALUE    '670060 009736'.
               05  FILLER   PIC X(13)  VALUE    '670061 009170'.
               05  FILLER   PIC X(13)  VALUE    '670062 009736'.
               05  FILLER   PIC X(13)  VALUE    '670066 008969'.
               05  FILLER   PIC X(13)  VALUE    '670067 009736'.
               05  FILLER   PIC X(13)  VALUE    '670068 009736'.
               05  FILLER   PIC X(13)  VALUE    '670069 009736'.
               05  FILLER   PIC X(13)  VALUE    '670071 009736'.
               05  FILLER   PIC X(13)  VALUE    '670072 009754'.
               05  FILLER   PIC X(13)  VALUE    '670073 009736'.
               05  FILLER   PIC X(13)  VALUE    '670075 009754'.
               05  FILLER   PIC X(13)  VALUE    '670076 009736'.
               05  FILLER   PIC X(13)  VALUE    '670077 009754'.
               05  FILLER   PIC X(13)  VALUE    '670078 008538'.
               05  FILLER   PIC X(13)  VALUE    '670079 009417'.
               05  FILLER   PIC X(13)  VALUE    '670080 009701'.
               05  FILLER   PIC X(13)  VALUE    '670082 009736'.
               05  FILLER   PIC X(13)  VALUE    '670083 009736'.
               05  FILLER   PIC X(13)  VALUE    '670085 009736'.
               05  FILLER   PIC X(13)  VALUE    '670087 009417'.
               05  FILLER   PIC X(13)  VALUE    '670088 008491'.
               05  FILLER   PIC X(13)  VALUE    '670089 008106'.
               05  FILLER   PIC X(13)  VALUE    '670090 009736'.
               05  FILLER   PIC X(13)  VALUE    '670091 008927'.
               05  FILLER   PIC X(13)  VALUE    '670092 009736'.
               05  FILLER   PIC X(13)  VALUE    '670093 009754'.
               05  FILLER   PIC X(13)  VALUE    '670094 009250'.
               05  FILLER   PIC X(13)  VALUE    '670095 009754'.
               05  FILLER   PIC X(13)  VALUE    '670096 009754'.
               05  FILLER   PIC X(13)  VALUE    '670097 009736'.
               05  FILLER   PIC X(13)  VALUE    '670098 008672'.
               05  FILLER   PIC X(13)  VALUE    '670099 009754'.
               05  FILLER   PIC X(13)  VALUE    '670100 009736'.
               05  FILLER   PIC X(13)  VALUE    '670101 009736'.
               05  FILLER   PIC X(13)  VALUE    '670102 009754'.
               05  FILLER   PIC X(13)  VALUE    '670103 009736'.
               05  FILLER   PIC X(13)  VALUE    '670106 009754'.
               05  FILLER   PIC X(13)  VALUE    '670107 009736'.
               05  FILLER   PIC X(13)  VALUE    '670108 008289'.
               05  FILLER   PIC X(13)  VALUE    '670109 009754'.
               05  FILLER   PIC X(13)  VALUE    '670110 009736'.
               05  FILLER   PIC X(13)  VALUE    '670111 008969'.
               05  FILLER   PIC X(13)  VALUE    '670112 008538'.
               05  FILLER   PIC X(13)  VALUE    '670114 008106'.
               05  FILLER   PIC X(13)  VALUE    '670115 009754'.
               05  FILLER   PIC X(13)  VALUE    '670116 009681'.
               05  FILLER   PIC X(13)  VALUE    '670117 009736'.
               05  FILLER   PIC X(13)  VALUE    '670118 009754'.
               05  FILLER   PIC X(13)  VALUE    '670119 009754'.
               05  FILLER   PIC X(13)  VALUE    '670120 008106'.
               05  FILLER   PIC X(13)  VALUE    '670121 009681'.
               05  FILLER   PIC X(13)  VALUE    '670122 009754'.
               05  FILLER   PIC X(13)  VALUE    '670124 008106'.
               05  FILLER   PIC X(13)  VALUE    '999999 000000'.
           02  PREV-ADJ-DATA2 REDEFINES PREV-ADJ-DATA.
               05  PREV-TAB OCCURS 3484 TIMES
                            ASCENDING KEY IS PREV-PROV
                            INDEXED BY PREV-IDX.
                   10  PREV-DATA-TAB.
                       15  PREV-PROV        PIC X(06).
                       15  FILLER           PIC X(01).
                       15  PREV-WI          PIC 9(02)V9(04).
